[
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "پندار کی ویران سرا میں نہیں رہتے",
      "ہم خاک پہ رہتے ہیں خلا میں نہیں رہتے",
      "",
      "قامت بھی ہماری ہے ، لبادہ بھی ہمارا",
      "مانگی ہوئی دستار و قبا میں نہیں رہتے",
      "",
      "ہم کشمکشِ دہر کے پالے ہوئے انسان",
      "ہم گریہ کناں کرب و بلا میں نہیں رہتے",
      "",
      "خاشاکِ زمانہ ہیں ، نہیں خوف ہمیں کوئی",
      "آندھی سے ڈریں وہ جو ہوا میں نہیں رہتے",
      "",
      "ہم چھوڑ بھی دیتے ہیں کُھلا توسنِ دل کو",
      "تھامے ہوئے ہر وقت لگامیں نہیں رہتے",
      "",
      "روحوں میں اتر جاتے ہیں تیزاب کی صورت",
      "لفظوں میں گھلے زہر صدا میں نہیں رہتے",
      "",
      "احساس کے موسم کبھی ہو جائیں جو بے رنگ",
      "خوشبو کے ہنر دستِ صبا میں نہیں رہتے",
      "",
      "اونچا نہ اُڑو اپنی ضرورت سے زیادہ",
      "تھک جائیں پرندے تو فضا میں نہیں رہتے",
      "",
      "دستار بنے جاتے ہیں اب شہرِ طلب میں",
      "کشکول کہ اب دستِ گدا میں نہیں رہتے",
      "",
      "اس خانہ بدوشی میں خدا لائے نہ وہ دن",
      "جب بچھڑے ہوئے یار دعا میں نہیں رہتے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "راز در پردۂ دستار و قبا جانتی ہے",
      "کون کس بھیس میں ہے خلقِ خدا جانتی ہے",
      "",
      "کون سے دیپ نمائش کے لئے چھوڑنے ہیں",
      "کن چراغوں کو بجھانا ہے ہوا جانتی ہے",
      "",
      "یہ کبھی مجھ کو اکیلا نہیں ہونے دیتی",
      "میری تنہائی مجھے تم سے سوا جانتی ہے",
      "",
      "آپ ایجاد کریں جور و ستم روز نئے",
      "بھول جانے کا ہنر میری وفا جانتی ہے",
      "",
      "نشۂ عشق مجھے اور ذرا کر مدہوش",
      "بے خودی میری ابھی میرا پتہ جانتی ہے",
      "",
      "دشت منظور ہے لیکن مجھے منظور نہیں",
      "ایسی بستی جو شرافت کو خطا جانتی ہے",
      "",
      "کون سے بُت ہیں جنہیں دست ِ پیمبر توڑے",
      "اُمّتِ حرص تو پیسے کو خدا جانتی ہے",
      "",
      "نسبتیں لاکھ بدل ڈالے زمانہ لیکن",
      "ایک دنیا تو مجھے اب بھی ترا جانتی ہے",
      "",
      "اک مری چشمِ تماشہ ہے کہ ہوتی نہیں سیر",
      "فکرِ منزل ہے کہ رُکنے کو برا جانتی ہے",
      "",
      "میرے الفاظ ہیں دراصل قلم کے آنسو",
      "روشنائی لہو بننے کی ادا جانتی ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "یہ طبیعت مجھے اپنا نہیں بننے دیتی",
      "جیسے سب ہیں مجھے ویسا نہیں بننے دیتی",
      "",
      "آنکھ ایسی ہے کہ دیکھے نہیں جاتے حالات",
      "سوچ ایسی ہے کہ اندھا نہیں بننے دیتی",
      "",
      "دُور اندر سے کہیں ایک اُبھرتی ہوئی چیخ",
      "میرے احساس کو بہرا نہیں بننے دیتی",
      "",
      "ظلم ایسا ہے کہ دنیا کی زبانیں خاموش",
      "یہ خموشی مجھے گونگا نہیں بننے دیتی",
      "",
      "دلِ وحشی مجھے ہونے نہیں دیتا سرسبز",
      "چشم ِ گریہ ہے کہ صحرا نہیں بننے دیتی",
      "",
      "دشت ایسا ہے کہ چھتنار شجر ہیں ہر گام",
      "دھوپ ایسی ہے کہ سایا نہیں بننے دیتی",
      "",
      "خاک ایسی ہے کہ ہر ذرہ طلبگار ِ نمو",
      "رُت وہ ظالم کہ شگوفہ نہیں بننے دیتی",
      "",
      "شہر ایسا ہے کہ تاحدِ نظر امکانات",
      "بھیڑ ایسی ہے کہ رستہ نہیں بننے دیتی",
      "",
      "حرمتِ خامہ وہ ضدی جو کسی قیمت پر",
      "سکۂ حرف کو پیسہ نہیں بننے دیتی",
      "",
      "کیا قیامت ہے کہ اب میرے تصور کی تھکن",
      "بادلوں میں کوئی چہرہ نہیں بننے دیتی",
      "",
      "میں کسی اور کا بنتا تو منافق ہوتا",
      "یہ انا مجھ کو کسی کا نہیں بننے دیتی",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اُجلی ردائے عکس کو میلا کہیں گے لوگ",
      "آئینہ مت دکھائیے ، جھوٹا کہیں گے لوگ",
      "",
      "شاخیں گرا رہے ہیں مگر سوچتے نہیں",
      "پھر کس شجر کی چھاؤں کو سایہ کہیں گے لوگ",
      "",
      "واقف ہیں رہبروں سے یہ عادی سراب کے",
      "دریا دکھائیے گا تو صحرا کہیں گے لوگ",
      "",
      "شہرت کی روشنی میں مسلسل اُچھا لئے",
      "پتھر کو آسمان کا تارا کہیں گے لوگ",
      "",
      "آغازِ داستاں ہے ذرا سنتے جائیے",
      "آگے تو دیکھئے ابھی کیا کیا کہیں گے لوگ",
      "",
      "جو کچھ برائے زیبِ بیاں کہہ رہے ہو آج",
      "کل اُس کو داستان کا حصہ کہیں گے لوگ",
      "",
      "لوگوں کو اختیار میں حصہ تو دیجئے",
      "اربابِ اختیار کو اپنا کہیں گے لوگ",
      "",
      "فردِ عمل پہ کر کے رقم اپنے فیصلے",
      "اپنے لکھے کو بخت کا لکھا کہیں گے لوگ",
      "",
      "شکوہ کرو نہ دیدۂ ظاہر پرست کا",
      "جیسے دکھائی دیتے ہو ویسا کہیں گے لوگ",
      "",
      "کس شہرِخود فریب میں جیتے ہو تم ظہیؔر",
      "اپنا سمجھ رہے ہیں نہ اپنا کہیں گے لوگ",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "آنکھوں میں ہوں سراب تو کیا کیا دکھائی دے",
      "پانی کے درمیان بھی صحرا دکھائی دے",
      "",
      "بینائی رکھ کے دیکھ مری ، اپنی آنکھ میں",
      "شاید تجھے بھی درد کی دنیا دکھائی دے",
      "",
      "دنیا نہیں نمائشِ میکانیات ہے",
      "ہر آدمی مشین کا پرزہ دکھائی دے",
      "",
      "آدم غبارِ وقت میں شاید بکھر گیا",
      "حوّا زمینِ رزق پہ تنہا دکھائی دے",
      "۔ق۔",
      "جس انقلابِ نور کا چرچا ہے شہر میں",
      "مجھ کو تو وہ بھی رات کا حربہ دکھائی دے",
      "",
      "نکلو تو ہرگلی میں اندھیرے کا راج ہے",
      "دیکھو تو کچھ گھروں میں اُجالا دکھائی دے",
      "",
      "شطرنج ہے سیاست ِ دوراں کا کھیل بھی",
      "حاکم بھی اپنے تخت پہ مہرہ دکھائی دے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اپنے ہر درد کا درمان بنائے رکھا",
      "غم اک ایسا تھا کہ سینے سے لگائے رکھا",
      "",
      "پاسِ ناموسِ مسیحا تھا مجھے درپردہ",
      "زخمِ جاں سوز کو مرہم سے بچائے رکھا",
      "",
      "ایک اندیشۂ ناقدریِ عالَم نے مجھے",
      "عمر بھر چشمِ زمانہ سے چھپائے رکھا",
      "",
      "کبھی جانے نہ دیا گھر کا اندھیرا باہر",
      "اک دیا میں نے دریچے میں جلائے رکھا",
      "",
      "دیکھ کر برہنہ پا راہ کے کانٹوں نے مجھے",
      "رشکِ گلشن مرے رستے کو بنائے رکھا",
      "",
      "اصل کردار تماشے کے وہی لوگ تو تھے",
      "وقت نے جن کو تماشائی بنائے رکھا",
      "",
      "دیکھ سکتا تھا بہت دور تک آگے میں ظہیؔر",
      "جب تک اِن شانوں پہ بچوں کو اٹھائے رکھا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اُسی حوالے سے ہر بار میں نشانہ ہوا",
      "جسے بھلائے ہوئے بھی مجھے زمانہ ہوا",
      "",
      "یہ خوئے دربدری تو مرے مزاج میں تھی",
      "کسی کا مل کے بچھڑنا تو اک بہانہ ہوا",
      "",
      "نکل سکا نہ اک اندیشۂ فراق سے دل",
      "خیالِ وصل کبھی حرفِ مدعا نہ ہوا",
      "",
      "وفا تو محوِ ستائش تھی اس کو کیا معلوم",
      "جمالِ یار حقیقت سے کب فسانہ ہوا",
      "",
      "کسی نرالے سے گاہک کے انتظار میں دل",
      "دکان ِ درد پہ رکھے ہوئے پرانا ہوا",
      "",
      "کوئی بتائے مجھے کاروان ِ عمرِ  رواں",
      "کہاں سے آیا ، کدھر ٹھہرا ، کب روانہ ہوا",
      "",
      "یہ بستیاں ہیں جو راہوں میں قافلے تھے کبھی",
      "جہاں بھی رک گیا کوئی وہیں ٹھکانہ ہوا",
      "",
      "عجیب شہر تھا جس نے دیارِ ہجرت میں",
      "مجھے بنا لیا اپنا مگر مرا نہ ہوا",
      "",
      "مری وفاؤں کا سودا مری ضرورت سے",
      "کچھ اس طرح سے ہوا ہے کہ دل بُرا نہ ہوا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "بازی انا کی ، بھوک سے کیسی بری لگی",
      "بھوکا بُرا لگا ، کبھی روٹی بری لگی",
      "",
      "خانہ بدوشیوں کے یہ دکھ بھی عجیب ہیں",
      "چوکھٹ پر اپنے نام کی تختی بری لگی",
      "",
      "روشن دریچے کر گئے کچھ اور بھی اداس",
      "صحرا مزاج آ نکھ کو بستی بری لگی",
      "",
      "دشمن کی ناخدائی گوارا نہ تھی ہمیں",
      "غرقاب ہوتے ہوتے بھی کشتی بری لگی",
      "",
      "خود پر دیارِ غیر کی نسبت نہ رکھ سکا",
      "بیٹے کو ماں کے نام کی گالی بری لگی",
      "",
      "سیکھا تھا ننگے پیروں سے چلنا جہاں ظہیؔر",
      "پاپوش مل گئے تو وہ مٹی بری لگی",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "سب کاروبار ِ نقد و نظر چھوڑنا پڑا",
      "بکِنے لگے قلم تو ہُنر چھوڑنا پڑا",
      "",
      "قربانی مانگتی تھی ہر اک شاخ ِ بے ثمر",
      "بسنے نہ پائے تھے کہ شجر چھوڑنا پڑا",
      "",
      "کرنا تھا جو سفر ہمیں ، ہم نے نہیں کیا",
      "بچوں کو آج اس لئے گھر چھوڑنا پڑا",
      "",
      "آ تو گئے ہو ، سوچ لو جاؤ گے پھر کہاں",
      "یہ شہر ِ بد لحاظ اگر چھوڑنا پڑا",
      "",
      "گھر سے چلا تھا بار ِ ثقافت اٹھا کے میں",
      "رستے میں تھوڑا تھوڑا مگر چھوڑنا پڑا",
      "",
      "نفرت کے سانپ آ گئے گھر تک تو میں ظہیؔر",
      "اتنا ڈرا کہ خوف ِ سفر چھوڑنا پڑا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "چراغِ شام جلا ہے کہ دل جلا کوئی",
      "حصارِ ضبطِ فغاں سے نکل چلا کوئی",
      "",
      "نہ کوئے یار میں آوارہ کوئی دیوانہ",
      "نہ بزمِ یار میں باقی ہے منچلا کوئی",
      "",
      "بدل گیا ہے سراسر مزاجِ اہلِ جنوں",
      "نہ شوقِ مرگ نہ جینے کا ولولہ کوئی",
      "",
      "سلامت آگئے مقتل سے غازیانِ عشق",
      "نہ سر گرے ہیں نہ خیمہ کہیں جلا کوئی",
      "",
      "عجیب راہیِ حق ہیں وہ جن کی راہوں میں",
      "کوئی دمشق ، نہ کوفہ ، نہ کربلا کوئی",
      "",
      "وہی تو جادۂ منزل ہے رہروانِ وفا",
      "وہ رہگزار کہ جس پر نہیں چلا کوئی",
      "",
      "فدائیانِ محبت كی بیعتیں ہیں الگ",
      "امیر ِ شہر سے کہہ دے یہ برملا کوئی",
      "",
      "مآلِ کلمۂ حق سے ظہیؔر ڈر کیسا",
      "صلیب و دار پہ مرتا بھی ہے بھلا کوئی",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "بنا کے پھر مجھے تازہ خبر نہ جاؤ تم",
      "اب آگئے ہو تو پھر چھوڑ کر نہ جاؤ تم",
      "",
      "میں ڈرتے ڈرتے سناتا ہوں اپنے اندیشے",
      "میں کُھل کے یوں نہیں کہتا کہ ڈر نہ جاؤ تم",
      "",
      "کہاں کہاں مجھے ڈھونڈو گے پرزہ پرزہ ہوں",
      "مجھے سمیٹنے والے! بکھر نہ جاؤ تم",
      "",
      "بڑھے ہو تم مری جانب تو ڈر یہ لگتا ہے",
      "مرے قریب سے آکر گزر نہ جاؤ تم",
      "",
      "خیال و فکر کی سمتیں بدلتی رہتی ہیں",
      "پلٹ سکو نہ جدھر سے اُدھر نہ جاؤ تم",
      "",
      "کرو نہ کاوشیں اُن کی نظر میں رہنے کی",
      "ظہیؔر اُن کی نظر سے اُتر نہ جاؤ تم",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "البم سے کئی عکس پرانے نکل آئے",
      "لمحات کے پیکر میں زمانے نکل آئے",
      "",
      "بھولے ہوئے کچھ نامے ، بھلائے ہوئے کچھ نام",
      "کاغذ کے پلندوں سے خزانے نکل آئے",
      "",
      "تھے گوشہ نشیں آنکھ میں آنسو مرے کب سے",
      "عید آئی تو تہوار منانے نکل آئے",
      "",
      "حیرت سے سنا کرتے تھے غیروں کے سمجھ کر",
      "خود اپنے ہی لوگوں کے فسانے نکل آئے",
      "",
      "پتھریلی زمینیں تھیں ، مگر حوصلہ سچا",
      "ہم تیشہ لئے پیاس بجھانے نکل آئے",
      "",
      "اک ناوکِ بے نام تھا ہر روز عقب سے",
      "ہم باندھ کے سینوں پہ نشانے نکل آئے",
      "",
      "گھر سے نہ نکلنا بھی روایت تھی ہماری",
      "بس اپنی روایات بچانے نکل آئے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اک جہانِ رنگ و بو اعزاز میں رکھا گیا",
      "خاک تھا میں ، پھول کے انداز میں رکھا گیا",
      "",
      "حیثیت اُس خاک کی مت پوچھئے جس کے لئے",
      "خاکدانِ سیم و زر آغاز میں رکھا گیا",
      "۔ق۔",
      "اک صلائے عام تھی دنیا مگر میرے لئے",
      "اک تکلف دعوتِ شیراز میں رکھا گیا",
      "",
      "ایک خوابِ آسماں دے کر میانِ آب و گِل",
      "بال و پر بستہ مجھے پرواز میں رکھا گیا",
      "",
      "بربطِ منظر پہ رکھ کر شرطِ مضرابِ نظر",
      "نغمہائے بے صدا کو ساز میں رکھا گیا",
      "",
      "ایک خوئے جستجو دی ، ایک دستِ ممکنات!",
      "زندگی کو آدمی سے راز میں رکھا گیا",
      "",
      "اک جہانِ حرف کتنی بار ٹوٹا اور بنا",
      "تب کہیں احساس کو الفاظ میں رکھا گیا",
      "",
      "بن گئی میرا تشخص میری خاموشی ظہیؔر",
      "درد کچھ ایسا مری آواز میں رکھا گیا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "میں اشکبار ہوں ناممکنہ کی خواہش میں",
      "نمک مثال گھلے جارہا ہوں بارش میں",
      "",
      "دیا ہے میں نے ہی دشمن کو وار کا موقع",
      "مرا بھی ہاتھ ہے اپنے خلاف سازش میں",
      "",
      "خمارِ شام ، غمِ تیرگی ، امیدِ سحر",
      "عجیب عکس ہیں بجھتے دیئے کی تابش میں",
      "",
      "بجا ہے طعنۂ باطل مری دلیلوں پر",
      "ہزار جہل بھی شامل ہیں میری دانش میں",
      "",
      "یہ جبرِ راہ گزر ہے ، سفر نہیں میرا",
      "کہ دل شریک نہیں منزلوں کی کاوش میں",
      "",
      "وہ عکس ہوں جو کسی آنکھ سے بچھڑ کے ظہیؔر",
      "بھٹک رہا ہے وصالِ نظر کی خواہش میں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "کوئی فخر ِزہد و تقویٰ ، نہ غرورِ پارسائی",
      "مجھے سب خبر ہے کیا ہے مرےنفس کی کمائی",
      "",
      "مجھے جب کبھی اندھیرے ملے راہِ جستجو میں",
      "نئی مشعل ِ تمنا ترے نام کی جلائی",
      "",
      "اسے کیوں نہ سر پہ رکھوں ، یہ جزائے بندگی ہے",
      "ترے نام سے مزیّن مرا کاسۂ گدائی",
      "",
      "وہ جو ضبط سے نہ نکلا ، کبھی نطق تک نہ پہنچا",
      "اُسی حرفِ نارسا کی ہوئی عرش تک رسائی",
      "",
      "ہے مرا وجود ثابت ، ہے مرا شمار ممکن",
      "مرے صفر سے ہے پہلے تری ذات کی اکائی",
      "",
      "نہ جھکا سکے جو سر کو وہ عمامۂ فضیلت",
      "سرِ بزم  ِعلم و دانش ہے کلاہِ خود نمائی",
      "",
      "مرے چارہ گر سے کہہ دو یہ مرض ہے آگہی کا",
      "نہ کرے گی کام اِس میں کوئی نیند کی دوائی",
      "",
      "مری چشمِ خوش گماں تُو مری دوست ہے کہ دشمن",
      "تو نے خواب ایسے دیکھے مجھے نیند ہی نہ آئی",
      "",
      "ہیں بجھے بجھے سے دونوں ،سبھی رونقوں سے خالی",
      "مری بزمِ ترکِ الفت ، ترا جشنِ بے وفائی",
      "",
      "کہیں لے گئیں ہوائیں وہ محبتوں کے فانوس",
      "شب و روز بجھ رہے ہیں مہ و سالِ آشنائی",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "کیا سخن تھے کہ جو دل میں بھی چھپائے نہ گئے",
      "لبِ اظہار تک آئے پہ سُنائے نہ گئے",
      "",
      "ضعفِ مضرابِ تمنا کوئی دیکھے تو مرا",
      "تار بھی بربطِ ہستی کے ہلائے نہ گئے",
      "",
      "دل تو کافر ہی رہا توڑ کے بت خانہ بھی",
      "بت کچھ ایسے تھے کہ نظروں سے گرائے نہ گئے",
      "",
      "میرے زخموں کا بھی درمان تو ممکن تھا مگر",
      "زخم ایسے تھے مسیحا کو دکھائے نہ گئے",
      "",
      "بارِ نفرت لئے پھرتی ہے یہ دنیا کیسے!",
      "ہم سے آزارِ محبت ہی اُٹھائے نہ گئے",
      "",
      "دل کی دنیا پہ حکومت تو ملی تھی کچھ روز",
      "چام کے دام مگر ہم سے چلائے نہ گئے",
      "",
      "ہم وہ نادارِ محبت ہیں کہ ہنگامِ وداع",
      "گوہرِ اشک بھی پلکوں پہ سجائے نہ گئے",
      "",
      "ہم دوانوں سے خفا کیوں ہوئے اربابِ خرد",
      "اُن کی دہلیز پہ ہم تو کبھی آئے نہ گئے",
      "",
      "ہم نفس رات کے پھونکوں سے بجھا دیتے ہیں",
      "جو دیئے تیز ہواؤں سے بجھائے نہ گئے"
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "بزمِ یاراں نہ رہی ، شہرِ تمنا نہ رہا",
      "زندگی تیرا برا ہو ، کوئی میرا نہ رہا",
      "",
      "آرزو کاسۂ حسرت میں ڈھلی جاتی ہے",
      "دستِ امید میں باقی کوئی سکہ نہ رہا",
      "",
      "تم سے شکوہ نہیں شکوہ ہے زمانے سے مجھے",
      "نہ رہے تم تو کوئی پوچھنے والا نہ رہا",
      "",
      "بام و در بھی ہیں میسر مجھے دستار بھی آج",
      "یہ الگ بات کہ سر پر کوئی سایا نہ رہا",
      "",
      "اس طرح اپنا بنایا غمِ الفت نے مجھے",
      "غمِ دنیا کو بھی مجھ سے کوئی شکوہ نہ رہا",
      "",
      "اٹھ گیا بزمِ مراسم سے دلِ زار بھی اب",
      "ایک بے نام سا ہوتا تھا جو رشتہ ، نہ رہا",
      "",
      "بے نوا کر گیا مجھ کو بھی فریبِ دنیا",
      "لبِ ایقان پہ جاری کوئی کلمہ نہ رہا",
      "",
      "کیا ملا کارِ مسیحائی سےآخر مجھ کو",
      "غم بھی غیروں کے ہوئے درد بھی اپنا نہ رہا",
      "",
      "خوابِ منزل تھے نشاں جس کی مسافت میں  ظہیؔر",
      "ہم سفر مل گئے آخر تو وہ رستہ نہ رہا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "حسرتیں چھوڑ گئیں کوچۂ و بازار کے بیچ",
      "لوگ ٹوٹے ہوئے ، سالم در و دیوار کے بیچ",
      "",
      "زینتِ صفحۂ اول ہے تماشائے حیات",
      "آدمی چھوٹی خبر ہے کہیں اخبار کے بیچ",
      "",
      "بیش و کم کیا کریں اب ، دام جو لگتے ہیں لگیں",
      "نقدِ جاں رکھ چکے جب درہم و دینار کے بیچ",
      "",
      "نخلِ اندیشۂ صد شاخِ زیاں اگتا ہے",
      "ہر گلستانِ شجر دار و ثمر بار کے بیچ",
      "",
      "موجۂ بادِ صبا زلف سے اُن کی نہ الجھ",
      "گُل نہیں دل ہے مرا گیسوئے خم دار کے بیچ",
      "",
      "مل گیا مجھ کو مرے سارے سوالوں کا جواب",
      "اک توقف تھا ترے کلمۂ انکار کے بیچ",
      "",
      "تمہیں مل جائے گی پہچان مرے لفظوں سے",
      "کبھی پڑھ کر مجھے دیکھو مرے اشعار کے بیچ",
      "",
      "جو ملا شاخِ محبت سے اُسے چوم لیا",
      "فرق رکھا ہی نہیں ہم نے گل و خار کے بیچ",
      "",
      "یادِ یارانِ وطن اور کبھی ذکرِ وطن!",
      "یہ دوائیں ہیں مری مجمعِ آزار کے بیچ",
      "",
      "ہمیں مرنا بھی ہے اپنی ہی روایات پر آج",
      "اور جینا بھی ہے مرتی ہوئی اقدار کے بیچ",
      "",
      "اک تنازع ہے ہنر عہدِ ضرورت میں ظہیرؔ",
      "کاسۂ دادِ فن و کیسۂ فنکار کے بیچ",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "چبھی ہے دل میں وہ نوکِ سنانِ وہم و گماں",
      "ہوا ہے نقشِ سویدا نشانِ وہم و گماں",
      "",
      "میں ایک سایۂ لرزاں ہوں ہست و نیست کے بیچ",
      "مرا وجود ہے بارِ گرانِ وہم و گماں",
      "",
      "نہ کھا فریب خریدارِ رنگ و بوئے چمن",
      "محیطِ صحنِ چمن ہے دکانِ وہم و گماں",
      "",
      "قدم قدم پہ ہے دامن کشاں یقینِ بہار",
      "روش روش پہ ہویدا خزانِ وہم و گماں",
      "",
      "وہ ایک لفظ حقیقت مدار ہے جس پر",
      "لکھا ہوا ہے کہیں در بیانِ وہم و گماں",
      "",
      "عیاں تھا عالمِ خواب و خیال میں کیا کیا",
      "کھلی جو آنکھ تو سب داستانِ وہم و گماں",
      "",
      "تمام حکمتیں باطل ہیں عشق کے آگے",
      "تمام فلسفے سوداگرانِ وہم و گماں",
      "",
      "بدونِ میرِ سفر ہیں جو رہروانِ ہدیٰ",
      "بھٹک رہے ہیں پسِ کاروانِ وہم و گماں",
      "",
      "مرے لہو میں جزیرہ تری محبت کا",
      "یقین زارِ حقیقت میانِ وہم و گماں!",
      "",
      "نویدِ عالمِ امکان ہے خیال ترا",
      "سمٹ رہا ہےمسلسل جہانِ وہم و گماں",
      "",
      "ظہیر  ؔناوکِ بے زور ہے سخن بھی ترا",
      "گرفتِ فکر بھی جیسے کمانِ وہم و گماں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "دیارِ شوق کے سب منظروں سے اونچا ہے",
      "یہ سنگِ در ترا سار ے گھروں سے اونچا ہے",
      "",
      "مقامِ عجز کو بخشی گئی ہے رفعتِ خاص",
      "جو سر خمیدہ ہے وہ ہمسروں سے اونچا ہے",
      "",
      "فرازِ طور کی خواہش نہ کر ابھی اے عشق!",
      "یہ آسمان ابھی تیرے پروں سے اونچا ہے",
      "",
      "خدا مدد! کہ یہ شیطانِ نفسِ امّارہ",
      "مرے اُچھالے ہوئے کنکروں سے اونچا ہے",
      "",
      "فریبِ قامتِ رہبر نہ کھاؤ ہمسفرو!",
      "وہ دیکھو قدِ علَم رہبروں سے اونچا ہے",
      "",
      "یہ اشکِ ہجر تو سیلاب بن گیا ہے ظہیؔر",
      "جدھر بھی دیکھئے پانی سروں سے اونچا ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اپنی قربت کے سب آثار بھی لیتے جانا",
      "اب جو جاؤ در و دیوار بھی لیتے جانا",
      "",
      "چھوڑ کر جا ہی رہے ہو تو پھر اپنے ہمراہ",
      "ساتھ رہنے کا وہ اقرار بھی لیتے جانا",
      "",
      "دکھ تو ہوگا مگر احساس ہو کم کم شاید",
      "جاتے جاتے مرا پندار بھی لیتے جانا",
      "",
      "بیخودی مجھ سے مری چھین کے جانے والے",
      "آگہی کے کڑے آزار بھی لیتے جانا",
      "",
      "جشنِ آزادیِ اظہار میں اے نغمہ گرو!",
      "میری زنجیر کی جھنکار بھی لیتے جانا",
      "",
      "اُن سے ملنے کبھی جاؤ تو بطرزِ سوغات",
      "مجھ سے مل کر مرے اشعار بھی لیتے جانا",
      "",
      "بزم ِ یاراں نہیں حاکم کی عدالت ہے ظہیؔر",
      "سر پر اُونچی کوئی دستار بھی لیتے جانا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "آخر میں کھلا آ کر یہ راز کہانی کا",
      "انجام سے ہوتا ہے آغاز کہانی کا",
      "",
      "اس عہدِ تصنع کی ہر بات ہے پردوں میں",
      "عنواں نہیں ہوتا اب غماز کہانی کا",
      "",
      "تکرار بناتی ہے اب جھوٹ کو سچائی",
      "تشہیر بدلتی ہے انداز کہانی کا",
      "",
      "جب چاہے لے آتا ہے منظر پہ نیا کردار",
      "رکھا ہے مصنف نے در باز کہانی کا",
      "",
      "بننا ہی تھا آخر کو افسانۂ رسوائی",
      "یاروں کو بنایا تھا ہمراز کہانی کا",
      "",
      "مر کر بھی نہیں مرتے کردار محبت کے",
      "رکھتا ہے انہیں زندہ اعجاز کہانی کا",
      "",
      "افسانۂ ہستی میں وہ موڑ بھی آتا ہے",
      "جب ساتھ نہیں دیتے الفاظ کہانی کا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اس شہرِ شب زدہ میں کہ جنگل سے کم نہیں",
      "جگنو شعورِ ذات کا مشعل سے کم نہیں",
      "",
      "اک مختصر سا لمحۂ بے نور و بے یقین",
      "تقویمِ شب میں ساعتِ فیصل سے کم نہیں",
      "",
      "اک یاد ِ مشکبو تری زلفِ سیاہ کی",
      "چشمِ شبِ فراق میں کاجل سے کم نہیں",
      "",
      "دامانِ احتیاج میں دینارِ بے طلب",
      "جوفِ شکم میں تیغ ِ مصقّل سے کم نہیں",
      "",
      "حاصل ہے سخت کوشیِ عمرِ خراب کا",
      "اک خطۂ زمین جو دلدل سے کم نہیں",
      "",
      "بنجر زمین ، دھوپ اور اک خالی آسمان!",
      "سایہ کسی پرند کا بادل سے کم نہیں",
      "",
      "سیالِ غم بھی ڈھونڈ کے تم نے پیا ظہیؔر",
      "تریاق جس کا زہر کی بوتل سے کم نہیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "آتشِ رنج و الم ، سیلِ بلا سامنے ہے",
      "پیکر ِ خاک میں ہونے کی سزا سامنے ہے",
      "",
      "شعلۂ جاں ہے مرا اور ہوا سامنے ہے",
      "زندگی جلوہ نما ہے کہ قضا سامنے ہے",
      "",
      "ہر طرف ڈھونڈنے والو! اُسے دیکھو تو سہی",
      "وہ کہیں اور نہیں ہے بخدا سامنے ہے",
      "",
      "منعکس ہوں میں زمانے میں ، زمانہ مجھ میں",
      "خود بھی آئینہ ہوں اور عکس نما سامنے ہے",
      "",
      "لغزش ِ پائے تمنا کا بھی امکان نہیں",
      "جادۂ شوق میں گر اُس کی رضا سامنے ہے",
      "",
      "کیا خبر کون سا جلوہ ہے پسِ پردۂ غیب",
      "جس طرف دیکھئے اک راز نیا سامنے ہے",
      "",
      "پھر وہی سوزِ دروں میرا ، وہی غفلتِ جاں",
      "پھر وہی ساعتِ تجدیدِ وفا سامنے ہے",
      "",
      "مجھے ناموس ِ غم ِ عشق ہے مانع ورنہ",
      "چارہ گر  بیٹھے ہیں پہلو میں ، دوا سامنے ہے",
      "",
      "اپنے بارے میں نہ کھا عصمتِ یوسف کی قسم",
      "پہلے یہ دیکھ تو لے چاکِ قبا سامنے ہے",
      "",
      "ہم بھلا کون سے سقراطِ زماں ہیں جو ظہیؔر",
      "روز اک زہر بھرا جام نیا سامنے ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "سر پہ رکھے گا مرے دستِ اماں کتنی دیر",
      "باد ِ بے درد میں تنکوں کا مکاں کتنی دیر",
      "",
      "پوچھتی ہیں مری اقدار مرے بچوں سے",
      "ساتھ رکھو گے ہمیں اور میاں کتنی دیر",
      "",
      "بجھ گئی آگ تمناؤں کی جلتے جلتے",
      "کچھ دھواں باقی ہے لیکن یہ دھواں کتنی دیر",
      "",
      "رزق برحق ہے مگر یہ کسے معلوم کہ اب",
      "رزق لکھا ہے مقدر میں کہاں کتنی دیر",
      "",
      "جا چکے پتے ، ہوائیں بھی چلی جائیں گی",
      "بے سبب ٹھہرے گی پیڑوں پہ خزاں کتنی دیر",
      "",
      "ریگ زاروں میں کسے ڈھونڈنے نکلے ہو ظہیؔر",
      "ریت پر رہتے ہیں قدموں کے نشاں کتنی دیر",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "مجھ کو درونِ ذات کا نقشہ دکھائی دے",
      "آئینہ وہ دکھاؤ کہ چہرہ دکھائی دے",
      "",
      "آدابِ تشنگی نے سکھائے ہیں وہ ہنر",
      "پیاسے کو مشتِ خاک میں کوزہ دکھائی دے",
      "",
      "ایسی رہی ہیں نسبتیں دیوارِ یار سے",
      "کوئے ستم کی دھوپ بھی سایا دکھائی دے",
      "",
      "ہر لب پہ حرفِ وعظ و نصیحت ہے شہر میں",
      "ہر شخص آسمان سے اُترا دکھائی دے",
      "",
      "افشاں کسی کسی میں ہی انوارِ فیض ہے",
      "ویسے تو ہرچراغ ہی جلتا دکھائی دے",
      "",
      "اُن کے ورق ورق پہ ہے نامِ خدا رقم",
      "جن کی کتابِ زندگی سادہ دکھائی دے",
      "",
      "تمثیل گاہ ِ وقت میں بیٹھے ہیں منتظر",
      "پردہ اُٹھے تو کوئی تماشا دکھائی دے",
      "",
      "دنیا فریب زارِ نظر ہے عجب ظہیؔر",
      "آنکھیں نہ ہوں تو خاک بھی سونا دکھائی دے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "تن زہر میں بجھے ہوئے ، دل آگ میں جلے ہوئے",
      "کن منزلوں تک آ گئے کس راہ پر چلے ہوئے",
      "",
      "جل بجھ گئی ہر آرزو جس خاکِ کوئے یار میں",
      "ہم ہیں مثالِ مشکبو اُس راکھ کو مَلے ہوئے",
      "",
      "چھیڑا ہے جب بھی سازِ نو سوزِ غمِ حیات نے",
      "رقصاں ہوئے ہیں پا بہ گِل ہم گیت میں ڈھلے ہوئے",
      "",
      "زنجیرِ ربط کٹ گئی لیکن گلوئے ہجر میں",
      "اب تک دیارِ ناز کے کچھ طوق ہیں ڈلے ہوئے",
      "",
      "سختی کشانِ راہِ عشق ذروں سے بن گئے نجوم",
      "اوجِ فلک پر آگئے پاتال سے چلے ہوئے",
      "",
      "کچھ رہبروں کی بھول سے دیوارِ راہ بن گئے",
      "سمتِ سفر کے مسئلے برسوں سے تھے ٹلے ہوئے",
      "",
      "ایسا فشارِ وقت تھا تاریکیوں میں جبر کی",
      "ہم کوہِ نور بن گئے ظلمات میں پلے ہوئے",
      "",
      "راہِ فنا تھی راہِ حق ، دار و رسن تھے جابجا",
      "دیکھا ورائے مرگ تو آسان مرحلے ہوئے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "آگہی سو غموں کا اک غم ہے",
      "ایک دل اور ہزار ماتم ہے",
      "",
      "جب سے دیکھا ہے چہرۂ ہستی",
      "ہونٹ خاموش ، آنکھ پُر نم ہے",
      "",
      "صرف باہر نہیں ہے سناٹا",
      "میرے اندر بھی ہُو کا عالم ہے",
      "",
      "لمحہ لمحہ بکھر رہا ہوں میں",
      "عکس کیوں آئنے میں باہم ہے",
      "",
      "ہاتھ ملتا ہوں خالی دامن ہوں",
      "حاصلِ عمر دام و درہم ہے",
      "",
      "ذہن میں اُگ رہے ہیں اندیشے",
      "پھر نئے فیصلوں کا موسم ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "جانے عقب سے تیر تھا کس کی کمان کا",
      "لیتے ہیں لوگ نام کسی مہربان کا",
      "",
      "آشوبِ تشنگی میں یہ تسکیں بھی کم نہیں",
      "احساں نہیں ہے سر پہ کسی سائبان کا",
      "",
      "دل مصلحت پسند تھا ، شوق انتہا پرست",
      "رستہ میں ڈھونڈتا ہی رہا درمیان کا",
      "",
      "دنیا جھلک رہی ہے جو مجھ میں تو کیا عجب",
      "میں آئنہ ہوں اپنے زمان و مکان کا",
      "",
      "تسلیم کرچکا ہوں مقدر کے فیصلے",
      "مجھ کو نہیں ہے خوف کسی امتحان کا",
      "",
      "ہر دردِ نو پہ نغمۂ تازہ لکھیں گے ہم",
      "تلخی نہیں مزاج ہماری زبان کا",
      "",
      "سارے ستم زمین پر اہلِ زمیں کے ہیں",
      "شکوہ کروں تو کیسے کروں آسمان کا",
      "",
      "اوپر فلک سے جہلِ عقیدت نے کردیا",
      "منبر بلند واعظِ شعلہ بیان کا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "دامنِ غیر سے شعلوں کو ہوا دیتے ہیں",
      "آگ بڑھ جائے تو اپنوں کو صدا دیتے ہیں",
      "",
      "وہ تو پھر حسنِ مجسم ہے اُسے کیا کہیے",
      "لوگ پتھر کو بھی بھگوان بنا دیتے ہیں",
      "",
      "یوں بھی ہوتا ہے سمجھ ہی نہ سکیں ہم جس کو",
      "اُس پر الزام بدلنے کا لگا دیتے ہیں",
      "",
      "رات بھر خون جلاتے ہیں غزل لکھ لکھ کر",
      "صبح ہوتی ہے تو کاغذ بھی جلا دیتے ہیں",
      "",
      "دمِ رخصت ہی سہی عقدۂ ہستی تو کھُلا",
      "دستِ قاتل تجھے جینے کی دعا  دیتے ہیں",
      "",
      "ہم کو شاہوں سے عدالت کی توقع تو نہیں",
      "آپ کہتے ہیں تو زنجیر ہلا دیتے ہیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اختلافاتِ نظر کو بھی گوارا نہ کریں",
      "غلطی ایسی مرے لوگ خدارا نہ کریں",
      "",
      "بیٹھنا بزمِ عدو میں کبھی پڑ جائے اگر",
      "سرِ پندار سے دستار اتارا نہ کریں",
      "",
      "سیکھ سکتے نہیں لڑنا وہ کبھی موجوں سے",
      "ڈوبنے والے جو کشتی سے کنارہ نہ کریں",
      "",
      "ظرف چھن جائے نہ نظروں سے دروں بینی کا",
      "ذوقِ بینائی کو مصروفِ نظارہ نہ کریں",
      "",
      "بعض تصویروں میں سامانِ زیاں ہوتا ہے",
      "ہر کسی عکس کو نظروں سے گزارا نہ کریں",
      "",
      "حسنِ جذبات کا اعجاز ہی مر جاتا ہے",
      "حرفِ اظہارِ محبت کو سنوارا نہ کریں",
      "",
      "بات بھی کہہ نہ سکیں آپ سے اپنے دل کی",
      "احترام اتنا بھی اب آپ ہمارا نہ کریں",
      "",
      "طعنۂ سود و زیاں ملنے لگے ہیں ہم کو",
      "کیسے ممکن ہے کہ اب ذکر تمہارا نہ کریں",
      "",
      "جانے کب لوٹ کر آجائے کوئی اپنے گھر",
      "دل کی دیوار سے تصویر اتارا نہ کریں",
      "",
      "ہم بھی آوازِ بغاوت نہ اٹھائیں گے کبھی",
      "آپ بھی دستِ ستم گر سے اشارہ نہ کریں",
      "",
      "بات مت چھیڑیے آئینہ نمائی کی ظہیؔر",
      "عین ممکن ہے کہ خود آپ گوارا نہ کریں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "رکھ رہا ہوں میں زمینوں میں شجر کی امید",
      "مجھے سائے کی تمنا ، نہ ثمر کی امید",
      "",
      "جس طرف لے چلی وارفتگیِ شوق مجھے",
      "نقشِ پا بنتے گئے راہ گزر کی امید",
      "",
      "غمِ دنیا نے تو موقع دیا ہر بار نیا",
      "غمِ جاناں سے نہیں بارِ دگر کی امید",
      "",
      "یعنی ہے بیم و رجا کا یہ تماشائے دراز",
      "مختصر عرصۂ ہستی میں بشر کی امید!",
      "",
      "اور کیا کام دوانے کا ترے کوچے میں",
      "اک تلطف کی توقع ہے ، نظر کی امید",
      "",
      "ایک شب خون نیا قافلے والوں پہ پڑا",
      "جب کبھی بندھنے لگی رختِ سفر کی امید",
      "",
      "راہ خود رہبری کردے تو کرم ہے ورنہ",
      "کارواں چھوڑ چکا میرِ سفر کی امید",
      "",
      "درِ کعبہ سے ملے ہیں یہ تبرّک میں مجھے",
      "زیرِ لب حرفِ دعا ، دل میں اثر کی امید",
      "",
      "تیری دنیا میں مسافر ہوں ، خدایا مجھ کو",
      "وہ سفر دے جو بنے زادِ سفر کی امید",
      "",
      "کچھ دیئے ایسے جلے ہیں کفِ جادہ پہ ظہیؔر",
      "سینۂ شب میں جھلکتی ہے سحر کی امید",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "روح کے زخم دکھائے نہ دوا مانگی تھی",
      "میں نے کب دستِ مسیحا سے شفا مانگی تھی",
      "",
      "آرزو میں تری ڈھونڈی تھیں پناہیں غم نے",
      "درد نے عرصۂ الفت میں بقا مانگی تھی",
      "",
      "ایک زنجیر ترے نام کی چاہی تھی فقط",
      "میں نے زندانِ محبت کی سزا مانگی تھی",
      "",
      "میں نے خاموشیِ ویرانۂ جسم و جاں میں",
      "غنچۂ دل کے چٹکنے کی صدا مانگی تھی",
      "",
      "میں نے ہنگامۂ صد عیش و طرب کب چاہا",
      "دشتِتنہائی  میں الفت کی نوا مانگی تھی",
      "",
      "زندگی کے لیے مانگا تھا ترا دستِ دعا",
      "ہاتھ مانگا تھا نہ خوشبوئے حنا مانگی تھی",
      "",
      "جگنو مانگے تھے اندھیرے میں تری آنکھوں کے",
      "چاندنی مانگی نہ تاروں کی ضیا مانگی تھی",
      "",
      "عکس مانگا تھا ترا شیشۂ دل کی خاطر",
      "عارضِ احمر و تاباں کی حیا مانگی تھی",
      "",
      "تیرے ہونٹوں سے تبسم کی دھنک تھی درکار",
      "گیت مانگے تھے نہ سوغاتِ غِنا مانگی تھی",
      "",
      "تتلیاں مانگی تھیں مہکے ہوئے لفظوں کی فقط",
      "خوشبوئے صحنِ گلستاں نہ صبا مانگی تھی",
      "",
      "دھوپ مانگی تھی شرارت کی رخِ روشن سے",
      "سایۂ زلف نہ آنچل کی ہوا مانگی تھی",
      "",
      "رنگ مانگے تھے ترے شوخ تکلم کے ذرا",
      "عشوہ و ناز نہ خلوت کی ادا مانگی تھی",
      "",
      "خوشبو مانگی تھی ترے ہونے کی شہرِ جاں میں",
      "پھول مانگے تھے نہ کلیوں کی ردا مانگی تھی",
      "",
      "عکسِ جذبات نظر آئے ترا جس میں مجھے",
      "صورتِ دید بھی آئینہ نما مانگی تھی",
      "",
      "اذن مانگا تھا ترے اشک سکھانے کے لیے",
      "غم گساری کے لیے تیری رضا مانگی تھی",
      "",
      "سرحدِ حسن میں کب کوئی علاقہ مانگا",
      "دل کی جاگیر میں تھوڑی سی جگہ مانگی تھی",
      "",
      "ایک خاموش محبت کی تمنا تھی مجھے",
      "کب کوئی چیز ترے غم کے سوا مانگی تھی",
      "",
      "حرفِ تائیدِ محبت کی طلب تھی دل کو",
      "اجرتِ غم نہ وفاؤں کی جزا مانگی تھی",
      "",
      "نہ کوئی خواب دکھایا تھا نئی منزل کا",
      "نہ کوئی رہ ترے رستے سے جدا مانگی تھی",
      "",
      "آگہی چاہی تھی آلام و مسائل سے ترے",
      "بے خودی مانگی نہ مدہوش فضا مانگی تھی",
      "",
      "ایک بے نام سے احساسِ رفاقت کے لیے",
      "ایک نسبت بصد امید و رجا مانگی تھی",
      "",
      "زنگ آلود تھا آئینۂ ہستی کب سے",
      "پرتوِ رخ سے ترے میں نے جِلا مانگی تھی",
      "",
      "کب سے بے ربط تھا سازینۂ ایامِ حیات",
      "تجھ سے اک جنبشِ آہنگ فزا مانگی تھی",
      "",
      "دل کشا تجھ میں جو پنہاں ہے جہانِ اوصاف",
      "اُس کی آزادیِ تحدیث و ثنا مانگی تھی",
      "",
      "کب ترے سحر سے اس دل نے نکلنا چاہا",
      "کب رہائی ترے افسوں سے بھلا مانگی تھی",
      "",
      "کب کسی اور کو سونپا تھا یہ سرمایۂ حرف",
      "کب کوئی وجہِ سخن تیرے سوا مانگی تھی",
      "",
      "تجھ پر آئے نہ کسی غم کی کوئی آنچ کبھی",
      "یہ دعا تیرے لیے صبح و مسا مانگی تھی",
      "",
      "میں نے مایوسیِ فرقت میں بھی مانگی تھی امید",
      "زہر مانگا تھا نہ مرنے کی دعا مانگی تھی",
      "",
      "میں تو تقدیر کا لکھا ہوں ، خدا سے میں نے",
      "عشق مانگا تھا نہ یہ خوئے وفا مانگی تھی",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "عمر بھر میں نے محبت کی کمائی کے سوا",
      "نہ کیا کچھ بھی ترے در کی گدائی کے سوا",
      "",
      "جب کبھی دیدۂ احساس نے دیکھا ہے کہیں",
      "کچھ نہیں پایا تری جلوہ نمائی کے سوا",
      "",
      " اپنے کشکولِ محبت سے مجھے عار نہیں",
      "اس میں ممکن نہیں کچھ دل کی سمائی کے سوا",
      "",
      "سرِ قرطاس رواں ہو تو گرہ کھولے کوئی",
      "زیبِ خامہ نہیں کچھ عقدہ کشائی کے سوا",
      "",
      "چاہے جس طور چلے دشتِ تمنا میں کوئی",
      "حاصلِ کار نہیں آبلہ پائی کے سوا",
      "",
      "اور کیا کرتا میں رقاصۂ ہستی تجھے نذر",
      "پاس کچھ تھا ہی نہیں نغمہ سرائی کے سوا",
      "",
      "عشق الزام به لب اور مرے پاس ظہیؔر",
      "کچھ صفائی نہیں اس دل کی صفائی کے سوا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "واقعہ آپ نے پورا تو سنایا ہی نہیں",
      "سارے قصے میں مرا ذکر تو آیا ہی نہیں",
      "",
      "کس طرح مان لوں تصویر کی سچائی کو",
      "پسِ منظر جو چھپا ہے وہ دکھایا ہی نہیں",
      "",
      "بھر دیئے یوں تو مؤرخ نے ہزاروں دفتر",
      "جو حقیقت میں ہوا تھا وہ بتایا ہی نہیں",
      "",
      "تخمِ امید کہ بویا تھا جسے پُرکھوں نے",
      "خاکِ کم ظرف نے اب تک تو اگایا ہی نہیں",
      "",
      "مجھے شرمندۂ قرطاس و قلم رکھتا ہے",
      "ایک احساس جو لفظوں میں سمایا ہی نہیں",
      "",
      "وہ مکاں جس نے دیا سایۂ فیضانِ اماں",
      "رہنے والوں نے اسے اپنا بنایا ہی نہیں",
      "",
      "عکس ہوگا یہ کسی اور کا ، گھبرائیں نہ آپ",
      "آئنہ آپ کو میں نے تو دکھایا ہی نہیں",
      "",
      "آنکھ بھر آئے گی ظالم تری ، مت چھیڑ مجھے",
      "حالِ دل میں نے ابھی تک تو سنایا ہی نہیں",
      "",
      "راستے بھر کی تھکن کا جو ٹھکانہ بنتا",
      "سائباں ایسا کوئی راہ میں پایا ہی نہیں",
      "",
      " دل لگا کر سُنے سب پند و نصائح میں نے",
      "یہ الگ بات انہیں دل میں بٹھایا ہی نہیں",
      "",
      "رنگ بھرتا ہی رہا عمر کے خاکے میں ظہیؔر",
      "کوئی چہرہ تو ابھر کر کبھی آیا ہی نہیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "میں کہیں ، یاد کہیں ، خواب کہیں ہے میرا",
      "جو نظر آتا ہے میرا ، وہ نہیں ہے میرا",
      "",
      "مرے سر پر نہیں احسانِ کلاہ و دستار",
      "مری توقیر تو یہ نقشِ جبیں ہے میرا",
      "",
      "اُن کو یہ زعم کہ اُن کا ہے زمانہ سارا ",
      "مجھ کو یہ ناز کہ وہ عرش نشیں ہے میرا",
      "",
      "دستِ ظلمت جو بجھاتا ہے چراغوں کو مرے",
      "خود ہی جل جائے گا اک روز ، یقیں ہے میرا",
      "",
      "دل میں رکھی ہے امانت مرے دل کی  جس نے",
      "مجھے اک روز ملے گا کہ امیں ہے میرا",
      "",
      "جس جگہ خواب ہیں میرے وہی مٹی ہے مری",
      "یہ الگ بات کہ رزق اور کہیں ہے میرا",
      "",
      "میری تخلیق ہوئی تھی تو ہوا تھا مرے نام",
      "اک علاقہ جو ابھی زیرِ زمیں ہے میرا",
      "",
      "چلنا پھرنا نہ سہی دیس کی گلیوں میں ظہیرؔ",
      "مرنا جینا تو ابھی تک بھی وہیں ہے میرا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "وہ مجھ سے دور ہوا ہے نہ میرے پاس ہے وہ",
      "مری دعاؤں میں شامل ہے میری آس ہے وہ",
      "",
      "مری نگاہ سے دیکھو تو دیکھ پاؤ گے ",
      "خیال و خواب کا حصہ ہے ، مجھ سے خاص ہے وہ",
      "",
      "اسے جو دیکھ لے تو آئنہ سنورتا ہے",
      "جمالِ مہرِ منور کا انعکاس ہے وہ",
      "",
      "اُسے جو دیکھیں تو گل پیرہن بدلتے ہیں",
      "سراپا قوسِ قزح ہے ، شفق لباس ہے وہ",
      "",
      "اسے جو چھوئے خزاں تو بہار بن جائے ",
      "نمودِ حسنِ گلستان کی اساس ہے وہ",
      "",
      "ہر ایک حرفِ سخن ہم کلام ہے اُس سے",
      "غزل کے لہجۂ خوش رنگ کی مٹھاس ہے وہ",
      "",
      "غزل نہیں یہ قصیدہ ہے اُس کے ہونے کا",
      "سخن سپاس ہے اور باعثِ سپاس ہے وہ",
      "",
      "اُسی میں ڈھونڈتا رہتا ہوں اپنی سیرابی",
      "سراب ہے مرے رستے کا ، میری پیاس ہے وہ",
      "",
      "تمام رنگ مری ذات کے ہیں اُس میں ظہیر ؔ",
      "مرے فسانۂ ہستی کا اقتباس ہے وہ",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "جہاں پر آبِ رواں سے چٹان ملتی ہے",
      "وہیں سے موج کو اکثر اٹھان ملتی ہے",
      "",
      "جو قفلِ ذات کرے ضربِ عشق سے دو نیم",
      "اُسے کلیدِ زمان و مکان ملتی ہے",
      "",
      "کریں گمان تو جاتی ہے دولتِ ایمان",
      "رہے یقین تو پھر بے گمان ملتی ہے",
      "",
      "اُسی کا سر سرِ نیزہ پہ رکھا جا تا ہے",
      "مرے قبیلے میں جس کو کمان ملتی ہے",
      "",
      "فشارِ درد سے ہوتا ہے میرا خامہ رواں",
      "دہانِ زخم کو گویا زبان ملتی ہے",
      "",
      "زمانہ اب وہ کہاں زورِ بال و پر کا ظہیؔر",
      "ہوا سے دوستی ہو تو اڑان ملتی ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "بے غرض کرتے رہو کام محبت والے",
      "خود محبت کا ہیں انعام محبت والے",
      "",
      "لفظ پھولوں کی طرح چن کر اُسے دان کرو",
      "اُس پہ جچتے ہیں سبھی نام محبت والے",
      "",
      "شرمگیں نظریں ، تبسم یا چھلکتے آنسو",
      "بے صدا ہوتے ہیں پیغام محبت والے",
      "",
      "خود کو بیچا تو نہیں میں نے مگر سوچوں گا",
      "وہ لگائے تو سہی دام محبت والے",
      "",
      "دل کی اوطاق میں چوپال جمی رہتی ہے",
      "ملنے آتے ہیں سر ِ شام محبت والے",
      "",
      "غم کسی کا بھی ہو دیتے ہیں جگہ پہلو میں",
      "دل بڑا رکھتے ہیں ناکام محبت والے",
      "",
      "لوگ اندر سے یہ ہوتے ہیں بڑے عالی شان",
      "ویسے لگتے ہیں بہت عام محبت والے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اس قدر ڈر گئے کچھ شورشِ ایام سے لوگ",
      "اب تو بس گھر سے نکلتے ہیں کسی کام سے لوگ",
      "",
      "اک زمانہ تھا کہ خوش باش نظر آتے تھے",
      "ہر طرف جادۂ دیروز پہ خوش گام سے لوگ",
      "",
      "شاملِ قال تھا اک حرفِ تشکّر دن رات",
      "مشکلوں میں بھی گزر کرتے تھے آرام سے لوگ",
      "",
      "ہر طرف سکۂ اخلاص و وفا رائج تھا",
      "سب کو ملتے تھے برابر کئی انعام سے لوگ",
      "",
      "شاملِ حال بہر حال رہا کرتے تھے",
      "مل کے لڑتے تھے کبھی گردشِ ایام سے لوگ",
      "",
      "سچ کہا کرتے تھے خائف نہ تھے آئینوں سے",
      "کم ڈرا کرتے تھے اندیشۂ انجام سے لوگ",
      "",
      "اک تبسم پہ ہوا کرتے تھے سودے دل کے",
      "دستِ الفت پہ بِکا کرتے تھے بے دام سے لوگ",
      "",
      "آنکھ میں شرم تھی اور دل میں حیا ہوتی تھی",
      "خود نمائی سے بہت دور تھے زر فام سے لوگ",
      "",
      "ملنے والوں سے ترے ہم نے بھی مل کر دیکھا",
      "بس وہی عام سی باتیں ہیں وہی عام سے لوگ",
      "",
      "جانے کیوں تم کو عزیز اس قدر آخر ہیں ظہیؔر",
      "ٹوٹے پھوٹے سے ، یہ مجبور سے ، ناکام سے لوگ",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "جو بھی تصویر ہے وہ مدھم ہے",
      "یادِ ماضی شکستہ البم ہے",
      "",
      "اک ترا نقش ہے فقط جس پر",
      "گردِ وہم و گمان کم کم ہے",
      "",
      "یہ مرا زخم کیوں نہیں بھرتا",
      "تم تو کہتے تھے وقت مرہم ہے",
      "",
      "تو نہیں ہے تو کون ہے یہ شخص",
      "جو مری ذات میں مجسّم ہے",
      "",
      "تیری خوشبو نہیں تو کیا ہے پھر",
      "میرے انفاس میں جو مدغم ہے",
      "",
      "تمہیں مجھ سے گلہ نہیں ہے کوئی",
      "تو پھر آنکھوں میں کیسی شبنم ہے",
      "",
      "پردہ داری میں تلخیوں کی ظہیؔر",
      "لفظ کمخواب لہجہ ریشم ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "دیدہ وروں سے کور نگاہی ملی مجھے",
      "ایسے پڑھے ورق کہ سیاہی ملی مجھے",
      "",
      "کس دشت میں چلا ہوں کہ احساس مر گیا",
      "صورت دکھائی دی نہ صدا ہی ملی مجھے",
      "",
      "خالی پیالے سینکڑوں ہاتھوں میں ہر طرف",
      "تشنہ لبی اور ایک صراحی ملی مجھے",
      "",
      "ہمزاد میرا مرگیا میری انا کے ساتھ",
      "ورثے میں تخت ِ ذات کی شاہی ملی مجھے",
      "",
      "اپنی نظر میں خود مری توقیر بڑھ گئی",
      "جب سے تری نظر کی گواہی ملی مجھے",
      "",
      "دیوار ِ اختلاف سلامت ہے شہر میں",
      "دونوں طرف ہی ورنہ تباہی ملی مجھے",
      "",
      "چاروں طرف خزانے محبت کے ہیں ظہیؔر",
      "جو چیز میں نے پیار سے چاہی ، ملی مجھے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اٹھاؤں کیسے میں بارِ گرانِ سجدۂ شوق",
      "کہاں زمین ، کہاں آسمانِ سجدۂ شوق",
      "",
      "نبردِ عشقِ بلا کش کہاں ہوئی ہے تمام",
      "ابھی تو دور ہے سر سے امانِ سجدۂ شوق",
      "",
      "زمانے بھر کو مسلسل فرازِ نیزہ سے",
      "سنا رہا ہے کوئی داستانِ سجدۂ شوق",
      "",
      "حقیقت اس کی مری حسرتِ نیاز سے پوچھ",
      "زمانے بھر کو ہے جس پر گمانِ سجدۂ شوق",
      "",
      "وہ سنگِ در تو کجا ، اُس کی رہگزر دیکھو",
      "قدم قدم پہ سجے ہیں نشانِ سجدۂ شوق",
      "",
      "مزا تو تب ہے کہ کھوجائیں آستان و جبیں",
      "بس ایک تو رہے باقی میانِ سجدۂ شوق",
      "",
      "وہ روحِ بندگی جس کی تلاش میں ہے جبیں",
      "ہے ماورائے زمین و زمان ِ سجدۂ شوق",
      "",
      "خدائے منبر و محراب! یہ دعا ہے مری",
      "کہ لامکاں میں عطا ہو مکانِ سجدۂ شوق",
      "",
      "ظہیرؔ کیجے وضو آبِ انفعال سے آپ",
      "ہوئی ہے خلوتِ جاں میں اذانِ سجدۂ شوق",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "بے سبب ہم بھی تہ ِ دام نہ آئے ہونگے",
      "فرش نے عرش کے امکان دکھائے ہوں گے",
      "",
      "سر جھکاتے ہیں جو ہر سنگ پہ کہہ کر لبیک",
      "خوئے تسلیم تری بزم سے لائے ہوں گے",
      "",
      "جن کے سینے میں دھڑکتا ہو کسی اور کا دل",
      "لوگ ایسے بھی تو قدرت نے بنائے ہونگے",
      "",
      "اختلافاتِ نظر خود ہیں اُجالے کا ثبوت",
      "جس جگہ روشنی ہوگی وہیں سائے ہوں گے",
      "",
      "کیسے اک مشتِ عناصر میں دھڑکتی ہے حیات",
      "راز کیا کیا گِل ِ آدم میں سمائے ہوں گے",
      "",
      "لائی ہے بادِ سحر راکھ ، دھواں اور شبنم",
      "اُس نے پھر خط مجھے لکھ لکھ کے جلائے ہوںگے",
      "",
      "لوگ سن کر مرے اشعار اُسے جان گئے",
      "کیا خبر تھی مرے لفظوں میں کنائے ہوں گے",
      "",
      "دشتِ تعبیر میں ملتی نہیں منزل جو ہمیں",
      "چشم ِ رہبر میں کہیں خواب پرائے ہوںگے",
      "",
      "دیئے  میراث  کے  ٹوٹے  ہوئےمت  پھینک  ظہیؔر",
      "کچھ اندھیرے بھی ترے حصے میں آئے ہوںگے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "جانا ہے ایک روز حقیقت یہی تو ہے",
      "ماتھے پر آدمی کے عبارت یہی تو ہے",
      "",
      "سادہ رکھی ہے کاتبِ تقدیر نے کتاب",
      "لکھیں گے اپنے ہاتھ سے قسمت یہی تو ہے",
      "",
      "نکلے ہیں رنگ خاک سے جتنے بہار میں",
      "ملنے ہیں پھر سے خاک میں فطرت یہی تو ہے",
      "",
      "وہ ذاتِ لاشریک ہے پروردگارِ کُل",
      "ہر چیز پر لکھی ہے جو آیت یہی تو ہے",
      "",
      "ہاتھوں میں رکھیے ساعتِ موجود کی زمام",
      "کرنا ہے جو بھی کیجیے فرصت یہی تو ہے",
      "",
      "آنے نہ دیجے شیشۂ دل پر کوئی غبار",
      "کاشانۂ حیات کی زینت یہی تو ہے",
      "",
      "جن میں لہو پرائے ، اجالے بھی غیر کے",
      "روشن وہی چراغ ہیں ظلمت یہی تو ہے",
      "",
      "دنیا ہے اپنا آج بنانے کی فکر میں",
      "میں کل کا سوچتا ہوں مصیبت یہی تو ہے",
      "",
      "کیجے کرم کریم کی مخلوق پر ظہیؔر",
      "دیجے نہ دکھ کسی کو سخاوت یہی تو ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "یقینِ نور ہو دل میں تو شب گوارا ہے",
      "سحر نے رات کے اُس پار سے پکارا ہے",
      "",
      "نہ کھاؤ خوف طلسماتِ منظرِ شب سے",
      "فریبِ شعلۂ ظلمت ہے جو نظارہ ہے",
      "",
      "بندھا ہوا ہے نگاہوں سے مہرِ تاباں تک",
      "چلے چلو کہ یہ تارِ نظر سہارا ہے",
      "",
      "ابھی سے شکوۂ ایامِ رفتہ چہ معنی!",
      "ابھی تو رات ہماری ہے دن ہمارا ہے",
      "",
      "دھڑک بھی جائے تو چنگاریاں سی اٹھتی ہیں",
      "یہ دل نہیں مرے سینے میں سنگِ خارا ہے",
      "",
      "ہجومِ کارِ مسلسل نے کردیا تنہا",
      "مری کمائی منافع نہیں خسارہ ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "قتیلِ درد ہوا میں تو غمگسار آئے",
      "رہی نہ جان سلامت تو جاں نثار آئے",
      "",
      "تمہارا غم تھا میسر تو کوئی روگ نہ تھا",
      "چلا گیا وہ مسیحا تو غم ہزار آئے",
      "",
      "قبائے کذب و ریا اور کلاہِ نام و نمود",
      "کہیں اُترنے سے پہلے ہی ہم اتار آئے",
      "",
      "ہوئی نہ جرات ِ طوفِ حریم ِ عشق ہمیں",
      "بس ایک سنگِ ملامت انا کو مار آئے",
      "",
      "اک عرضِ شوق بصد حسرتِ دلِ ناکام",
      "حضورِ ناز میں پہنچے تو پھر گزار آئے",
      "",
      "متاعِ فکر و نظر ، ثروتِ خیال و خواب",
      "خزانے جتنے میسر تھے اُن پہ وار آئے",
      "",
      "ہزار اشکِ محبت بہم ہیں آنکھوں میں",
      "کہاں سے شیشۂ دل پر کوئی غبار آئے",
      "",
      "وصالِ یار حقیقت ہے گر تو ختم نہ ہو",
      "اگر یہ خواب ہے کوئی تو بار بار آئے",
      "",
      "ذرا سی دولتِ دل تھی ظہیؔر اُسکو بھی",
      "قمارخانۂ الفت میں جا کے ہار آئے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "عذابِ ہجرتِ پیہم سنبھلنے دے",
      "حصارِ بے مکانی سے نکلنے دے",
      "",
      "غبار ِ بے سروسامانی پردہ رکھ",
      "قبائے بے لباسی تو بدلنے دے",
      "",
      "ہوائے شہر ِ غربت اک ذرا دھیرے",
      "چراغ ِ شام ِ تنہائی کو جلنے دے",
      "",
      "دیار ِ اجنبی کے منجمد لہجے",
      "سکوتِ گوشۂ جاں میں پگھلنے دے",
      "",
      "فشارِ احتیاج ِ زندگی مجھ کو",
      "کبھی تو کنجِ غفلت میں بہلنے دے",
      "",
      "جنونِ رخصتِ تازہ مجھے اس بار",
      "جہاں کچھ بھی نہیں اس سمت چلنے دے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "غمِ فراق نہ رنج و محن کی بات کرو",
      "دیارِ غیر میں یارو وطن کی بات کرو",
      "",
      "حصارِ محبسِ دیوار و در تڑخ جائے",
      "فروغِ دامنِ کوہ و دمن کی بات کرو",
      "",
      "مہک مہک اٹھے ویرانیِ خس و خاشاک",
      "بہارِ سنبل و سرو و سمن کی بات کرو",
      "",
      "یہ سرد مہریِ موسم پگھل پگھل جائے",
      "جمالِ لالۂ شعلہ بدن کی بات کرو",
      "",
      "نہ کور چشمِ تماشہ ، نہ دستِ اہلِ ستم",
      "گلوئے نعرۂ مستانہ زن کی بات کرو",
      "",
      "فسانے شمعِ شبستاں کے مت سناؤ مجھے",
      "چراغِ جادۂ ظلمت شکن کی بات کرو",
      "",
      "کوئی تو حرفِ ملامت خلافِ جور و ستم",
      "کبھی تو شورشِ اہلِ فتن کی بات کرو",
      "",
      "مثالِ نیزہ اتر جائے سینۂ شب میں",
      "ہر ایک بات میں ایسی کرن کی بات کرو",
      "",
      "یہ کیا کہ تم بھی نصیحت کرو شعار ظہیؔر",
      "دوانے ہو کوئی دیوانے پن کی بات کرو",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "سادگی ہوئی رخصت ، زندگی کہاں جائے",
      "زندگی کی خاطر اب آدمی کہاں جائے",
      "",
      "جرم ہے دیا رکھنا شب پرست گلیوں میں",
      "اس قدر اندھیرا ہے ، روشنی کہاں جائے",
      "",
      "ہر طرف مکان اونچے چیختی صداؤں کے",
      "آسمان تکنے کو خامشی کہاں جائے",
      "",
      "آنگنوں میں پہرے ہیں رات بھر اجا لوں کے",
      "دشت میں نہ جائے تو چاندنی کہاں جائے",
      "",
      "سُر تو ساتھ ہولے گا گیت سننے والوں کے",
      "سُر جگا کے چپ ہے جو بانسری کہاں جائے",
      "",
      "ریت کے سمندر سے آگئے ہیں برفوں تک",
      "آبِ گم نہیں ملتا تشنگی کہاں جائے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "زندگی کے رنگوں سے بام و در سجانے میں",
      "ایک عمر لگتی ہے گھر کو گھر بنانے میں",
      "",
      "بام و در کو حیثیت آدمی سے ملتی ہے",
      "خالی گھر نہیں ہوتے معتبر زمانے میں",
      "",
      "نفرتوں کے بدلے میں ہم کسی کو کیا دیں گے",
      "خرچ ہوگئے ہم تو چاہتیں کمانے میں",
      "",
      "پھول کھل اٹھے دل میں ، شبنمی ہوئیں آنکھیں",
      "ذکر آگیا کس کا ہجر کے فسانے میں",
      "",
      "شخصیت پرستی کے پیڑ پی گئے سب کچھ",
      "ہوگئی زمیں بنجر کچھ درخت اگانے میں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "قریۂ سیم و زر و نام و نسب یاد آیا",
      "پھر مجھے ترکِ تعلق کا سبب یاد آیا",
      "",
      "ہجر میں بھول گئے یہ بھی کہ بچھڑے تھے کبھی",
      "دور وہ دل سے ہوا کب ، ہمیں کب یاد آیا",
      "",
      "کارِ بیکار جسے یاد کہا جاتا ہے",
      "بات بے بات یہی کارِ عجب یاد آیا",
      "۔ق۔",
      "پارۂ ابر ہٹا سینۂ مہتاب سے جب",
      "عشوۂ ناز سرِ خلوتِ شب یاد آیا",
      "",
      "عارضِ شب ہوئے گلنار ، صبا شرمائی",
      "جب ترا غمزۂ غمازِ طلب یاد آیا",
      "",
      "پھر مری توبۂ لرزاں پہ قیامت گزری",
      "پھر مجھے رقصِ شبِ بنتِ عنب یاد آیا",
      "",
      "یاد آئے ترے کم ظرف بہکنے والے",
      "جامِ کم کیف بصد شور و شغب یاد آیا",
      "",
      "چاندنی ، جھیل ، ہوا ، زلفِ پریشاں ، بادل",
      "دل و جاں ہم نے کہاں کھوئے تھے اب یاد آیا",
      "",
      "کیا لکھے کوئی بجز نوحۂ قرطاس کہ حیف",
      "بے ادب خامۂ ارزاں کو ادب یاد آیا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "موجِ شرابِ عشق پہ ڈولے ہوئے سخن",
      "اک عالمِ نشاط میں بولے ہوئے سخن",
      "",
      "جیسے اتر رہے ہوں دلِ تشنہ کام پر",
      "تسنیم و زنجبیل میں گھولے ہوئے سخن",
      "",
      "جیسے پروئیں تارِ شنیدن میں درِّ ناب",
      "لب ہائے لعل گوں سے وہ رولے ہوئے سخن",
      "",
      "آؤ سناؤں محفلِ شیریں سخن کی بات",
      "برہم ہوئے مزاج تو شعلے ہوئے سخن",
      "",
      "ہوتے نہیں ظہیؔر کبھی ترجمانِ دل",
      "میزانِ احتیاط میں تولے ہوئے سخن",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "لوگ کیا کیا گفتگو کے درمیاں کھلنے لگے",
      "ذکر ِ یاراں چل پڑا تو رازداں کھلنے لگے",
      "",
      "پھر پڑاؤ ڈل گئے یادوں کے شامِ ہجر میں",
      "اور فصیلِ شہرِ جاں پر کارواں کھلنے لگے",
      "",
      "تنگ شہروں میں کھلے ساگر کی باتیں کیا چلیں",
      "بادِ ہجرت چل پڑی اور بادباں کھلنے لگے",
      "",
      "جب سے دل کا آئنہ شفاف رکھنا آگیا",
      "میری آنکھوں پر کئی عکسِ نہاں کھلنے لگے",
      "",
      "دل کی شریانوں میں تازہ غم اک ایسے جم گیا",
      "سب پرانے زخم ہائے بے نشاں کھلنے لگے",
      "",
      "تیرے غم کا مہر بستہ گوشوارہ کیا کھلا",
      "عمر بھر کے دفتر ِ سود و زیاں کھلنے لگے",
      "",
      "مدتوں سےہم نشیں تھے ہم نشاط و ہم طرب",
      "مبتلائے غم ہوا تو مہرباں کھلنے لگے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "منظر سے ہٹ گیا ہوں میں ، ایسا نہیں ابھی",
      "ٹوٹا تو ہوں ضرور ، پہ بکھرا نہیں ابھی",
      "",
      "وہ بھی اسیرِ فتنۂ جلوہ نمائی ہے",
      "میں بھی حصارِ ذات سے نکلا نہیں ابھی",
      "",
      "آسودۂ خمار نہیں ، مضمحل ہے آنکھ",
      "جو خواب دیکھنا تھا وہ دیکھا نہیں ابھی",
      "",
      "داغ ِ فراقِ یار کے پہلو میں یاس کا",
      "اک زخم اور بھی ہے جو مہکا نہیں ابھی",
      "",
      "نومیدیِ قرارکے ماتھے پہ درد کا",
      "اک نقش اور بھی ہے جو نکھرا نہیں ابھی",
      "",
      "مل تو گیا ہے شوق کو رازِ دوامِ عشق",
      "لیکن طلب کی راہ پر آیا نہیں ابھی",
      "",
      "سود و زیانِ کارِ وفا یاد ہے مجھے",
      "لیکن ترے حساب میں لکھا نہیں ابھی",
      "",
      "کچھ دن ابھی رہیں گے یہ ملنے کے سلسلے",
      "جانا تمہارے شہر سے ٹھہرا نہیں ابھی",
      "",
      "سہتے رہو ظہیؔر ابھی تہمتِ حیات",
      "مقتل مقام ِ زیست سے اونچا نہیں ابھی",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "وہ ایک شخص کہ سب جا چکے تو یاد آیا",
      "کسی کو آئے نہ آئے مجھے تو یاد آیا",
      "",
      "مقابلے پر اندھیرا نہیں ہوا بھی ہے",
      "کئی چراغ یکایک بجھے تو یاد آیا",
      "",
      "ہمارے ساتھ بھی موسم نے داؤ کھیلا تھا",
      "خزاں کے ہاتھ سے پتے گرے تو یاد آیا",
      "",
      "گئی رتوں کے پرندے ابھی نہیں لوٹے",
      "شجر پہ تازہ شگوفے کھلے تو یاد آیا",
      "",
      "کسی کی ٹوٹی ہوئی چوڑیوں کا قرض مجھے",
      "گلاب شاخ سے کانٹے چبھے تو یاد آیا",
      "",
      "بہت زمانے سے کاغذ پہ دل نہیں رکھا",
      "پرانے بیگ سے کچھ خط ملے تو یاد آیا",
      "",
      "وہ ایک رسم تھی بڑھ کر گلے لگانے کی",
      "تمام ہوچکے شکوے گلے تو یاد آیا",
      "",
      "قدم قدم پہ وہ گزرا ہوا زمانہ ظہیؔر",
      "کسی کو آئے نہ آئے مجھے تو یاد آیا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اب تری یاد میں غم بھی ہوئے شامل میرے",
      "مل گئے میرے مسیحا سے یہ قاتل میرے",
      "",
      "دن نکلتے ہی چلے آئے مقابل میرے",
      "یہ مری جاں کے طلبگار ، مسائل میرے",
      "",
      "بے اماں کر گئی مجھ کو تو جزیروں کی تلاش",
      "اب سمندر ہی رہا میرا نہ ساحل میرے",
      "",
      "یہ سبب کم تو نہ تھا ترکِ تمنا کے لئے",
      "تیری امید سے کم کم تھے وسائل میرے",
      "",
      "مشکلیں جب سے بنیں سہل پسندی کا جواز",
      "کام ہوتے گئے کچھ اور بھی مشکل میرے",
      "",
      "کیا کہوں دوستو میں اپنی وکالت میں اب اور",
      "یہ مرے زخمِ مروّت ہیں دلائل میرے",
      "",
      "اک طرف میں ہوں ، مری راہ گزر ، میری تھکن",
      "اک طرف خواب نا آسودۂ منزل میرے",
      "",
      "مرے عادل نے مجھے جو بھی دیا ٹھیک دیا",
      "اور کچھ تھا بھی نہیں دہر میں قابل میرے",
      "",
      "کیسے آئے مری تمثیل میں سچائی ظہیؔر",
      "سبھی کردار ہیں پروردۂ باطل میرے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "تارہ تارہ بکھر رہی ہے رات",
      "دھیرے دھیرے سے مر رہی ہے رات",
      "",
      "ہاتھ میں کاسۂ فراق لئے",
      "سر جھکائے گزر رہی ہے رات",
      "",
      "کتنی تنہا فضا ہے گلیوں کی",
      "سرد آہیں سی بھر رہی ہے رات",
      "",
      "میری آوارگی کے پہلو میں",
      "کوبکو در بدر رہی ہے رات",
      "",
      "اک دریچے سے راہ تکتی ہے",
      "سہمی سہمی ہے ، ڈر رہی ہے رات",
      "",
      "آئنہ رو ہے منتظر کب سے",
      "بال کھولے سنور رہی ہے رات",
      "",
      "نیم روشن سی خوابگاہوں میں",
      "بے لبادہ بکھر رہی ہے رات",
      "",
      "برگِ عارض پہ صورتِ شبنم",
      "قطرہ قطرہ اُتر رہی ے رات",
      "",
      "پھر تجھے بھولنے کی کوشش میں",
      "جانے کیا یاد کر رہی ے رات",
      "",
      "(فلاڈیلفیا کی ایک خنک رات)",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "میں بھی کسی کے درد کا درمان بن گیا",
      "ادنیٰ سا آدمی تھا میں انسان بن گیا",
      "",
      "اپنی حدیں ملی ہیں تو ادراکِ حق ہوا",
      "عرفانِ ذات باعثِ ایمان بن گیا",
      "",
      "ہمسر تھا جبرئیل کا جب تک تھا سجدہ ریز",
      "جیسے ہی سر اٹھایا تو شیطان بن گیا",
      "",
      "خیراتِ عشق کیا پڑی کشکولِ ذات میں",
      "اتنے کھلے گلاب کہ گلدان بن گیا",
      "",
      "کچھ بھی نہیں تھا کہنے کو شہر ِوصال میں",
      "ہجرت ملی غزل کو تو دیوان بن گیا",
      "",
      "پہچانئے مجھے میں وہی ہوں ظہیؔر جو",
      "خود کو مٹا کر آپ کی پہچان بن گیا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اب کوئی دل میں ترے بعد نہیں آئے گا",
      "سنگِ ارزاں تہِ بنیاد نہیں آئے گا",
      "",
      "دن نکلتے ہی بھلادوں گا میں اندیشۂ روز",
      "سرحدِ صبح میں شب زاد نہیں آئے گا",
      "",
      "ایسے اک طاقِ تمنا پہ رکھ آیا ہوں چراغ",
      "بجھ گیا بھی تو مجھے یاد نہیں آئے گا",
      "",
      "حسنِ خود دار کو اِس دورِ خود آرا میں بہم",
      "ہنر ِ مانی و بہزاد نہیں آئے گا",
      "",
      "طوقِ زرناب ہوئے زیبِ گلوئے گفتار",
      "اب کہیں سے سخن آزاد نہیں آئے گا",
      "",
      "فرقِ زندان و گلستان بھی ہاں دیکھ لیا",
      "لب پر اب شکوۂ صیاد نہیں آئے گا",
      "",
      "کھوج کس کی ہے تمہیں راہ نوردانِ فراق",
      "اب کوئی قریۂ آباد نہیں آئے گا",
      "",
      "عشرتِ سایۂ دیوار کی چالوں میں دگر",
      "پائے درماندۂ افتاد نہیں آئے گا",
      "",
      "اب کسی شعبدہ گر دامِ عنایت میں ظہیؔر",
      "یہ دلِ خوگرِ بیداد نہیں آئے گا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "نہ رہے کوئی بھی دل میں تو بسا کرتا ہے",
      "وہ اکیلا ہے اکیلا ہی رہا کرتا ہے",
      "",
      "دل جو بجھتا ہے تو ہوتی ہے فروزاں کوئی یاد",
      "اک دیا مجھ میں بہرحال جلا کرتا ہے",
      "",
      "غم رسیدہ ہوں ، اسیرِ غم و آلام نہیں",
      "کوئی وعدہ مجھے دلشاد رکھا کرتا ہے",
      "",
      "جب کوئی قافلہ منزل کے نشاں کھو بیٹھے",
      "رہنما پھر اسے رہزن سا ملا کرتا ہے",
      "",
      "اے خدا معجزہ یونس کا دکھا دے پھر سے",
      "اک خطا کار اندھیروں میں دعا کرتا ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ناخداؤں کے کھُلے کیسے بھرم پانی میں",
      "کیا سفینے تھے کئے غرق جو کم پانی میں",
      "",
      "شہر کا شہر ہوا گریہ کناں مثلِ سحاب",
      "کون دیکھے گا کوئی دیدۂ نم پانی میں",
      "",
      "ڈر نہیں سیلِ زمانہ سے کہ ہم سوختہ جاں",
      "سنگِ جاوا ہیں ، نہیں ڈوبتے ہم پانی میں",
      "",
      "چھین لے مجھ سے مری خشکیِ دامن کا غرور",
      "جوشِ گریہ! ابھی اتنا نہیں دم پانی میں",
      "",
      "اشک ہے سوزِ دروں ، اشک غبارِ خاطر!",
      "آتش و خاک بالآخر ہوئے ضم پانی میں",
      "",
      "یونہی بھر آئے کبھی آنکھ تو ہوتی ہے غزل",
      "آہوئے حرفِ سخن کرتا ہے رم پانی میں",
      "",
      "قطرۂ اشک ہو یا جرعۂ صہبا ہو ظہیؔر",
      "ہم ڈبوتے نہیں اپنا کوئی غم پانی میں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "میں روز اپنے لئے ضابطے بناتا ہوں",
      "پھر اُن کو توڑتا ہوں اور نئے بناتا ہوں",
      "",
      "پہنچ بھی جاؤں کہیں میں تو گھر نہیں کرتا",
      "نئے سفر کیلئے راستے بناتا ہوں",
      "",
      "مقیمِ دل ہوں میں، امید نام ہے میرا",
      "میں خواب بُنتا ہوں اور واقعے بناتا ہوں",
      "",
      "میں ٹکڑے جوڑ کے ٹوٹے ہوئے چراغوں کے",
      "ہوا کے سامنے بیٹھا دیئے بناتا ہوں",
      "",
      "بس ایک سنگِ ندامت ہے اب مری توفیق",
      "میں پانی تکتا ہوں اور دائرے بناتا ہوں",
      "",
      "نہ سنگِ میل، نہ منزل، نہ رہنما، میں تو",
      "ستارے دیکھتا ہوں، زائچے بناتا ہوں",
      "",
      "مجھے خبر ہے کہ جانا مجھے اکیلا ہے",
      "تو پھر یہ قافلہ کس کے لئے بناتا ہوں؟",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اب کوئی ہم نشیں نہ ہمدم ہے",
      "روز و شب کی بساط برہم ہے",
      "",
      "لوگ ملتے ہیں راہ لگتے ہیں",
      "زندگی راستوں کا سنگم ہے",
      "",
      "نخلِ خواہش کی ہر کہانی میں",
      "بنتِ حوا ہے، ابنِ آدم ہے",
      "",
      "کیمرا بن گیا ہے آئینہ",
      "آئنوں کا مزاج برہم ہے",
      "",
      "رہنما سر فراز ہیں اپنے",
      "سرنگوں ہے تو سبز پرچم ہے",
      "",
      "میں وہ پیاسا ہوں جس کی سیرابی",
      "سنگِ اسود ہے آبِ زمزم ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "میں ہوں چہرہ تری خواہش کا، مرے بعد تو دیکھ",
      "آئنہ دیکھ تو دانش کا، مرے بعد تو دیکھ",
      "",
      "مجھ پہ ناکامی کے عنوان ابھی سے نہ لگا",
      "تُو نتیجہ مری کاوش کا، مرے بعد تو دیکھ",
      "",
      "تُو مرے ہاتھ میں بجھتی ہوئی مشعل پہ نہ جا",
      "دُور تک سلسلہ تابش کا، مرے بعد تو دیکھ",
      "",
      "پیاسی مٹی مجھے پی جائے گی مانا، لیکن",
      "پہلا قطرہ ہوں میں بارش کا، مرے بعد تو دیکھ",
      "",
      "مجھ سے کہتا ہے گزرتا ہوا ہر دن یہ ظہیؔر",
      "چھوڑ دامن مری خواہش کا، مرے بعد تو دیکھ",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "نہ فکرِ سود و زیاں ہے نہ غم تمہارا ہے",
      "یہ وقت نے مجھے کس راہ سے گزارا ہے",
      "",
      "نگارخانۂ ہستی کے کینوس تھے سفید",
      "تمہارے درد کی تصویر سے نکھارا ہے",
      "",
      "وہ ایک نقشِ فسوں گر جسے وفا کہئے",
      "بصد ہزار سلیقہ اُسے سنوارا ہے",
      "",
      "رکھا ہوا ہے جو سینے پر ایک سنگِ گراں",
      "کسی کی پلکوں سے ٹوٹا ہوا ستارہ ہے",
      "",
      "غزل میں حدِ ادب ہے بیانِ راز و نیاز",
      "یہاں شگفتنِ غنچہ بھی استعارہ ہے",
      "",
      "امان عزیز ہے میری طرح سے اُس کو بھی",
      "ہمارے بیچ میں دریا نہیں کنارہ ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "سنگ آئے یا کوئی پھول، اٹھا کر رکھیے",
      "جو ملے نام پر اُس کے وہ سجا کر رکھیے",
      "",
      "سجدۂ عجز سے بڑھ کر نہیں معراج کوئی",
      "سربلندی ہے یہی سر کو جھکا کر رکھیے",
      "",
      "دل پہ اُترا ہوا اک حرفِ محبت نہ مٹے",
      "اسمِ اعظم ہے یہ تعویذ بنا کر رکھیے",
      "",
      "گر کے خاشاک ہوا جس میں انا کا شیشم",
      "ہے وہی خاکِ شفا اُس کو اٹھا کر رکھیے",
      "",
      "ہم یوں کھلتے نہیں دوچار ملاقاتوں میں",
      "ایک دو روز ہمیں پاس بلا کر رکھیے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "دونوں سرے ہی کھوگئے، بس یہ سرا ملا",
      "اپنی خبر ملی ہے نہ اُس کا پتہ ملا",
      "",
      "رو رو کے مٹ گیا ہوں تو مجھ پرنظر ہوئی",
      "بینائی کھو گئی تو مجھے آئنہ ملا",
      "",
      "اُس کو کمالِ ضبط ملا، مجھ کو دشتِ ہجر",
      "لیکن سوال یہ ہے کہ دنیا کو کیا ملا",
      "",
      "آنے لگے نظر غم و آلامِ دو جہاں",
      "بالغ نظر ہوئے تو اِن آنکھوں کو کیا ملا",
      "",
      "گم دشتِ شوق میں جو ہوئے، پا گئے مراد",
      "منزل نہ پا سکے وہ جنہیں رہنما ملا",
      "",
      "مخلوق ہوں میں اُس کی مرا ہاتھ تھام لیں",
      "دیکھیں مجھے بھی کاش وہ جن کو خدا ملا",
      "",
      "دیکھا نکل کے خود سے تو منظر کھلا ظہیرؔ",
      "ہمت بڑھی ہے میری، مجھے حوصلہ ملا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "دوائیں رکھتے ہوئے، نشتروں کے ہوتے ہوئے",
      "مرض تو بڑھ گئے چارہ گروں کے ہوتے ہوئے",
      "",
      "حریفِ جاں! یہ روایت نہیں ہماری کہ ہم",
      "عمامے پیروں میں رکھ دیں سروں کے ہوتے ہوئے",
      "",
      "ثبوت اور میں کیا دوں تجھے اسیری کا",
      "اُڑانیں دیکھ تو میری پروں کے ہوتے ہوئے",
      "",
      "ہر آدمی ہے تلاشِ اماں میں سرگرداں",
      "تمام شہر ہے بے گھر گھروں کے ہوتے ہوئے",
      "",
      "یہ سوچنے کی نہیں فیصلے کی ساعت ہے",
      "گزر نہ جائے کہیں مشوروں کے ہوتے ہوئے",
      "",
      "یہ فاصلے تو بڑھے جارہے ہیں روز بروز",
      "ہمارے ہاتھوں میں نامہ بروں کے ہوتے ہوئے",
      "",
      "تم اُن کی گرد میں منزل کو ڈھونڈتے ہو ظہیؔر",
      "جو کارواں ہوئے گم رہبروں کے ہوتے ہوئے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "جنگ اندھیرے سے بادِ برہم تک",
      "ہے چراغوں کی آخری دم تک",
      "",
      "آدمی پر نجانے کیا گزری",
      "ابنِ آدم سے ابنِ درہم تک",
      "",
      "تم مسیحا کی بات کرتے ہو؟",
      "یہاں خالص نہیں ہے مرہم تک!",
      "",
      "معجزہ دیکھئے توکّل کا!",
      "ریگِ صحرا سے آبِ زمزم تک",
      "",
      "داستاں ہے شگفتنِ دل کی",
      "خندۂ گل سے اشکِ شبنم تک",
      "",
      "اک سفر ہے کہ طے نہیں ہوتا",
      "سرخ ہجرت سے سبز پرچم تک",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اے یار سنبھلنا کہ بہت تیز ہوا ہے",
      "دل تھام کے چلنا کہ بہت تیز ہوا ہے",
      "",
      "تم شعلۂ الفت کو نمائش سے بچانا",
      "چپ چاپ ہی جلنا کہ بہت تیز ہوا ہے",
      "",
      "رکھتے ہو سرِ عام گر اوراقِ فسانہ",
      "پھر ہاتھ نہ ملنا کہ بہت تیز ہوا ہے",
      "",
      "دستار بچانے میں اتر جائے نہ پوشاک",
      "ہر گام سنبھلنا کہ بہت تیز ہوا ہے",
      "",
      "روشن جو دیئے طاقِ تمنا پہ کیے ہیں",
      "مت اُن سے بہلنا کہ بہت تیز ہوا ہے",
      "",
      "جس سمت بریدہ نظر آتی ہوں ردائیں",
      "وہ سمت بدلنا کہ بہت تیز ہوا ہے",
      "",
      "یہ رنگ خزاؤں کے وفائیں نہیں کرتے",
      "ان پر نہ مچلنا کہ بہت تیز ہوا ہے",
      "",
      "پتوں کی طرح تم بھی بکھر جاؤ گے یارو",
      "گھر سے نہ نکلنا کہ بہت تیز ہوا ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "راہبر دیکھ لئے ، راہ گزر دیکھ آئے",
      "بیچ رستے سے ہم انجامِ سفر دیکھ آئے",
      "",
      "عارضے اتنے نہیں جتنے مسیحا ہیں نصیب",
      "غمگسار اپنی دعاؤں کا اثر دیکھ آئے",
      "",
      "دیکھنے جس کو گئے تھے وہی بستی نہ ملی",
      "یاد کے اجڑےہوئے چند کھنڈر دیکھ آئے",
      "",
      "نہ وہ منظر رہے باقی ، نہ وہ آنکھیں ہی رہیں",
      "شہر ِ رفتہ کو بہ اندازِ دگر دیکھ آئے",
      "",
      "اُس گلی میں بھی ہوا جانا جدھر جنت تھی",
      "ہم سے دیکھا ہی نہ جاتا تھا مگر دیکھ آئے",
      "",
      "ڈگمگائے تھے جہاں ہوش کے مدہوش قدم",
      "ہجر پہلو میں لئے پھروہ ڈگر دیکھ آئے",
      "",
      "محفلِ غیر بھی اُجڑی ہوئی دیکھی اِس بار",
      "بزمِ یاراں کو بھی ہم زیر و زبر دیکھ آئے",
      "",
      "رشکِ افلاک ہیں وہ لوگ کہ جب دل چاہا",
      "تری دہلیز پہ پہنچے ، ترا در دیکھ آئے",
      "",
      "ہم کھڑے تکتے ہیں قسمت کے ستاروں کو ظہیرؔ",
      "دیکھنے والے تو مریخ و قمر دیکھ آئے",
      "",
      "(پاکستان سے واپسی پر)",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "سخن رہے گا ، سخنور بھی کم نہیں ہونگے",
      "یہ اور بات ہے کاغذ قلم نہیں ہونگے",
      "",
      "ملے گا شورِ ستائش تو شعر خوانوں کو",
      "سخن شناس کنائے بہم نہیں ہونگے",
      "",
      "جو چل بھی جائے نظر پر طلسمِ نقش و نگار",
      "حروفِ خام تو دل پر رقم نہیں ہونگے",
      "",
      "مذاقِ شعر بدل دے گا جب مزاجِ ہنر",
      "خدا کا شکر ہے اُس وقت ہم نہیں ہونگے",
      "",
      "ہمارے درد الگ ہیں ، ہمارا لہجہ الگ",
      "کبھی بھی شورِ زمانہ میں ضم نہیں ہونگے",
      "",
      "ہمارے سینے میں ٹوٹی ہے آکے تیغِ ستم",
      "ہمارے بعد کسی پر ستم نہیں ہونگے",
      "",
      "جنہیں شناخت ہماری ہی دشمنی سے ملی",
      "رہیں گے وہ بھی نہ باقی جو ہم نہیں ہونگے",
      "",
      "تمہارا ہجر سلامت ، تمہارے غم آباد!",
      "کبھی اکیلے خدا کی قسم نہیں ہونگے",
      "",
      "یہ سوچ کر میں غموں میں بھی شاد رہتا ہوں",
      "وہ دن بھی آئیں گے رنج و الم نہیں ہونگے",
      "",
      "عجیب راہ چلا ہوں دیارِ غربت میں",
      "گزر گیا بھی تو نقشِ قدم نہیں ہونگے",
      "",
      "ملا ہے کاسۂ خوددار اُس کے در سے ظہیؔر",
      "تمام عمر تہی دست ہم نہیں ہونگے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "سکوتِ کنجِ چمن میں چمن کی بات کرو",
      "جہاں کے ہیں ہم اُسی انجمن کی بات کرو",
      "",
      "بساطِ ہست ہماری بسیطِ خاک پہ ہے",
      "اِسی کے رنگ میں ہر فکر و فن کی بات کرو",
      "",
      "ملے جو شکوۂ بادِ خزاں سے کچھ فرصت",
      "تو آبیاریِ خاکِ چمن کی بات کرو",
      "",
      "فلک سے فرشِ تپاں کی شکایتیں کیسی",
      "ردائے پرچمِ سایہ فگن کی بات کرو",
      "",
      "زوالِ نعمتِ دنیا نہ ہوگا دامن گیر",
      "عطائے بارگہِ ذوالمنن کی بات کرو",
      "",
      "ہزار عقدۂ باہم اِسی سے وا ہوں گے",
      "ظہیؔر اپنے زمین و زمن کی بات کرو",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اہلِ دل چشمِ گہرِ بار سے پہچانے گئے",
      "دیدہ ور تیرے ہی دیدار سے پہچانے گئے",
      "",
      "ہم نے کب دعویٰ زمانے میں کیا الفت کا",
      "ہم تو چپ تھے ، ترے انکار سے پہچانے گئے",
      "",
      "خود کو آزاد سمجھتے تھے مگر وقتِ سفر",
      "ایک زنجیر کی جھنکار سے پہچانے گئے",
      "",
      "معرکے جو بھی سمندر سے ہوئے ساحل تک",
      "میری ٹوٹی ہوئی پتوار سے پہچانے گئے",
      "",
      "دشمنی میں نے اصولوں کی بنا پر رکھی",
      "میرے دشمن میرے کردار سے پہچانے گئے",
      "",
      "آگیا دست ِصحافت میں عدالت کا قلم",
      "جھوٹ اور سچ بھی اب اخبار سے پہچانے گئے",
      "",
      "آج کے دورِ ضرورت میں مشینوں کی طرح",
      "آدمی کام کی رفتار سے پہچانے گئے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "زہر کی ہے یہ لہو میں کہ دوا کی تیزی",
      "دل کی رفتار میں آئی ہے بلا کی تیزی",
      "",
      "اُس کے چھونے سے مرے زخم ہوئے رشکِ گلاب",
      "بس گئی خون میں اُس رنگِ حنا کی تیزی",
      "",
      "بھاوٴ بڑھتے ہی گئے عشقِ طلب گار کے اور",
      "راس آئی اسے بازارِ وفا کی تیزی",
      "",
      "پھر کسی رخصتِ تازہ کی خبر دیتی ہے",
      "سرد موسم کے تناظر میں ہوا کی تیزی",
      "",
      "صرف ہونٹوں سے جو نکلے تو صدا ہے رسمی",
      "دل سے نکلے تو ہے برّاق دعا کی تیزی",
      "",
      "شہر عادی ہے یہ سرگوشیاں سننے کا ظہیؔر",
      "کہیں بھونچال نہ بن جائے صدا کی تیزی",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "دل تو ناحق ہی زمانے سے ڈرا کرتا ہے",
      "فیصلے ساری خدائی کے خدا کرتا ہے",
      "",
      "ایک تو ہوتا ہے دستورِ زمانہ مرے دوست!",
      "اک شعار اہلِ محبت کا ہوا کرتا ہے",
      "",
      "مجھے خود میں نظر آتا ہے کوئی دوسرا شخص",
      "آئنہ آنکھ میں آشوب بپا کرتا ہے",
      "",
      "یاد آتا ہے وہی شخص ہمیں کیوں اکثر",
      "وہ جو کچھ دیر کو رستے میں ملا کرتا ہے",
      "",
      "کیا بتاؤں تمہیں اس حرفِ شکایت کی مٹھاس",
      "جب گلے ملتے ہوئے کوئی گلہ کرتا ہے",
      "",
      "اجڑی تہذیب کی گلیوں سے نکلتا ہی نہیں",
      "دل دوانہ ہے خرابوں میں رہا کرتا ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "عبیر و عنبر و مشکِ ختن کی بات کرو",
      "ہر استعارے میں اُس گلبدن کی بات کرو",
      "",
      "سحر شگفتنِ غنچہ کے انتظار میں ہے",
      "صبا سے پھر کسی غنچہ دہن کی بات کرو",
      "",
      "ہیں سنگ ریزے رہِ یار کے سپاس طلب",
      "عقیقِ طوسی و لعلِ یمن کی بات کرو",
      "",
      "دریدہ جامۂ حرفِ ہنر ہے شکوہ کناں",
      "سخنورو! کسی خوش پیرہن کی بات کرو",
      "",
      "بڑھے گی اور بھی شیرینیِ مقال ذرا",
      "بجائے وہم و گماں حسنِ ظن کی بات کرو",
      "",
      "وہ جس کے دم سے تھی رنگینیِ بہارِ سخن",
      "ظہیؔر تم اُسی طرزِ کہن کی بات کرو",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "طوفان میں جزیرہ ملا ہے ، زمیں ملی",
      "پانی کی قید سے تو رہائی نہیں ملی",
      "",
      "ابر ِ رواں کے پیچھے چلے آئے ہم کہاں",
      "بارش ہوئی تو مٹی کی خوشبو نہیں ملی",
      "",
      "دوزخ سمجھ کے چھوڑی جو تپتی ہوئی زمین",
      "چھالے پڑے تو پاؤں کو ٹھنڈک وہیں ملی",
      "",
      "جھوٹی انا کا تخت ، زر ِ مصلحت کا تاج",
      "جب کھو دیئے تو دولتِ صدق و یقیں ملی",
      "",
      "تھکتی نہیں ہے سجدۂ فرعون ِ وقت سے",
      "موسیٰ کے حامیوں کو یہ کیسی جبیں ملی",
      "",
      "پردیس آکے مر گئی دریا دلی ظہیؔر",
      "پانی کہیں کا تھا جسے مٹی کہیں ملی",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "تاریک دیاروں میں اُجالے کا پتہ ہیں",
      "ہم لوگ محبت ہیں ، مروت کی ادا ہیں",
      "",
      "مٹِتا ہوا اک نقش ہیں ہم لوحِ جہاں پر",
      "بجھتے ہوئے خاموش ستاروں کی ضیا ہیں",
      "",
      "ہم دستِ محبت میں علمدارِ مساوات!",
      "ہم دُور سے آتی ہوئی مانوس صدا ہیں",
      "",
      "ہر اک کو لگاتے ہیں گلے نام پر اُس کے",
      "سینہ بھی کشادہ ہے تو بازو بھی یہ وا ہیں",
      "",
      "خوشبو کی طرح پھیلے ہیں ہم راہ گزر پر",
      "تاریکیِ شب زار میں جگنو کی ضیا ہیں",
      "",
      "تاراجِ محبت ہیں اٹھائے ہوئے کشکول",
      "آوارۂ دنیا نہیں ، الفت کے گدا ہیں",
      "",
      "جھُلسے ہوئے منظر میں ہیں سائے کی نشانی",
      "گرتی ہوئی دیوارِ روایت کا پتہ ہیں",
      "",
      "ہم کفر سمجھتے ہیں حقارت کی نظر کو",
      "نفرت کی زمینوں میں عنایت کی فضا ہیں",
      "",
      "کھُل جائے گا اک بابِ اثر دل میں تمہارے",
      "مانگو تو سہی ہم کو ہمی حرفِ دعا ہیں",
      "",
      "بجھتے ہیں گھڑی بھر کو جل اُٹھنے کیلئے پھر",
      "ہم لوگ ہواؤں کے نشیمن میں دیا ہیں",
      "",
      "آجائے نہ تیشے میں کہیں ضربتِ ایمان",
      "اِس خوف میں اب امّتِ آزر کے خدا ہیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "وہ کلاہِ کج ، وہ قبائے زر ،سبھی کچھ اُتار چلا گیا",
      "ترے در سے آئی صدا مجھے ، میں دِوانہ وار چلا گیا",
      "",
      "کسے ہوش تھا کہ رفو کرے یہ دریدہ دامنِ آرزو",
      "میں پہن کے جامۂ بیخودی سرِ کوئے یار چلا گیا",
      "",
      "مری تیزگامئ شوق نے وہ اُڑائی گرد کہ راستہ",
      "جو کھلا تھا میری نگاہ پر وہ پسِ غبار چلا گیا",
      "",
      "نہ غرورِ عالمِ آگہی ، نہ جنون و جذبۂ بیخودی",
      "مئے عشقِ خانہ خراب کا ہر اک اعتبار چلا گیا",
      "",
      "تری کائناتِ جمال میں جو عطائے دستِ مجال تھا",
      "مرے شوقِ افسوں طراز کا وہی اختیار چلا گیا",
      "",
      "میں ادا کروں کہ قضا کروں ، اسی کشمکش میں بسر ہوئی",
      "یونہی سجدہ گاہِ حیات سے میں گناہگار چلا گیا",
      "",
      "ترے آستان سے گلہ نہیں ، دلِ سوختہ ہی عجیب ہے",
      "کبھی بے سکون ٹھہر گیا ، کبھی بے قرار چلا گیا",
      "",
      "تری جلوہ گاہِ نیاز میں ، ہے کوئی تماشۂ آرزو!",
      "کبھی تابِ دید نہ آسکی ،کبھی انتظار چلا گیا",
      "",
      "مجھے کاروبارِ وفا ملا ، وہ متاعِ صبر و غنا ملی",
      "مرے دن ظہیؔر بدل گئے ، غمِ روزگار چلا گیا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "واعظ نے اپنے زورِ بیاں سے بدل دیا",
      "کتنی حقیقتوں کو گماں سے بدل دیا",
      "",
      "ہونا تھا میرا واقعہ آغاز جس جگہ",
      "قصّےکو قصّہ خواں نے وہاں سے بدل دیا",
      "",
      "ہے شرطِ جوئے شیر وہی ، وقت نے مگر",
      "تیشے کو جیسے کوہِ گراں سے بدل دیا",
      "",
      "اب مل بھی جائیں یار پرانے تو کیا خبر",
      "کس کس کو زندگی نے کہاں سے بدل دیا",
      "",
      "بیدادِ عشق ہے کہ یہ آزارِ آگہی",
      "سینے میں دل کو دردِ نہاں سے بدل دیا",
      "",
      "اس بار دشتِ جاں سے یوں گزری ہوائے درد",
      "موجِ لہو کو ریگِ رواں سے بدل دیا",
      "",
      "آنکھوں میں شامِ ہجر کا ہر عکسِ منجمد",
      "مل کرکسی نے اشکِ رواں سے بدل دیا",
      "",
      "احساسِ رائگانیِ جذبِ دروں نہ پوچھ",
      "میں نے سکوتِ غم کو فغاں سے بدل دیا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "سرحدِ شہر ِ قناعت سے نکالے ہوئے لوگ",
      "کیا بتائیں تمہیں کس کس کے حوالے ہوئے لوگ",
      "",
      "اپنی قیمت پہ خود اک روز پشیماں ہونگے",
      "سکۂ وقت کی ٹکسال میں ڈھالے ہوئے لوگ",
      "",
      "آئنوں سے بھی نہ پہچانے گئے کچھ چہرے",
      "آتشِ زر میں جلے ایسے کہ کالے ہوئے لوگ",
      "",
      "کب سے ہے میرے تعاقب میں دہن کھولے ہوئے",
      "ایک عفریتِ شکم جس کے نوالے ہوئے لوگ",
      "",
      "تم سے بچھڑے ہیں تو ہر موڑ پہ ٹکراتے ہیں",
      "سنگِ دشنام کے مانند اُچھالے ہوئے لوگ",
      "",
      "راحت ِ سایہ میں بیٹھیں گے تو بجھ جائیں گے",
      "ہم کڑی دھوپ میں سورج کے اُجالے ہوئے لوگ",
      "",
      "اے مرے شہر ِ تمنا تری سرحد سے پرے",
      "جی رہے ہیں تری نسبت کو سنبھالے ہوئے لوگ",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "قرآن کہا جائے نہ تفسیر کہا جائے",
      "ہر فتویِٰ تکفیر کو تقصیر کہا جائے",
      "",
      "کس حرفِ طرح دار پہ انگشتِ یقیں رکھیں",
      "کس عکس کو سچائی کی تصویر کہا جائے",
      "",
      "کس دستِ مسیحائی پہ بیمار کریں بیعت",
      "جب زہرِ ہلاہل کو بھی اکسیر کہا جائے",
      "",
      "معیار بدلتے ہوئے اس دور میں ممکن ہے",
      "اک روز اندھیرے کو بھی تنویر کہا جائے",
      "",
      "آداب کو اب فہرسِ بیکار میں لکھ ڈالو",
      "اقدار کو اب پاؤں کی زنجیر کہا جائے",
      "",
      "بینائی جنہیں ملتی ہے ہوجاتے ہیں دیوانے",
      "آنکھوں کو مرے عہد میں تعزیر کہا جائے",
      "",
      "اشکوں کو ترے نامۂ اعمال میں لکھوں میں",
      "یا ان کو کسی خواب کی تعبیر کہا جائے",
      "",
      "ہجرت ہو کہ ہجراں ہو ، غمِ جاں کہ غمِ جاناں",
      "ہر درد کو اُس نام کی جاگیر کہا جائے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "گرمئ شہر ِ ضرورت سے پگھل جاؤ گے",
      "نہیں بدلے ہو ابھی تک تو بدل جاؤ گے",
      "",
      "اس چمکتے ہوئے دن کو نہ سمجھنا محفوظ",
      "اپنے سائے سے بھی نکلو گے تو جل جاؤ گے",
      "",
      "گردش ِ وقت ہے آتی ہے سبھی کے سر پر",
      "وقت گزرے گا تو اس سے بھی نکل جاؤ گے",
      "",
      "یہ محبت کے مقامات ہیں اے جان ِ نظر",
      "اتنا محتاط چلو گے تو پھسل جاؤ گے",
      "",
      "اپنی تابش کو زمینوں سے نہ کرنا مشروط",
      "ورنہ سورج کی طرح شام کو ڈھل جاؤ گے",
      "",
      "گر رہا ہوں میں مسلسل ہی ،مگر جانے کیوں",
      "کوئی اندر سے یہ کہتا ہے سنبھل جاؤ گے",
      "",
      "تھام کر ہاتھ چلو تم بھی ظہیؔر اپنوں کا",
      "ورنہ اِس بھیڑ میں غیروں سے بدل جاؤ گے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "جذبۂ شوق! انتہا کر دے",
      "ہر تمنا کو بے صدا کر دے",
      "",
      "قید اپنی انا کے بُت میں ہوں",
      "کوئی توڑے مجھے رہا کر دے",
      "",
      "عمر گزری مری کٹہرے میں",
      "زندگی اب تو فیصلہ کر دے",
      "",
      "قد گھٹا دے مری نظر میں مرا",
      "یاالہٰی مجھے بڑا کر دے",
      "",
      "فخر کرتی ہے آدمی پہ حیات",
      "جب کسی کا کوئی بھلا کر دے",
      "",
      "ہے مبارک وہ سانحہ جو ظہیؔر",
      "بے نواؤں کو ہم نوا کر دے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "عشق پھر سے مجھے نیا کر دے",
      "ہر بھرے زخم کو ہرا کر دے",
      "",
      "آسرا چھین لے مسیحا کا",
      "مجھے مرہم سے ماورا کر دے",
      "",
      "زہر بننے لگا ہے سناٹا",
      "شور مجھ میں کوئی بپا کر دے",
      "",
      "میں اک آشوبِ اعتبار میں ہوں",
      "اپنی آنکھیں مجھے عطا کر دے",
      "",
      "ترے رستے میں ہم سفر کیسا",
      "مجھے سائے سے بھی جدا کر دے",
      "",
      "میں مکمل بھی ہو ہی جاؤں گا",
      "تو کسی روز ابتدا کر دے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "روشنی ہی روشنی ہیں جس طرف سے دیکھیے",
      "جل رہے ہیں جو چراغ اُن کو شرف سے دیکھیے",
      "",
      "اِس طرح ہو جائے شاید دوست دشمن کی تمیز",
      "اپنے لشکر کو کبھی دشمن کی صف سے دیکھیے",
      "",
      "سازشوں کے سلسلے چارہ گری کے نام پر!",
      "آج کے اِس دور تک عہدِ سلف سے دیکھیے",
      "",
      "راہبرمشعل بکف ہے ، تیرگی کا خوف کیا",
      "راستے کو موقفِ مشعل بکف سے دیکھیے",
      "",
      "کیا تعلق دل کا ہوتا ہے نظر سے دوستو!",
      "ناوکِ بے مہر کو آکر ہدف سے دیکھیے",
      "",
      "تشنگی ہو جائے گی معلوم دریا کی ظہیؔر",
      "ابر ِ نیساں کو ذرا چشمِ صدف سے دیکھیے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "کب سے لگی ہے اُس کی نشانی کتاب میں",
      "کاغذ مڑا ہوا ہے پرانی کتاب میں",
      "",
      "خلقِ خدا میں ٹھہری وہی سب سے معتبر",
      "لکھی نہ جا سکی جو کہانی کتاب میں",
      "",
      "طاقت ہے کس قلم میں کہ لکھے حدیثِ عشق",
      "ملتی ہے یہ کسی سے زبانی کتاب میں",
      "",
      "اربابِ جہل کر نے لگے شرحِ حرفِ عشق",
      "مت کیجئے تلاش معانی کتاب میں",
      "",
      "منشورِ حق کے ہوتے مجھے کیا غرض بھلا",
      "لکھا ہے کیا فلاں نے فلانی کتاب میں",
      "",
      "کیسے اٹھے گی دستِ سہولت شعار سے",
      "ناموسِ حرف کی ہے گرانی کتاب میں",
      "",
      "کاغذ خراب حال ، عبارت اڑی ہوئی!",
      "دیکھو مری شکستہ بیانی کتاب میں",
      "",
      "فیضِ قلم سے آگئی مجھ کو بھی اب ظہیرؔ",
      "اشکوں کی آبشار بنانی کتاب میں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ہر روز تازہ حادثہ جب ہو گیا کہیں",
      "تھک ہار کر ضمیر مرا سو گیا کہیں",
      "",
      "کھولی تھی جس میں آنکھ جوانی کے خواب نے",
      "وہ رَت جگوں کا شہر مرا کھو گیا کہیں",
      "",
      "کچھ دیر کو ملے تھے سرِ راہ ِ احتیاج",
      "پھر یوں ہوا کہ میں کہیں ، اور وہ گیا کہیں",
      "",
      "اُگتی ہے کشتِ ذات میں مایوسیوں کی پود",
      "کچھ خواہشوں کے بیج کوئی بو گیا کہیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "نہ وہ ملول ہوئے ہیں ، نہ ہم اداس ہوئے",
      "مزاج ترکِ تعلق پہ بے لباس ہوئے",
      "",
      "بجھائے ایسے ہوا نے چراغِ خوش نظری",
      "فروغِ دید کے موسم بھی محوِ یاس ہوئے",
      "",
      "ہم اعتراض تھے ناقد مرے قصیدوں پر",
      "جمالِ یار کو دیکھا تو ہم سپاس ہوئے",
      "",
      "مری نظر میں خود اپنے ہی نقطہ ہائے نظر",
      "نہیں جو تیرا حوالہ تو بے اساس ہوئے",
      "",
      "یہ کار ہائے محبت بپاسِ خاطرِ عشق",
      "دیارِ ہجر میں ہم سے بطورِ خاص ہوئے",
      "",
      "یہ شہر جاں ہے سلامت کسی کے ہونے سے",
      "ہزاروں حادثے ورنہ تو دل کے پاس ہوئے",
      "",
      "سحر ہوئی تو رفیقانِ بے خبر ، میرے",
      "چراغِ کشتۂ ظلمت سے روشناس ہوئے",
      "",
      "دکھائے گردشِ ایام نے وہ رنگ اس بار",
      "ہم ایسے کافر و منکر خدا شناس ہوئے",
      "",
      "ہمارا عہدِ مسائل رقم ہے غزلوں میں",
      "ہمارے شعر زمانے کا اقتباس ہوئے",
      "",
      "سخن جو عام سے لگتے تھے ساری دنیا کو",
      "ظہیؔر حلقۂ یاراں میں آکے خاص ہوئے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "تہمتِ زر سے تہی کیسہ و کاسہ نکلے",
      "میرے قرطاس و قلم میرا اثاثہ نکلے",
      "",
      "پرورش کرتا ہوں میں دُرِ سخن لب بستہ",
      "وہ صدف ہوں کہ جو دریا سے بھی پیاسا نکلے",
      "",
      "کر گئے مجھ کو حوالے مری تنہائی کے",
      "میرے احباب مرے غم کے شناسا نکلے",
      "",
      "ادب آداب تو جی بھر کے ملے دنیا سے",
      "کاش ارمانِ محبت بھی ذرا سا نکلے!",
      "",
      "مجھے منزل نہیں رستے کا تقدس ہے عزیز",
      "ہم سفر کاش مری رہ کا شناسا نکلے",
      "",
      "زندگی ایسی کہانے ہے جو سمٹے تو ظہیؔر",
      "ایک کتبے پہ دو لفظوں میں خلاصہ نکلے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "رنگ شفق سے لے کرجیسے رُخ پہ مَلی ہے شام",
      "اور نکھرتا جاتا ہے وہ جب سے ڈھلی ہے شام",
      "",
      "دھوپ کنارہ زلفوں میں اور چاندنی گالوں پر",
      "ایک افق پر چاند اور سورج! کیسی بھلی ہے شام",
      "",
      "پت جھڑ جیسے رنگوں میں ہے جگنو جیسی آنچ",
      "عمر کی جھکتی ٹہنی پر اک کِھلتی کلی ہے شام",
      "",
      "رنگ فضا میں بکھرے ہیں اور شہنائی کی گونج",
      "کس آنگن سے ہنستی روتی آج چلی ہے شام",
      "",
      "سائے بھی آخر ڈھلتے ڈھلتے چھوڑ گئے ہیں ساتھ",
      "رات سے کیسے اُلجھے آخر ، چھاؤں جلی ہے شام",
      "",
      "فکرِ جہاں کی بستی میں پُر پیچ سڑک ہے د ن",
      "رات ہے روشن دروازہ اور تیر ی گلی ہے شام",
      "",
      "رات اُترنے والی ہے اب کوئی ٹھکانہ ڈھونڈ",
      "اک دفعہ سر پرآکر کس کے سر سے ٹلی ہے شام",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "گھر بسانے کی تمنا کوچۂ قاتل میں ہے",
      "زندگی مصروف اک تحصیلِ لاحاصل میں ہے",
      "",
      "شورِ طوفاں قلقلِ مینا ہے پیاسوں کے لئے",
      "اک پیالے کی طرح ساگر کفِ ساحل میں ہے",
      "",
      "چاک کو دیتے ہیں گردش دیکھ کر گِل کا خمیر",
      "اک پرانی رسم ہم کوزہ گرانِ گِل میں ہے",
      "",
      "مرکزِ دل سے گریزاں ہے محیطِ روزگار",
      "دائرہ کیسے بنے ، پرکارِ جاں مشکل میں ہے",
      "",
      "دے گیا ہے ڈوبتا سورج اُجالے کی نوید",
      "ایک تازہ دن کہیں تقویم کی منزل میں ہے",
      "",
      "عیب اُنہی کی آنکھ میں ہو عین ممکن ہے ظہیؔر",
      "جو سمجھتے ہیں کہ خامی جوہرِ کامل میں ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ہم خاک نشینوں کو نئی خاک ملی ہے",
      "جو چھوڑ کر آئے وہی املاک ملی ہے",
      "",
      "ہم سادہ روش لوگ بدلتے نہیں چولے",
      "میلی ہی نہیں ہوتی وہ پوشاک ملی ہے",
      "",
      "پہنے ہوئے پھرتے ہیں تہِ جبہ و دستار",
      "در سے جو ترے خلعتِ صد چاک ملی ہے",
      "",
      "رکھی ہے بصارت کی طرح دیدۂ تر میں",
      "قسمت سے ہمیں نعمتِ نمناک ملی ہے",
      "",
      "سونے کے بدل بکتی ہے بازار میں خوشبو",
      "پھولوں کو مگر قیمتِ خاشاک ملی ہے",
      "",
      "رکھتے ہیں امانت کی طرح نقدیِ جاں کو",
      "وہ لوگ جنہیں دولتِ ادراک ملی ہے",
      "",
      "دیتے ہوئے ڈرتا ہوں اُسے جامۂ الفاظ",
      "خامے کو طبیعت مرے بے باک ملی ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "نہیں لیا کوئی احسانِ باغباں ہم نے",
      "بھری بہار میں چھوڑا ہے گلستاں ہم نے",
      "",
      "سفر میں رہ گئے پیچھے مگر یہ کم ہے کیا",
      "ہر ایک موڑ پہ چھوڑے ہیں کچھ نشاں ہم نے",
      "",
      "تمہارے نام کی افشاں سے جو سجائی تھی",
      "کسی کی مانگ میں بھر دی وہ کہکشاں ہم نے",
      "",
      "بچا کے لائے تھے بس اک چراغ آندھی سے",
      "سجا کے رکھ دیا محفل کے درمیاں ہم نے",
      "",
      "جلا ہے زہر ِ خموشی میں ایک عمر خیال",
      "بنا اصیل تو کھولی ہے پھر زباں ہم نے",
      "",
      "ضرورتوں کے سفر میں غرورِ نسبت ِ حرف",
      "تجھے گنوایا ہے جانے کہاں کہاں ہم نے",
      "",
      "مقیم ِ راہِ سفر ہیں ، سروں پر اپنے ظہیؔر",
      "غبارِ راہ کو رکھا ہے سائباں ہم نے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اپنی متاعِ خواب ترے نام کر گیا",
      "اک شخص شہر ِ ہجر میں گمنام مر گیا",
      "",
      "ترکِ جنون کرکے بیاباں سے گھر گیا",
      "بازی نبردِ عشق کی دیوانہ ہر گیا",
      "",
      "اِس رقص ِگردبادِ غم ِ روزگار میں",
      "ہر جامۂ لحاظ بدن سے اتر گیا",
      "",
      "سورج کو سر پہ لاد کے دن بھر چلا تھا میں",
      "اُس کو فصیلِ شام پہ چھوڑا تو گھر گیا",
      "",
      "شاخِ گلاب شعلۂ لرزاں لگی مجھے",
      "پروردۂ خزاں تھا بہاروں سے ڈر گیا",
      "",
      "اک حرفِ بے شرف کہ کوئی بولتا نہ تھا",
      "بولا گیا تو شہر صداؤں سے بھر گیا",
      "",
      "ہر جوہر ِ حیات ہوا صرفِ اندمال",
      "اک زخم بھرتے بھرتے مرا کام کر گیا",
      "",
      "قدموں سے راستے گئے رہبر کی آس میں",
      "رہبر ملے تو ہاتھ سے رختِ سفر گیا",
      "",
      "جرم ِوفائے یار کے مجرم بھی ہم ہوئے",
      "الزامِ خود سری بھی ہمارے ہی سر گیا",
      "",
      "در پر ترے جھکے تو زمانہ ہوا خلاف",
      "چھوٹا سا ایک کام بڑا نام کر گیا",
      "",
      "پھر سے زمین ہے کسی وارث کی منتظر",
      "گرد و غبارِ وقت میں آدم بکھر گیا",
      "",
      "ایسے ملے سراب مسلسل کہ اب ظہیرؔ",
      "تشنہ لبی تو ہے مگر احساس مر گیا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ویسے میں ہر حلیف سے محروم تو ہوا",
      "کس کس کی زد پہ ہوں مجھے معلوم تو ہوا",
      "",
      "کھوئے ہوئے کھلونے کی انتھک تلاش میں",
      "دنیا سے آشنا کوئی معصوم تو ہوا",
      "",
      "بکھرا ہوا تھا میرا فسانہ مری طرح",
      "اشعار کے بہانے سے منظوم تو ہوا",
      "",
      "لکھا گیا ہوں گرچہ خسارے کے باب میں",
      "لیکن تری کتاب میں مرقوم تو ہوا",
      "",
      "پھر سے ترے خیال کی اک روشنی ملی",
      "زندہ ذرا سا خامۂ مرحوم تو ہوا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ہزاروں غم محبت کے مرادیں پانے آتے ہیں",
      "یہ دل درگاہِ الفت ہے یہاں نذرانے آتے ہیں",
      "",
      "نجانے کون سی منزل ہے یہ سودائے الفت کی",
      "دوانے شہر بھر کے اب مجھے سمجھانے آتے ہیں",
      "",
      "کبھی مہمیز ہو کر دشمنی ٹھوکر لگاتی ہے",
      "کبھی دیوار بن کر سامنے یارانے آتے ہیں",
      "",
      "کوئی تو بات ہوتی ہے تبھی تو بنتی ہیں باتیں",
      "زمانے کے لبوں پر کب یونہی افسانے آتے ہیں",
      "",
      "روایت ہے یہی مے خانۂ اقدارِ دنیا کی",
      "پرانے ٹوٹ جائیں تو نئے پیمانے آتے ہیں",
      "",
      "نہیں کھلتا ہر اک پر جلوۂ حسنِ فروزاں بھی",
      "سلامت اب طوافِ شمع سے پروانے آتے ہیں",
      "",
      "مسافر ہوں ، الہٰی خیر میرے دین و ایماں کی",
      "مرے رستے میں کچھ مسجد نما بتخانے آتے ہیں",
      "",
      "کوئی تصویر سی تصویر ہے آنکھوں میں وحشت کی",
      "مجھے آباد شہروں میں نظر ویرانے آتے ہیں",
      "",
      "کوئی تعزیر سی تعزیر ہے اک جرمِ عشرت کی",
      "جدھر جاؤں تعاقب میں کئی غم خانے آتے ہیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "منظرِ دشتِ تگ و تاز بدل کر دیکھا",
      "رزق کو رفعتِ پرواز بدل کر دیکھا",
      "",
      "سلسلہ کوئی ہو انجام وہی ہوتا ہے",
      "ہم نے سو مرتبہ آغاز بدل کر دیکھا",
      "",
      "بس وہی ہجر کے سرگم پہ وہی درد کی لے",
      "مطربِ عشق نے کب ساز بدل کر دیکھا",
      "",
      "میرے شعروں سے ترے رمز و کنائے نہ گئے",
      "میں نے ہر مصرعۂ غماز بدل کر دیکھا",
      "",
      "ہم گدایانِ محبت نے مقدر اپنا",
      "کبھی کاسہ ، کبھی آواز بدل کر دیکھا",
      "",
      "دشمنی کیسے بدل دیتی ہے تیور اپنے",
      "معجزہ میں نے یہ ہمراز بدل کر دیکھا",
      "",
      "کیا کہیں کیسا تماشہ کوئے جاناں میں ظہیؔر",
      "یہ لب و لہجہ و انداز بدل کر دیکھا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "منظر وہی پرانا ہے ، موسم نیا نیا",
      "بدلا جو میں نے زاویہ ، عالم نیا نیا",
      "",
      "تازہ ہے دوستی ابھی لہجے نہ جانچئے",
      "کھُلتا ہے تار تار یہ ریشم نیا نیا",
      "",
      "دل کی خلش بڑھی ہے تری قربتوں سے اور",
      "زخموں کو جیسے ملتا ہے مرہم نیا نیا",
      "",
      "ہر عکس کرچیاں سی چبھاتا ہے آنکھ میں",
      "پتھر اور آئنے کا ہے سنگم نیا نیا",
      "",
      "یارب ہو میرے شہر ِ سیاست میں سب کی خیر",
      "گلیوں میں پھر اٹھا کوئی پرچم نیا نیا",
      "",
      "پیروں کو یوں بھی رقص کی عادت نہیں ظہیؔر",
      "چھیڑا ہے زندگی نے بھی سرگم نیا نیا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "کچھ دیر کو رسوائی ِ جذبات تو ہوگی",
      "محفل میں سہی اُن سے ملاقات تو ہوگی",
      "",
      "بس میں نہیں اک دستِ پذیرائی گر اُس کے",
      "آنکھوں میں شناسائی کی سوغات تو ہوگی",
      "",
      "سوچا بھی نہ تھا خود کو تمہیں دے نہ سکوں گا",
      "سمجھا تھا مرے بس میں مری ذات تو ہوگی",
      "",
      "ہر حال میں ہنسنے کا ہنر پاس تھا جن کے",
      "وہ رونے لگے ہیں تو کوئی بات تو ہوگی",
      "",
      "میں پوچھ ہی لوں گا کہ ملا کیا تمہیں کھو کر",
      "اک روز کہیں خود سے مری بات تو ہوگی",
      "",
      "اِس بازیِ مابینِ غمِ وصلت و ہجراں",
      "جس مات سے ڈرتے ہو وہی مات تو ہوگی",
      "",
      "اِس آس پہ دن شہر ِ ضرورت کو دیا ہے",
      "اُجرت میں ترے ساتھ مری رات تو ہوگی",
      "",
      "ہو جاؤں خفا میں تو منانے کوئی آئے",
      "اے دوستو اتنی مری اوقات تو ہوگی",
      "",
      "سمجھیں اب اسے گھر کہ سرائے اسے جانیں",
      "لائی ہے جہاں شام وہاں رات تو ہوگی",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اپنوں نے بھی منّت کی ، غیروں نے بھی سمجھایا",
      "کرنا تھا جو اِس دل نے کیا ، باز نہیں آیا",
      "",
      "نالہ كبھی کھینچا ہے ، تو گیت كبھی گایا",
      "نازِ شبِ ہجراں نہ كسی طور بھی اُٹھ پایا",
      "",
      "دیکھا تھا کبھی جس کی گلیوں میں اُسے دل نے",
      "چلتے ہی رہے ہم تو وہ شہر نہیں آیا",
      "",
      "آوارگی میری ہے ، رستے کے مقدر میں",
      "اور میرے مقدر میں ہر منزلِ بے سایا",
      "",
      "غزلوں میں فسانوں میں کس شخص کی باتیں ہیں؟",
      "ہم نے تو بہت ڈھونڈا ، دیکھا نہ کہیں پایا",
      "",
      "جب یاد کوئی آئی ، ہم روئے اکیلے میں",
      "جب روئے اکیلے میں ، تو یاد کوئی آیا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "آسرے توڑتے ہیں ، کتنے بھرم توڑتے ہیں",
      "حادثے دل پہ مرے دُہرا ستم توڑتے ہیں",
      "",
      "آستینوں میں خداوند چھپا کر اتنے",
      "لوگ کن ہاتھوں سے پتھر کے صنم توڑتے ہیں",
      "",
      "اُٹھ گئی رسمِ صدا شہر ِ طلب سے کب کی",
      "اب تو کشکولِ ہوس بابِ کرم توڑتے ہیں",
      "",
      "جھوٹی تعبیر کے آرام کدے سے تو نکل",
      "خواب کتنے تری دہلیز پہ دم توڑتے ہیں",
      "",
      "ہم نے اُس شہر میں بھی پاسِ وفا رکھا ہے",
      "قیس و فرہاد جہاں روز قسم توڑتے ہیں",
      "",
      "پڑھنے والے پڑھا کرتے ہیں ترے چہرے کو",
      "لکھنے والے ترے قدموں میں قلم توڑتے ہیں",
      "",
      "تیرا اعجاز کہ ہم تیری اسیری کے لئے",
      "دامِ صد حلقۂ دینار و درم توڑتے ہیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اِن غزالوں کو بھلا کس کے ٹھکانے کی خبر",
      "پوچھئے خارِ مغیلاں سے دِوانے کی خبر",
      "",
      "خاک چھانوں تری گلیوں کی بتا میں کب تک",
      "دے مرے شہر کوئی یار پرانے کی خبر!",
      "",
      "اب خبر ملتی نہیں اُن کی زمانے میں کہیں",
      "وہ جو رکھتے تھے کبھی سارے زمانے کی خبر",
      "",
      "تیر ایسے بھی حلیفوں کی کمانوں میں ہیں آج",
      "جن کے ترکش کا پتا ہے ، نہ نشانے کی خبر",
      "",
      "ملنے آئے ہیں مرے دوست ، یقیناً ہوگی",
      "پھر نئی تازہ کوئی دل کو جلانے کی خبر",
      "",
      "باندھ لے زادِ سفر ، دیر نہ کر اب تو ظہیرؔ",
      "آنے والی ہے کسی دن ترے جانے کی خبر",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اے وقت ذرا تھم جا ، یہ کیسی روانی ہے",
      "آنکھوں میں ابھی باقی اک خوابِ جوانی ہے",
      "",
      "کیا قصہ سنائیں ہم اس عمرِ گریزاں کا",
      "فرصت ہے بہت تھوڑی اور لمبی کہانی ہے",
      "",
      "اک راز ہے سینے میں ، رکھا نہیں جاتا اب",
      "آکر کبھی سن جاؤ اک بات پرانی ہے",
      "",
      "سچے تھے ترے وعدے ، سچے ہیں بہانے بھی",
      "بس ہم کو شکایت کی عادت ہی پرانی ہے",
      "",
      "جو کچھ بھی کہا تم نے ، تم کو ہی خبر ہوگی",
      "ہم نے تو سنا جو کچھ دنیا کی زبانی ہے",
      "",
      "گزری جو بنا تیرے اُس عمر کا افسانہ",
      "ہونٹوں کی خموشی ہے ، آنکھوں کا یہ پانی ہے",
      "",
      "اے یادِ شبِ الفت ! کچھ اور تھپک مجھ کو",
      "پلکوں پر ابھی باقی دن بھرکی گرانی ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "سفر حضر کی علامتیں ہیں ، یا استعارہ ہے قافلوں کا",
      "یہ شاعری تو نہیں ہماری ، یہ روزنامہ ہے ہجرتوں کا",
      "",
      "یہ رُوپ سورج کی دھوپ جیسا ، یہ رنگ پھولوں کی آنچ والا",
      "یہ سارے منظر ہیں بس اضافی ، یہ سب تماشہ ہے زاویوں کا",
      "",
      "ہر ایک اپنی انا کو تانے دُکھوں کی بارش میں چل رہا ہے",
      "دیارِ ہجرت کے راستوں پر عجیب موسم ہے چھتریوں کا",
      "",
      "ہر اک شباہت میں اپنا چہرہ دکھائی دیتا ہے عکس درعکس",
      "خود آشنائی کی حد سے آگے عجب علاقہ ہے آئنوں کا",
      "",
      "بس اب ضرورت کی وادیوں میں قیام جیسی مسافرت ہے",
      "چلے تھے ہم جب ظہیؔر گھر سے تو اک ارادہ تھا پربتوں کا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ہم ترا ذکرِ طرحدار لکھا کرتے تھے",
      "کوئی روکے تو بہ تکرار لکھا کرتے تھے",
      "",
      "پندِ ناصح جو کہیں لکھا نظر آ جائے",
      "نام تیرا وہیں سو بار لکھا کرتے تھے",
      "",
      "محضرِ جرمِ وفا پر بخطِ رسم ِ جلی",
      "برملا کلمۂ اقرار لکھا کرتے تھے",
      "",
      "فردِ تکفیر ہمیں ملتی تھی جس کاغذ پر",
      "ہم اُسی پر ترے اشعار لکھا کرتے تھے",
      "",
      "ہم نے دیکھا ہی نہ تھا کچھ لب و عارض کے سوا",
      "دل کے زخموں کو بھی گلنار لکھا کرتے تھے",
      "",
      "چشمِ سادہ کو بہم آئی تھی وہ خوش نظری",
      "ہم تو صحرا کو بھی گلزار لکھا کرتے تھے",
      "",
      "شبِ تیرہ کے اُلجھتے ہوئے پیچ و خم کو",
      "سایۂ گیسوئے خم دار لکھا کرتے تھے",
      "",
      "طفلِ مکتب تھے ، دوانے تھے کہ ہم فرزانے",
      "دل کی باتیں سر دیوار لکھا کرتے تھے",
      "",
      "مختصر یہ کہ جو لکھتے تھے لہو سے اپنے",
      "لوگ کہتے ہیں کہ بیکار لکھا کرتے تھے",
      "",
      "معتبر ٹھہرے وہی حرفِ ضرورت کہ جنہیں",
      "لکھنے والے سرِ دربار لکھا کرتے تھے",
      "",
      "جانے کس شہرِ خموشی میں ہوئے خوابیدہ",
      "جو سخن خامۂ بیدار لکھا کرتے تھے",
      "",
      "مر گئے کب کے وہ دل میں لئے امید ِ جواب",
      "خط مسیحا کو جو بیمار لکھا کرتے تھے",
      "",
      "ڈر رہے ہیں اب اُسی عہدِ ترقی سے ظہیؔر",
      "جس کی آمد کے ہم آثار لکھا کرتے تھے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "یہ مرا غم کسی صورت نہیں گھٹنے والا",
      "ناخدا تھا مری کشتی کو اُلٹنے والا",
      "",
      "چھوڑ کر دیکھ تو احساس کا دامن اے دل",
      "غم رہے گا نہ کوئی جاں سے لپٹنے والا",
      "",
      "راہِ تسکین پہ لے آئی تمنا مجھ کو",
      "زندگی بھر بھی سفر اب نہیں کٹنے والا",
      "",
      "مانتا ہوں کہ نظر مجھ کو ملی ہے لیکن",
      "کوئی منظر بھی تو ہو دل میں سمٹنے والا",
      "",
      "ملک الموت اٹھائے تو اٹھائے آکر",
      "میں ترے در سے ہٹائے نہیں ہٹنے والا",
      "",
      "حرمت ِ حرفِ یقیں دل پہ نہ اترے جب تک",
      "میں کوئی نام زبانی نہیں رَٹنے والا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "یہ کہہ رہے ہیں وہ کالک اُچھالنے والے",
      "ہمی ہیں شہر کی رونق اُجالنے والے",
      "",
      "منافقت کی عفونت بھی ساتھ لائے ہیں",
      "گلے میں ہار گلابوں کا ڈالنے والے",
      "",
      "دہن میں لقمۂ شیریں بھی رکھتے جاتے ہیں",
      "مرے وجود میں لاوا اُبالنے والے",
      "",
      "ہجوم چنتا ہے ساحل پہ سیپیوں سے گہر",
      "نظر سے گم ہیں سمندر کھنگالنے والے",
      "",
      "کہاں گئے وہ شناور اندھیری جھیلوں کے",
      "وہ ڈوبے چاند کو باہر نکالنے والے",
      "",
      "نہیں ڈھلیں گے کبھی سیم و زر کے سانچوں میں",
      "تمہاری یاد کو شعروں میں ڈھالنے والے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ہوش و خرد ، غرورِ تمنا گنوا کے ہم",
      "پہنچے ترے حضور میں کیا کیا لٹا کے ہم",
      "",
      "کوہِ گرانِ عشق تری رفعتوں کی خیر!",
      "دامن میں تیرے آگئے تیشہ گنوا کے ہم",
      "",
      "ہم پیش کیا کریں اُسے کشکول کے سوا",
      "وہ ذات بے نیاز ہے ، بھوکے سدا کے ہم",
      "",
      "نادم ہیں کر کے چہرۂ قرطاس کو سیاہ",
      "ناموسِ حرف اوجِ قلم سے گرا کے ہم",
      "",
      "ہم لوگ ہیں ظہیؔر اُسی اک خیال کے",
      "نکلے نہ جس خیال سے اک بار جا کے ہم",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ہم جسے اَن کہی سمجھتے تھے",
      "بات وہ تو سبھی سمجھتے تھے",
      "",
      "جیت کر ہم اُنہیں زمانے سے",
      "جنگ جیتی ہوئی سمجھتے تھے",
      "",
      "کتنے سادہ تھے ہم بچھڑتے وقت",
      "ہجر کو عارضی سمجھتے تھے",
      "",
      "ہم تھے آدابِ غم سے ناواقف",
      "ہر ہنسی کو ہنسی سمجھتے تھے",
      "",
      "گھر کے جلنے سے پہلے گھر والے",
      "آگ کو روشنی سمجھتے تھے",
      "",
      "۔ ق۔",
      "",
      "اپنے جذب و جنوں میں ہم وہ بات",
      "جو نہ سمجھا کوئی ، سمجھتے تھے",
      "",
      "جب تک ادراکِ ہست و بود نہ تھا",
      "چیز خود کو بڑی سمجھتے تھے",
      "",
      "لفظ و معنی پہ لڑ رہے تھے ہم",
      "علم کو آگہی سمجھتے تھے",
      "",
      "زندگی کا وہ پیش خیمہ تھا",
      "ہم جسے زندگی سمجھتے تھے",
      "",
      "وقت الجھا گیا ہمیں ورنہ",
      "ہم بھی خود کو کبھی سمجھتے تھے",
      "",
      "تم سمجھتے ہو سادگی کو سہل",
      "ہم بھی پہلے یہی سمجھتے تھے"
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ہوئے مسند نشیں پھر ملک و ملت بیچنے والے",
      "بنا کر بھیس زرداروں کا غربت بیچنے والے",
      "",
      "خدا حافظ بزرگوں کی امانت کا خدا حافظ",
      "محافظ ہوگئے گھر کے ، وراثت بیچنے والے",
      "",
      "زمیں ملکِ خدا میں ہوگئی تنگ اب کہاں جائیں",
      "کدالیں تھام کر ہاتھوں میں محنت بیچنے والے",
      "",
      "خزانے میری مٹی کے عجب ہیں کم نہیں ہوتے",
      "مسلسل بیچتے ہیں بے رعایت بیچنے والے",
      "",
      "قلم کی روشنائی کر رہے ہیں صرفِ آرائش",
      "صحافت کی دکانوں میں سیاست بیچنے والے",
      "",
      "مٹاکر تو دکھائیں پہلے کالک اپنے چہروں کی",
      "بنام ِ صبح روشن تر یہ ظلمت بیچنے والے",
      "",
      "دل و جاں برطرف ، بکتے رہیں گے دین و ایماں بھی",
      "خریداروں کی دنیا میں سلامت بیچنے والے",
      "",
      "منافق ہوگئی میری سماعت بھی ظہیؔر آخر",
      "پسند آئے سر ِ منبر خطابت بیچنے والے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "نظمِ نو آ گیا ، انصاف نرالا دے گا",
      "بیچ کر مجھ کو مرے منہ میں نوالا دے گا",
      "",
      "فرق مٹ تو گئے مابین ِ سفید و سیہ اب",
      "اور کتنا یہ نیا دور اُجالا دے گا",
      "",
      "جس کی خاطر میں نے پہچان گنوائی اپنی",
      "اب وہی میرے تشخص کو حوالہ دے گا",
      "",
      "سر جھکاتا ہے پذیرائی کے انداز میں آج",
      "کل یہی شہر ہمیں دیس نکالا دے گا",
      "",
      "اور کیا دے گا تجھے بندۂ حاجت اے خدا",
      "نذر میں اپنا یہی خالی پیالہ دے گا",
      "",
      "گنگنائے گا مرا شعر ہر اک صاحب ِ ذوق",
      "اور مجھے دادِ سخن سوچنے والا دے گا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اک بادباں شکستہ طغیانیوں میں دیکھا",
      "بے حوصلہ سفینہ کم پانیوں میں دیکھا",
      "",
      "اتنا قریب تجھ کو پایا نہ محفلوں میں",
      "جتنا قریب تجھ کو ویرانیوں میں دیکھا",
      "",
      "اُن مشکلوں سے بہتر آسانیاں نہیں یہ",
      "جن مشکلوں کو میں نے آسانیوں میں دیکھا",
      "",
      "کیسے کھلوں میں اُس پر ، اِس زندگی کو جس نے",
      "بس خواہشوں میں سوچا ، من مانیوں میں دیکھا",
      "",
      "ملتا نہیں کہیں اب چشمِ جہان بیں کو",
      "جو روپ زندگی کا نادانیوں میں دیکھا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "زنجیر کس کی ہے کہ قدم شاد ہوگئے",
      "بیڑی پہن کے لگتا ہے آزاد ہوگئے",
      "",
      "جتنے بھی حرفِ سادہ ہوئے اُس سے منتسب",
      "ہم رنگِ نقش ِ مانی و بہزاد ہوگئے",
      "",
      "سنگِ سخن میں جوئے معانی کی جستجو!",
      "گویا قلم بھی تیشۂ فرہاد ہوگئے",
      "",
      "زندہ رہے اصولِ ضرورت کے ماتحت",
      "جب چاہا زندگی نے ہم ایجاد ہوگئے",
      "",
      "بیداد گر ملے سبھی ہم طرز و ہم خیال",
      "سارے ستم زبانی ہمیں یاد ہوگئے",
      "",
      "آب و ہوائے شہر ِ ہوس کچھ نہ پو چھئے",
      "برباد وہ ہوئے کہ جو آباد ہوگئے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "کوئی بھی آگ ہو ، شانہ بشانہ جلتا ہے",
      "وہ میرے ساتھ ہے جب سے ، زمانہ جلتا ہے",
      "",
      "کوئی تو رہتا ہے دل کے کھنڈر مکانوں میں",
      "چراغ شام کو اکثر پرانا جلتا ہے",
      "",
      "دراز دستیِ بادِ ستم کا شکوہ کیا",
      "بجھا چراغ تو اب جاودانہ جلتا ہے",
      "",
      "یہ انتظار شبستان ِ دل میں ہے کس کا",
      "نہ بجھ کے دیتا ہے کوئی دیا ، نہ جلتا ہے",
      "",
      "ہمارے شہر میں قیمت ہے روشنی پہ ابھی",
      "دیا جلائیں تو پہلے ٹھکانہ جلتا ہے",
      "",
      "وہ تیرِ عشق جو پیوستِ جاں ہوا تھا کبھی",
      "نکل گیا ، مگر اب تک نشانہ جلتا ہے",
      "",
      "ذرا خیال سے چُھونا ظہیؔر شاخِ نہال",
      "گلابِ سرخ نہیں ، آشیانہ جلتا ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "زندہ حقیقتوں سے چھپایا گیا ہمیں",
      "ماضی کی داستاں میں بسایا گیا ہمیں",
      "",
      "چھینا گیا لبوں سے تبسم بنامِ سوز",
      "قصے کہانیوں پہ رُلایا گیا ہمیں",
      "",
      "اپنے سوا ہر عکس ہی بگڑا ہوا لگا",
      "آئینہ اِس طرح سے دکھایا گیا ہمیں",
      "",
      "پہلے تو ایک درسِ اخوّت دیا گیا",
      "پھر حرفِ اختلاف پڑھایا گیا ہمیں",
      "",
      "کانوں میں زہرِ کفر انڈیلا گیا ہے روز",
      "پھر کلمۂ یقین سنایا گیا ہمیں",
      "",
      "اُٹھ کر پتہ چلا کہ قیامت گزر چکی",
      "ایسا تھپک تھپک کے سُلایا گیا ہمیں",
      "",
      "دوزخ کی آگ بھوکے بدن سے لپیٹ کر",
      "وعدہ بہشت کا بھی دلایا گیا ہمیں",
      "",
      "تقریبِ دوستاں میں ستم در ستم ہوا",
      "تعظیم ِ دشمناں میں اٹھایا گیا ہمیں",
      "",
      "پیشانیوں پہ قیمتیں لکھ کر مثالِ جنس",
      "بے حد و بے حساب کمایا گیا ہمیں",
      "",
      "پانی نہیں تھے خون پسینہ تھے ہم ظہیؔر",
      "سیراب بستیوں میں بہایا گیا ہمیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "سایۂ نخلِ ثمر بار نہیں آیا پھر",
      "گھر سے نکلے تو چمن زار نہیں آیا پھر",
      "",
      "پھر مجھے خاکِ جنوں لے کے پھری دشت بہ دشت",
      "وہ ترا شہرِ خوش آثار نہیں آیا پھر",
      "",
      "تم نے تو دام لگا کر یونہی بس چھوڑ دیا",
      "میرے خوابوں کا خریدار نہیں آیا پھر",
      "",
      "بجھ گئی جلتی ہوئی دھوپ تو ہمسایوں کے بیچ",
      "قضیۂ سایۂ دیوار نہیں آیا پھر",
      "",
      "جانے اب شہر کا کیا رنگ ہے ، کیا عالم ہے؟",
      "آج دروازے پر اخبار نہیں آیا پھر",
      "",
      "سلسلہ اُن سے تکلم کا جو ٹوٹا تو ظہیؔر",
      "بزم میں تشنۂ اظہار نہیں آیا پھر",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "زندہ ہزاروں لوگ جہاں مر کے ہوگئے",
      "ہم بھی خدا کا شکر اُسی در کے ہوگئے",
      "",
      "جو راس تھا ہمیں وہی قسمت نے لکھ دیا",
      "ہم جور آشنا تھے ستم گر کے ہوگئے",
      "",
      "نکلے تھے ہم جزیرۂ زر کی تلاش میں",
      "ساحل کی ریت چھوڑ کے ساگر کے ہوگئے",
      "",
      "کچھ ایسا رائگانیِ دستک کا خوف تھا",
      "پہلا جو در کھلا ہم اُسی در کے ہوگئے",
      "",
      "میرے ستم گروں کا بھی معیار بڑھ گیا",
      "پتھر جو مجھ پر آتے تھے مرمر کے ہوگئے",
      "",
      "بالیدگی ہوائے سیاست کی دیکھنا !",
      "بالشتیئے اک آن میں گز بھر کے ہوگئے",
      "",
      "کرنے لگے ہیں وہ بھی لو بچپن کو اپنے یاد",
      "بچّے ظہیؔر میرے برابر کے ہوگئے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "کسی بھی عشق کو ہم حرزِ جاں بنا نہ سکے",
      "انا کا بوجھ تھا اتنا کہ کچھ اٹھا نہ سکے",
      "",
      "فصیلیں ساری گرادیں جو درمیان میں تھیں",
      "دلوں کے بیچ کی دیوار ہی گرا نہ سکے",
      "",
      "ہزار حرفِ خوش آہنگ تھے بہم لیکن",
      "مزاجِ کلک کی تلخی کبھی چھپا نہ سکے",
      "",
      "سبھی کے غم کئے تصویر ہم نے شعروں میں",
      "کسی کے غم کا مداوا مگر بتا نہ سکے",
      "",
      "سبھی کو آئنہ توفیق بھر دیا ہم نے",
      "خود اپنے عکس پہ نظریں کبھی جما نہ سکے",
      "",
      "دلوں کا حال خدا جانتا ہے خوب ظہیؔر",
      "خدا گواہ کہ تم ہی کبھی نبھا نہ سکے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "لُٹا ہے میرا خزانہ مرے برابر سے",
      "بدل گیا وہ ٹھکانہ مرے برابر سے",
      "",
      "جو تِیر میرا نہیں تھا اُسی کا مجرم ہوں",
      "لیا گیا تھا نشانہ مرے برابر سے",
      "",
      "پلٹ کے کر گیا تلقین مجھ کو رُکنے کی",
      "ہوا ہے جو بھی روانہ مرے برابر سے",
      "",
      "بڑھا گیا مرا احساسِ عمر ِ رفتہ کچھ اور",
      "گزر کے یار پرانا مرے برابر سے",
      "",
      "تمہی سے باقی ہے کچھ اعتبارِ بزمِ حیات",
      "کبھی تم اُٹھ کے نہ جانا مرے برابر سے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "دل کو ٹٹولئے ، کوئی ارمان ڈھونڈئیے",
      "پھر سے کسی نظر میں پرستان ڈھونڈئیے",
      "",
      "یونہی گزر نہ جائے کہیں فرصتِ خزاں",
      "آرائشِ بہار کا سامان ڈھونڈیئے",
      "",
      "کب تک گلاب ہاتھ میں لے کر پھریں گے آپ",
      "موسم بہت شدید ہے گلدان ڈھونڈئیے",
      "",
      "دیوار ہی گری ہے ، یہ بازو نہیں گرے",
      "ملبہ اٹھا کے سائے کا امکان ڈھونڈیے",
      "",
      "اٹھتی ہے اک صدا سی مشینوں کے شور میں",
      "ہوگا یہیں کہیں کوئی انسان ، ڈھونڈیئے",
      "",
      "ملیے کبھی اکیلے میں خود اپنے آپ سے",
      "سارے نقاب اُتار کے پہچان ڈھونڈیئے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "بے سمت کاوشوں کا ثمر دائرے میں ہے",
      "محور نہیں ہے پھر بھی سفر دائرے میں ہے",
      "",
      "دُہرا رہے ہیں خود کو عروج و زوالِ دہر",
      "عالم تمام زیر و زبر دائرے میں ہے",
      "",
      "کہنے کو انجمن ہے شریکِ سخن ہیں لوگ",
      "ہر شخص اپنے اپنے مگر دائرے میں ہے",
      "",
      "سونپی تھی رازداں کو جو ، آ پہنچی مجھ تلک",
      "معلوم یہ ہوا کہ خبر دائرے میں ہے",
      "",
      "رستے ہیں شہرِ حرص میں آنے کے بے شمار",
      "بس واپسی کی راہ گزر دائرے میں ہے",
      "",
      "قائم رہے خدا وہ مرا مرکزِ یقین!",
      "جب تک خرامِ شمس و قمر دائرے میں ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ترکِ تعلقات کا وعدہ نہ کر سکیں",
      "چاہیں بھی ہم اگر کبھی ایسا نہ کر سکیں",
      "",
      "سر سے تمھارے عشق کا سودا نہ جا سکے",
      "تا عمر ہم کسی کو بھی اپنا نہ کر سکیں",
      "",
      "جلتے رہیں سدا یونہی رستوں کی دھوپ میں",
      "یادوں کے سائبان بھی سایا نہ کر سکیں",
      "",
      "مصروفیت تو ہو مگر ایسی نہیں کہ اب",
      "بزمِ خیال بھی کوئی برپا نہ کر سکیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "کارِ وفا محال تھا ، ناکام رہ گیا",
      "قصّہ ہمارا تشنۂ انجام رہ گیا",
      "",
      "شب کو بھی میں چھڑا نہ سکا رہن ِدرد سے",
      "دن بھی اسیر ِ گردشِ ایّام رہ گیا",
      "",
      "ظلمات ِ پُرفریب میں اُلجھی رہی نظر",
      "محروم ِ دید ماہ ِ سر ِ بام رہ گیا",
      "",
      "تصویرِ جاں کو حسرتِ تکمیل ہی رہی",
      "اک نقشِ آرزو تھا کہ بس خام رہ گیا",
      "",
      "تکتا ہوں چھوٹ کر بھی کمیں گاہِ دہر کو",
      "دل جیسا اک اسیر تہِ دام رہ گیا",
      "",
      "غارت گر ِسخن تھی ہوائے خیالِ ہجر",
      "بجھ کر چراغِ حرف سر ِ شام رہ گیا",
      "",
      "اک خواہش ِ دوام کہ تھی ضامن ِ کمال",
      "رخصت ہوئی تو نقش ِ ہنر خام رہ گیا",
      "",
      "ہر تہمتِ جنوں سے تو ہم ہوگئے بَری",
      "سر پر دفاعِ ہوش کا الزام رہ گیا",
      "",
      "احوال کیا سنائیں جنابِ ظہیؔر کا",
      "عرصہ ہوا کہ مر گئے بس نام رہ گیا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "کچھ جرم نئے اور مرے نام لگا دو",
      "باقی ہے اگر کوئی تو الزام لگا دو",
      "",
      "کیوں کرتے ہو دربارِ عدالت کا تکلف",
      "جو حکم لگانا ہے سر ِ عام لگا دو",
      "",
      "افسانہ ہمارا ہے ، قلم سارے تمہارے",
      "عنوان جو چاہو بصد آرام لگا دو",
      "",
      "دیوانوں کو پابندِ سلاسل نہ کرو تم",
      "ذہنوں میں بس اندیشۂ انجام لگا دو",
      "",
      "جب آ ہی گئے برسرِ بازار تو کیا شرم",
      "اوروں کی طرح تم بھی مرے دام لگا دو",
      "",
      "جل اٹھے تو جل جائے گا یہ پردۂ شب تار",
      "پابندی چراغوں پہ سر ِ شام لگا دو",
      "",
      "غیرت ہی نہیں باقی تو بیکار ہیں ہتھیار",
      "مل جائیں خریدار تو نیلام لگا دو",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "عجیب قاعدے ہجرت! تری کتاب میں ہیں",
      "خسارے دونوں طرف کے مرے حساب میں ہیں",
      "",
      "یہ طے ہوا ہے کہ اب اُس کی ملکیت ہونگے",
      "وہ سب علاقے جو میری حدودِ خواب میں ہیں",
      "",
      "نہ تشنگی میں کمی ہے ، نہ پانیوں کی کمی",
      "عذاب میں ہیں کہ پیاسے کسی سراب میں ہیں",
      "",
      "تجھے ہی رکھتے ہیں قلب و نظر کے آگے امام",
      "جہاں بھی ہوں ترے بندے تری جناب میں ہیں",
      "",
      "اُبھر کے بحرِ کشاکش سے دیکھتے ہیں تجھے",
      "ذرا سی دیر کو ہم گنبدِ حباب میں ہیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "معیار ہے سخن تو حوالہ نہ دیکھیے",
      "شاخِ ہنر کو دیکھیے ، شجرہ نہ دیکھیے",
      "",
      "شاید اسی طرح مجھے پہچان جائیں آپ",
      "لہجے کا رنگ دیکھیے ، چہرہ نہ دیکھیے",
      "",
      "رستے ہیں میرے گھر کے محبت کے راستے",
      "دل کی کتاب کھولئے ، نقشہ نہ دیکھیے",
      "",
      "سینہ ہے داغ داغ مگر دل تو صاف ہے",
      "گھر دیکھیے جناب ، علاقہ نہ دیکھیے",
      "",
      "دیواریں پڑھ رہے ہیں بس اپنی گلی کی آپ",
      "اخبار پورا پڑھئے ، تراشہ نہ دیکھیے",
      "",
      "سائے تو گھٹتے بڑھتے ہیں سورج کیساتھ ساتھ",
      "قامت کو اپنی ناپئے ، سایا نہ دیکھیے",
      "",
      "ہو عزم آہنی تو ہمالہ بھی زیر ہے",
      "رکھیے نظر فراز پہ تیشہ نہ دیکھیے",
      "",
      "دیوار و در کے پردے ہٹا کر کبھی کبھی",
      "جانب خدا کی دیکھیے ، کعبہ نہ دیکھیے",
      "",
      "بجھنے لگی ہیں شہرِ نگاراں کی رونقیں",
      "کچھ کیجئے ظہیؔر ، تماشہ نہ دیکھیے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "نشانِ منزلِ من مجھ میں جلوہ گر ہے تو",
      "مجھے خبر ہی نہیں تھی کہ ہمسفر ہے تو",
      "",
      "سفالِ کوزۂ جاں! دستِ مہر و الفت پر",
      "تجھے گدائی میں رکھوں تو معتبر ہے تو",
      "",
      "علاجِ زخمِ تمنا نے مجھ کو مار دیا",
      "کسی کو کیسے بتاؤں کہ چارہ گر ہے تو",
      "",
      "چراغِ بامِ تماشہ کو بس بجھادے اب",
      "میں جس مقام پہ بیٹھا ہوں باخبر ہے تو",
      "",
      "یہ کس گمان میں لڑتا ہے تو حقیقت سے",
      "یہ کس خیال کے عالم میں گم نظر ہے تو",
      "",
      "ترے قدم سے بندھے ہیں ترے زما ن و مکاں",
      "تجھے مقیم سمجھتا تھا دربدر ہے تو",
      "",
      "ابھی تو قضیۂ نان و نمک نہیں نبٹا",
      "ابھی سے پائے تمنا کدھر کدھر ہے تو",
      "",
      "تری جڑیں کسی مٹی کو ڈھونڈتی ہیں ظہیرؔ",
      "زمینِ زر میں ابھی تک جو بے ثمر ہے تو",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "مت سمجھو کہ ہجرت کے طلسمات میں گم ہیں",
      "ہم لوگ وفاؤں کے تضادات میں گم ہیں",
      "",
      "رستوں میں نہیں سات سمندر کی یہ دوری",
      "یہ سات سمندر تو مری ذات میں گم ہیں",
      "",
      "ہم لے کے کہاں جائیں محبت کا سوال اب",
      "دل والے بھی اپنے ہی مفادات میں گم ہیں",
      "",
      "کشکولِ انا کو بھی چٹختا کوئی دیکھے",
      "سب اہلِ کرم لذتِ خیرات میں گم ہیں",
      "",
      "الفاظ دریچے ہیں جو کھلتے ہیں دلوں میں",
      "معنی مرے سامع کے خیالات میں گم ہیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "بجھتے بجھتے بھی اندھیروں میں کرن چھوڑ گیا",
      "وہ مرا شوخ ستارہ جو گگن چھوڑ گیا",
      "",
      "خواب تو خواب مجھے نیند سے ڈر لگتا ہے",
      "جانے والا مری پلکوں پہ شکن چھوڑ گیا",
      "",
      "کسی زیور کی طرح اُس نے نکھارا مجھ کو",
      "پھر کسی اور کی جھولی میں یہ دَھن چھوڑ گیا",
      "",
      "دے رہا ہے مجھے پسپائی کے طعنے وہ بھی",
      "میری رفتار میں جو اپنی تھکن چھوڑ گیا",
      "",
      "بھول جانے کی قسم لے گیا وہ رشکِ گلاب",
      "یاد رکھنے کو مہک ، رنگ ، چبھن چھوڑ گیا",
      "",
      "نہ کوئی آگ لگائی ، نہ ڈھلا پانی میں",
      "کیسا آنسو تھا کہ آنکھوں میں جلن چھوڑ گیا",
      "",
      "تھک کے بیٹھا تھا مرے پاس برابر میں کوئی",
      "اور مرے کاندھے پہ برسوں کی تھکن چھوڑ گیا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "دل تو پتھر ہوئے ، غم پھر بھی کسک دیتے ہیں",
      "آگ اتنی ہو تو پتھر بھی چمک دیتے ہیں",
      "",
      "خاک گرتی ہے جو سر پر غمِ دنیا کی کبھی",
      "نام لے کر ترا ہولے سے جھٹک دیتے ہیں",
      "",
      "زندگی جب بھی نظر آتی ہے عریاں اپنی",
      "ہم ترے درد کی پوشاک سے ڈھک دیتے ہیں",
      "",
      "یاد کے پھول کتابوں میں دبے رہنے دو",
      "خشک ہوجائیں تو کچھ اور مہک دیتے ہیں",
      "",
      "جو نہ بادل میں رہیں اور نہ زمیں پر برسیں",
      "وہی قطرے تو فضاؤں کو دھنک دیتے ہیں",
      "",
      "جب سے آئی ہیں مری آنکھوں میں نظریں اس کی",
      "گھپ اندھیرے بھی اجالوں کی چمک دیتے ہیں",
      "",
      "مجھ کو چہروں پہ نظر آتی ہے رفتارِ حیات",
      "گھر کے آئینے زمانے کی جھلک دیتے ہیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "حلیفِ ظلمتِ شب تار ہم نہیں ہوں گے",
      "سحر سے برسرِ پیکار ہم نہیں ہوں گے",
      "",
      "یہ خوابِ غفلت ِبیخود ہمیں گوارا ہے",
      "فروغِ جبر میں بیدار ہم نہیں ہوں گے",
      "",
      "ہمیں عزیز ہے حرمت جہادِ منزل کی",
      "شریکِ کاوشِ بیزار ہم نہیں ہوں گے",
      "",
      "کسی حریفِ ستمگر کی پیشوائی میں",
      "شریکِ مجمع ِ اغیار ہم نہیں ہوں گے",
      "",
      "سجاؤ سر پہ کسی کے بھی تاجِ سلطانی",
      "نقیبِ شوکتِ دربار ہم نہیں ہوں گے",
      "",
      "جہاں میں عظمتِ کردار کے ہیں قائل ہم",
      "قتیلِ گرمیِ گفتار ہم نہیں ہوں گے",
      "",
      "بکی ہے گرچہ حمایت ہماری ہر عنوان",
      "رہینِ جبۂ و دستار ہم نہیں ہوں گے",
      "",
      "اگر نہ بن سکے مظلوم کی سِپر نہ سہی",
      "ستم کے ہاتھ میں تلوار ہم نہیں ہوں گے",
      "",
      "اگر ہے قیمتِ گویائی درد کی تشہیر",
      "تو پھر سے تشنۂ اظہار ہم نہیں ہوں گے",
      "",
      "جمالِ خرقۂ درویشی ہے نظر میں ظہیؔر",
      "اسیر ِ طرّۂ خم دار ہم نہیں ہوں گے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "پھر نور ِ محبت لئے خورشید ِ بہاراں",
      "گلشن میں ہمارے بھی کرے عید ِ بہاراں",
      "",
      "ہر بار خزاں لُوٹ کے لے جاتی ہے گلشن",
      "ہم از سر ِ نو کرتے ہیں امید ِ بہاراں",
      "",
      "موسم کی گواہی سنو گلیوں میں نکل کر",
      "ڈھونڈو نہ دریچوں سے اسانید ِ بہاراں",
      "",
      "سب رنگ بسنتی ہیں پتنگوں کے فضا میں",
      "کالی ہے زمیں کرتی ہے تردید ِ بہاراں",
      "",
      "در پر ہے اُگا قفل تو دیوار پہ زنجیر",
      "آغاز مرے گھر سے ہے تمہید ِ بہاراں",
      "",
      "ہوتا ہے مرا درد بہاروں میں مکرّر",
      "حرفِ غم ِ ہجراں پہ ہے تشدید ِ بہاراں",
      "",
      "شبنم نہیں ، تکمیل ِ نمو کی ہیں یہ مہریں",
      "پھولوں کے ورق پر ہیں اسانید ِ بہاراں",
      "",
      "رکھتے ہیں تر و تازہ مرے موسم ِ دل کو",
      "کچھہ خوشبو صفت لوگ ، صنادید ِ بہاراں",
      "",
      "شعروں کے نئے پھول سجانے ہیں غزل میں",
      "کرنی ہے سخن زار میں تجدید ِ بہاراں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "پہاڑ ، دشت ، سمندر ٹھکانے دریا کے",
      "زمیں کو رنگ ملے ہیں بہانے دریا کے",
      "",
      "کبھی سمندروں گہرا ، تو ہے کبھی پایاب",
      "بدلتے رہتے ہیں اکثر زمانے دریا کے",
      "",
      "سفینہ سب کا سمندر کی سمت میں ہے رواں",
      "مگر لبوں پہ مسلسل ترانے دریا کے",
      "",
      "نہیں چٹان کے سینے پہ یوں ہی چادرِ آب",
      "ہیں آبشار کے پیچھے خزانے دریا کے",
      "",
      "بھنور کی آنکھ میں آنکھیں یہ ہم نے کیا ڈالیں",
      "ہمی پہ جم گئے سارے نشانے دریا کے",
      "",
      "ہمی کو رہنا ہے تشنہ کنارِ دریا پر",
      "تمام جشن بھی ہم کو منانے دریا کے",
      "",
      "لہو بہے کہ سیاہی فرات و دجلہ میں",
      "مرے زوال کے قصے ، فسانے دریا کے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "زندگی دشتِ انا ہے یہاں کس کا سایا",
      "اپنے سائے کے علاوہ نہیں ملتا سایا",
      "",
      "دور جائیں جوشجر سے تو جھلس جانے کا ڈر",
      "چھاؤں میں بیٹھیں تو اپنا نہیں بنتا سایا",
      "",
      "بڑھ گئی میری تھکن اور بھی اے شہر ِ امان",
      "آزما کر تری دیوار کا دیکھا سایا",
      "",
      "اُس کے آنچل کی دھنک کو تو ذرا کُھلنے دو",
      "جلتا سورج بھی پکارے گا کہ سایا سایا",
      "",
      "ایک دیوارِ عداوت تھی کہ گرتے گرتے",
      "شہر میں چھوڑ گئی خوف کا گہرا سایا",
      "",
      "جب بھی کاندھے پہ اٹھاتا ہوں میں بچوں کو ظہیؔر",
      "میری قامت سے بڑھ جاتا ہے میرا سایا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "مشعلِ حرف لئے نور بکف ہو جائیں",
      "کاش ہم اپنے زمانے کا شرف ہو جائیں",
      "",
      "عقل کہتی ہے چلو ساتھ زمانے کے چلیں",
      "ظرف کہتا ہے کہ ہم ایک طرف ہو جائیں",
      "",
      "دل یہ کہتا ہے ترا نام اُتاریں دل میں",
      "اور کسی گہرے سمندر میں صدف ہو جائیں",
      "",
      "حیف وہ جنگ کہ دونوں ہی طرف ہوں اپنے",
      "ہائے وہ لوگ جو خود اپنا ہدف ہو جائیں",
      "",
      "معرکہ کوئی بھی مشکل تو نہیں ، اہلِ حرم",
      "توڑ کر دائرے گر شاملِ صف ہو جائیں",
      "",
      "ڈر رہا ہوں کہ یہ اوراقِ شب و روز مرے",
      "یوں نہ ہو عہدِ ضرورت میں تلف ہو جائیں",
      "",
      "کون زحمت کرے پھر شمعیں جلانے کی ظہیرؔ",
      "جب سیہ رات کے شکوے ہی شغف ہو جائیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "نہ سیم و زر نہ گہر بیچ کر ادا ہوگا",
      "وفا کا قرض ہے ، سر بیچ کر ادا ہوگا",
      "",
      "زمیں کا قرض ہے جتنا مری اڑانوں پر",
      "غرورِ بازو و پر بیچ کر ادا ہوگا",
      "",
      "چکانے نکلے ہیں ہم کاسۂ گدائی لئے",
      "جو قرض کاسۂ سر بیچ کر ادا ہوگا",
      "",
      "لبوں سے حرفِ محبت بہ لہجۂ تسلیم",
      "متاعِ قلب و جگر بیچ کر ادا ہوگا",
      "",
      "ہے یرغمالِ ضرورت جو دل تو پھر تاوان",
      "انا کو بارِ دگر بیچ کر ادا ہوگا",
      "",
      "محبتوں کے سفر میں ظہیؔر حقِ سفر",
      "تمام زادِ سفر بیچ کر ادا ہوگا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "لب پہ شکوہ بھی نہیں ، آنکھ میں آنسو بھی نہیں",
      "مجھ سے دل کھول کے لگتا ہے ملا تو بھی نہیں",
      "",
      "اُن کی آنکھوں کے ستارے تو بہت دور کی بات",
      "ہم وہاں ہیں کہ جہاں یاد کے جگنو بھی نہیں",
      "",
      "جب سے گردن میں نہیں ہے کوئی بانہوں کی کمان",
      "میرے سینے میں کوئی تیر ترازو بھی نہیں",
      "",
      "یا تو ماضی کی مہک ہے یا کشش مٹی کی",
      "ورنہ اُن گلیوں میں ایسا کوئی جادو بھی نہیں",
      "",
      "رات کی بات تھی شاید وہ نشہ اور جادو",
      "دن چڑھے رات کی رانی میں وہ خوشبو بھی نہیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اک بات کہہ رہا ہوں لہجے بدل بدل کے",
      "اک شعر ہو رہا ہے مصرعے بدل بدل کے",
      "",
      "پُرپیچ راستہ ہے ، سامان ہلکا رکھنا",
      "تھک جاؤ گے وگرنہ کاندھے بدل بدل کے",
      "",
      "تاریکیوں سے گذرا میں روشنی کی خاطر",
      "پہنچا تری ڈگر پر رستے بدل بدل کے",
      "",
      "تعبیر کیا ملے گی اُن کو بھلا سحر سے",
      "گزری ہے رات جن کی سپنے بدل بدل کے",
      "",
      "آئینۂ طلسم ِ ایوان ِ اختیارات!",
      "اک شخص دیکھتا ہے چہرے بدل بدل کے",
      "",
      "تاریخ بھی ہماری لکھی ظہیؔر اُسی نے",
      "لوگوں کو جس نے بانٹا نقشے بدل بدل کے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "لوگ مصروفِ خدائی ہیں خدا کے گھر میں",
      "بندہ توبہ کرے مسجد سے اب آکے گھر میں",
      "",
      "پُل بنانے میں تھے مصروف ، یہ معلوم نہ تھا",
      "دریا آ جائے گا دیواریں گرا کے گھر میں",
      "",
      "اتنا گھبرا ئے گھٹن سے کہ ہم ایسے محتاط",
      "آگئے لے کے دیا اپنا ہوا کے گھر میں",
      "",
      "کھوٹا سکہ تو نہیں ہوتی محبت لوگو!",
      "آزماؤ اِسے ، رکھو نہ چھپا کے گھر میں",
      "",
      "میں نکلتا ہوں غم ِ دنیا پہن کر ہر صبح",
      "نوچ دیتا ہوں اسے شام کو جا کے گھر میں",
      "",
      "آپ کے در سے کہیں اُٹھ کے نہ جاؤں مولا",
      "کیجئے مجھ سے سلوک ایسا بُلا کے گھر میں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اِس کی بنیاد میں پتھر ہے پرانے گھر کا",
      "قرض کتنا نئے گھر پر ہے پرانے گھر کا",
      "",
      "چین سے سوتا ہوں یادوں کا بنا کر تکیہ",
      "راس اب تک مجھے بستر ہے پرانے گھر کا",
      "",
      "دوستو میں تو نہیں بدلا ہوں ، گھر بدلا ہے",
      "نئی چوکھٹ میں کُھلا در ہے پرانے گھر کا",
      "",
      "نئی بستی کا کبھی نقطۂ آغاز تھا یہ",
      "شہر کے بیچ جو منظر ہے پرانے گھر کا",
      "",
      "اِس نئے شہر کے موسم سے بہت ڈرتا ہے",
      "آدمی جو مرے اندر ہے پرانے گھر کا",
      "",
      "ویسے تو خوش نظر آتا ہے نئے گھر میں ظہیؔر",
      "تذکرہ باتوں میں اکثر ہے پرانے گھر کا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "سارا سفر ہے ضبطِ مسلسل کی قید میں",
      "چھوٹی سی جیسے کشتی ہو بوتل کی قید میں",
      "",
      "اپنے بدن کی آگ میں جل کر مہک اٹھی",
      "خوشبو جو بیقرار تھی صندل کی قید میں",
      "",
      "اے فصل ِ تشنہ کام! نویدِ رہائی دے",
      "پانی کو دیکھ کب سے ہے بادل کی قید میں",
      "",
      "گہرائی اُس کے ضبطِ الم کی بھی دیکھیے",
      "ساگر رکھے ہوئے ہے جو کاجل کی قید میں",
      "",
      "آوارہ اک ورق تھا ، مجھے دے دیا ثبات",
      "اُس نے گرہ سے باندھ کے آنچل کی قید میں",
      "",
      "بچپن کے آنگنوں سے بچھڑنے کا دُ کھ ظہیؔر",
      "آسیب بن کے رہتا ہے پیپل کی قید میں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اپنے پندار کا در توڑ دیا میں نے بھی",
      "بے لباس اپنا بدن دیکھ لیا میں نے بھی",
      "",
      "بے حسی کا کوئی مشروب تھا سب ہاتھوں میں",
      "زہر سمجھو کہ دوا پی ہی لیا میں نے بھی",
      "",
      "آدمی تھا میں فرشتہ تو نہیں تھا آخر",
      "جس طرح جیتے ہیں دنیا میں جیا میں نے بھی",
      "",
      "کرتے جاتے تھے سبھی کشتِ تمنا سیراب",
      "اپنی خواہش کو لہو دے ہی دیا میں نے بھی",
      "",
      "بیٹھ کر سوزنِ تدبیر سے اوروں کی طرح",
      "اپنا پیراہنِ صد چاک سیا میں نے بھی",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "عاشقی کارِ جنوں اور بھی دے گی آگے",
      "بات اب دار و رسن سے بھی بڑھے گی آگے",
      "",
      "کچھ خریدا جو نہیں فکر کے بازار سے آج",
      "قیمت اس کی بھی ادا کرنی پڑے گی آگے",
      "",
      "آج بھی چپ رہے لوگو تو ستائے گا سفر",
      "بازگشت ان کہے لفظوں کی ملے گی آگے",
      "",
      "کہتے کہتے جو اگر رک بھی گئے ہم ، کیا غم!",
      "داستاں ایسی ہے خود خلق کہے گی آگے",
      "",
      "خود بخود ہوتے چلے جائیں گے رستے روشن",
      "مشعلِ نام محمدؐ جو رہے گی آگے",
      "",
      "تازہ لہجے میں وہ گم گشتہ پرانے الفاظ",
      "یہ روایت بھی غزل سے ہی چلے گی آگے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "شعاعِ نورِ حرم ہے نئے چراغوں میں",
      "خدا کا عکسِ کرم ہے نئے چراغوں میں",
      "",
      "یہ سلسلہ ہے وہی لو سے لو جلانے کا",
      "بجھے ہوؤں کا جنم ہے نئے چراغوں میں",
      "",
      "کمی جو اِن کے اُجالے میں ہے ، ہماری ہے",
      "لہو ہمارا بہم ہے نئے چراغوں میں",
      "",
      "بجائے طاقِ شبستاں جلے ہیں رستوں پر",
      "اندھیری راہ کا غم ہے نئے چراغوں میں",
      "",
      "مآلِ ہستیِ یک شب سے ہو گئے واقف",
      "ہوا کا خوف عدم ہے نئے چراغوں میں",
      "",
      "لکھے ہیں شب زدہ آنکھوں میں جتنے اندیشے",
      "جواب اُن کا رقم ہے نئے چراغوں میں",
      "",
      "طلوع ِ صبح ِ منوّر کا ایک زندہ یقین",
      "زوالِ شب کی قسم! ہے نئے چراغوں میں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "مانا کہ عرضِ حال کے قائل نہیں تھے ہم",
      "سمجھے نہ کوئی ایسی بھی مشکل نہیں تھے ہم",
      "",
      "کچھ ہوگئیں خطائیں تو معذور جانئے",
      "انسان ہی تھے جوہرِ کامل نہیں تھے ہم",
      "",
      "اپنے ہی شہر میں ہمیں مہماں بنادیا",
      "اتنی مدارتوں کے تو قابل نہیں تھے ہم",
      "",
      "طوفاں ملے جو ہم سے تو شکوہ نہ کیجئے",
      "اک بحرِ اضطراب تھے ساحل نہیں تھے ہم",
      "",
      "مٹ جاتے ایک موجِ گریزاں کے زور سے",
      "نقشِ قدم تو برسرِ ساحل نہیں تھے ہم",
      "",
      "ہم اُٹھ گئے تو ہوگئی برہم بساط کیوں؟",
      "اک ہم نشیں تھے رونق ِ محفل نہیں تھے ہم",
      "",
      "ہم کھوگئے تو رُک گئے کیوں اہلِ کارواں؟",
      "اک ہمسفر تھے جادۂ منزل نہیں تھے ہم",
      "",
      "ہر موڑ پر ٹھہر کے کریں راستے کی جانچ",
      "اس درجہ احتیاط کے قائل نہیں تھے ہم",
      "",
      "غفلت جو تھی اگر تو بس اپنے ہی حال سے",
      "حالت سے دوستوں کی تو غافل نہیں تھے ہم",
      "",
      "خوابوں کی آبرو بھی پسِ پشت ڈال دیں",
      "اتنے بھی زیرِ بارِ مسائل نہیں تھے ہم",
      "",
      "گزری تو خیر جیسی بھی لیکن لگا ہمیں",
      "اُس انتظارِ زیست کا حاصل نہیں تھے ہم",
      "",
      "شکوہ نہیں ہے بابِ اثر سے ہمیں ظہیرؔ",
      "اپنی دعائے خیر میں شامل نہیں تھے ہم",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "جب سے سر پر چادرِ ظلمات گہری ہوگئی",
      "نقش دل پر تلخیِ حالات گہری ہو گئی",
      "",
      "کیسے اندازہ لگاتا اپنی گہرائی کا میں",
      "اپنی تہہ تک جب بھی پہنچا ذات گہری ہو گئی",
      "",
      "زندگی نے ہونٹ کھولے لفظ سادہ سے کہے",
      "تجربے نے آنکھ کھولی بات گہری ہو گئی",
      "",
      "چاندنی کی آس میں ہم دیر تک بیٹھے رہے",
      "ڈھونڈنے نکلے دیا جب رات گہری ہو گئی",
      "",
      "کیا بتاؤں چشمِ نم کا حال اُس کو دیکھ کر",
      "سائباں جب مل گیا برسات گہری ہو گئی",
      "",
      "میرے بازی جیتنے پر ہو گئے ناراض دوست",
      "دوستانہ کھیل تھا اور مات گہری ہو گئی",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ماں کے دامن کی طرح پھیلا ہے خالی آنگن",
      "گھر کی دہلیز پہ بیٹھا ہے سوالی آنگن",
      "",
      "لمس باقی نہ رہے پھول کھلانے والے",
      "منتظر ہے لئے سوکھی ہوئی ڈالی آنگن",
      "",
      " گھر کے دامن سے تو ملتے ہیں کئی گل ، کئی خار",
      "صرف افسانوں میں ہوتے ہیں مثالی آنگن",
      "",
      " وسعتیں دیتا ہے کتنی مرے چھوٹے گھر کو",
      "دل میں آباد ہے اب تک جو خیالی آنگن",
      "",
      "وہ بلاتا ہے مجھے اُس کا کرم ہے ورنہ",
      "میں کہاں اور کہاں کعبے کا عالی آنگن",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "لَو چراغوں کی بہت کم ہے خدا خیر کرے",
      "بادِ صرصر بڑی برہم ہے خدا خیر کرے",
      "",
      "سرِ تکیہ کوئی ہمدم بھی نہیں آج کی شب",
      "آج تو درد بھی پیہم ہے خدا خیر کرے",
      "",
      "لذّتِ دردِ نہاں سے نہیں واقف جو ذرا",
      "وہ مرا چارہ گرِ غم ہے خدا خیر کرے",
      "",
      "خوئے لغزش بھی نہیں جاتی مرے رہبر کی",
      "جادۂ راہ بھی پُرخم ہے خدا خیر کرے",
      "",
      "جانے اغیار کی سازش ہے یا اپنوں کا ستم",
      "شہر ِ یاراں کا جو عالَم ہے خدا خیر کرے",
      "",
      "کوئے قاتل کی رہی ہے جو کبھی خاک ظہیؔر",
      "وہ مرے زخم کا مرہم ہے خدا خیر کرے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اس خاک سے جو ربطِ وفا کاٹ رہے ہیں",
      "پرواز کی خواہش میں سزا کاٹ رہے ہیں",
      "",
      "اِس روزِ خوش آثار کی سچائی تو یہ ہے",
      "اک رات سرِ دشتِ بلا کاٹ رہے ہیں",
      "",
      "حبس اتنا ہے سینے میں کہ لگتا ہے مسلسل",
      "ہم سانس کے آرے سے ہوا کاٹ رہے ہیں",
      "",
      "بیکار کہاں بیٹھے ہیں مصروف ہیں ہم لوگ",
      "ہم اپنی صداؤں کا گلا کاٹ رہے ہیں",
      "",
      "خیاطِ قلم بر سر ِ بازارِ صحافت",
      "پوشاک کو قامت سے بڑا کاٹ رہے ہیں",
      "",
      "ہر روز بدل دیتے ہیں دیوار پہ تحریر",
      "خود اپنے ہی ہاتھوں کا لکھا کاٹ رہے ہیں",
      "",
      "ٹکراتے ہیں موجوں کی طرح سنگِ ستم سے",
      "ہر روز چٹانوں کو ذرا کاٹ رہے ہیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ہواؤں کی زد پر دیا زندگی کا!",
      "وتیرہ یہ ہم نے رکھا زندگی کا",
      "",
      "عدم سے ملا ہے سرا زندگی کا",
      "مکمل ہوا دائرہ زندگی کا",
      "",
      "ستم بھی دکھائے سبھی تیرے غم نے",
      "سلیقہ بھی مجھ کو دیا زندگی کا",
      "",
      "خبر کوئی کردے دلِ بے خبر کو",
      "قضا پوچھتی ہے پتہ زندگی کا",
      "",
      "اُنہیں بے دم آخر کیا زندگی نے",
      "جو دم بھر رہے تھے بڑا زندگی کا",
      "",
      "وجود آدمی ہے، تو ہے زندگی عکس!",
      "کرے آدمی کیوں گلہ زندگی کا",
      "",
      "بھرے پھول جتنے ظہیؔر اُس قدر ہی",
      "یہ دامن کشادہ ہوا زندگی کا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "مری ہمنوائی میں جب تلک مرے یارِ عربدہ جُو نہ تھے",
      "پسِ پردہ سب تھے حریفِ جاں ،کبھی روبرو تو عدو نہ تھے",
      "",
      "گو خبر تھی اہلِ نظر کو سب ، پہ بھرم تھا پھر بھی جہان میں",
      "تہی دامنی کے یہ تذکرے کبھی زیبِ قریہ و کُو نہ تھے",
      "",
      "مرے دوستوں کے وہ مشورے ، صفِ دشمناں کے یہ فیصلے",
      "تھے اگرچہ دونوں الگ الگ ، کبھی مختلف سرِ مو نہ تھے",
      "",
      "یہ ستم طرازیِ وقت ہے کہ ہماری غفلتِ بے اماں",
      "وہی پاسبانِ حرم ہیں اب جو شریکِ کلمۂ ہُو نہ تھے",
      "",
      "اک ادائے نفرتِ بے محل مرا اعتبار گنوا گئی",
      "مرے ہم پیالہ و ہم نشیں ، مرے تشنگانِ لہو نہ تھے",
      "",
      "تھے ہمیشہ درپئے مال و زر ، پہ اثاثِ دل پہ نظر کریں؟",
      "اربابِ ظلم کے حوصلے تو بلند اتنے کبھو نہ تھے",
      "",
      "وہی ہاتھ جن کو جنون تھا تزئینِ حسنِ بہار کا",
      "وہ قلم ہوئے اِسی جرم میں کہ اسیر ِ رسم ِ غلو نہ تھے",
      "",
      "سبھی ہوگئے کہیں دربدر ، کہیں کھوگئے مرے خوش نظر",
      "میں کہاں سے لاوٴں وہ نقش گر جو بہارِ گل کا نمونہ تھے",
      "",
      "یہ شہیدِ جلوۂ آگہی جنہیں تیرے درد نے چن لیا",
      "وہی کشتگانِ خمار ہیں جو قتیلِ جام و سبو نہ تھے",
      "",
      "جو نبردِ عشق میں کٹ گئے یا حضورِ ناز میں جھک گئے",
      "وہی سربلند رہے سدا جو ظہیرؔ بارِ گلو نہ تھے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "کب تک اِس بھیڑ میں اوروں کے سہارے چلیے",
      "لوگ رستے میں ہوں اتنے تو کنارے چلیے",
      "",
      "اب تو مجبور یا مختار گزارے چلیے",
      "قرض جتنے ہیں محبت کے اتارے چلیے",
      "",
      "جس نے بخشی ہے مسافت وہی منزل دیگا",
      "ہوکے راضی برضا اُس کے اشارے چلیے",
      "",
      "اُن کے لائق نہیں کچھ اشکِ محبت کے سوا",
      "بھر کے دامن میں یہی چاند ستارے چلیے",
      "",
      "معتبر ہوتی نہیں راہ میں گزری ہوئی رات",
      "آ گئی شامِ سفر اپنے دُوارے چلیے",
      "",
      "ہم بھی قائل نہیں رستے کو پلٹ کر دیکھیں",
      "ماضی ڈستا ہے تو پھر ساتھ ہمارے چلیے",
      "",
      "دشتِ ہجراں بھی گزر جائے گا عزّت سے ظہیرؔ",
      "نامِ نامی اُسی رہبر کا پکارے چلیے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "جانے کتنے راز چھپے ہیں ٹھہرے ٹھہرے پانی میں",
      "کون اُتر کر دیکھے اب اس یاد کے گہرے پانی میں",
      "",
      "جل پریوں کی خاموشی تو منظر کا ا یک دھوکا ہے",
      "فریادوں کا شور مچا ہے اندھے بہرے پانی میں",
      "",
      "کوئی سیپ اُگلتی ہے موتی اور نہ موجیں کوئی راز",
      "حرص و ہوا کے ایسے لگے ہیں چار سُو پہرے پانی میں",
      "",
      "جھیل کے نیلے آئینے پر پتھر پھینکنے والو تم!",
      "ساحل پر اب بیٹھ کے دیکھو بگڑے چہرے پانی میں",
      "",
      "چاہا ہم نے جھیل کنارے چاندنی راتوں میں جن کو",
      "کھلتے ہیں بن بن کے کنول وہ پھول سے چہرے پانی میں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "رستوں کا خوف ہے نہ مجھے فاصلوں کا ڈر",
      "اُس کو سفر کا شوق ، مجھے رہبروں کا ڈر",
      "",
      "جب سر پہ دھوپ تھی تو رہی بادلوں کی آس",
      "اب سر پہ چھت ہوئی تو مجھے بارشوں کا ڈر",
      "",
      "اک شخص جاتے جاتے بہت خامشی کے ساتھ",
      "کانوں پہ رکھ گیا ہے دبی آہٹوں کا ڈر",
      "",
      "محتاط چل رہا ہوں کہ چاروں طرف مرے",
      "شیشہ مزاج لوگ ہیں اور کرچیوں کا ڈر",
      "",
      "دیکھے ہیں میری آنکھ نے سورج کے جب سے داغ",
      "دل سے نکل گیا ہے مرے آئنوں کا ڈر",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "نہ ملے تم تو ملا کوئی تمہارے جیسا",
      "فائدہ عشق میں دیکھا ہے خسارے جیسا",
      "",
      "موج اڑاتی ہوئی مخمور سمندر آنکھیں",
      "ڈھونڈتی رہ گئیں اک شخص کنارے جیسا",
      "",
      "عشق حیراں ہے ابھی پہلی نظر کے مانند",
      "حسن ابھی تک ہے وہ خاموش نظارے جیسا",
      "",
      "اک دھنک میرے تصور کو بنا رکھتا ہے",
      "اُن لبوں پر جو تبسم ہے اشارے جیسا",
      "",
      "وہ کہیں میرا تشخص نہ کچل کر رکھدے",
      "مہرباں ہاتھ جو لگتا ہے سہارے جیسا",
      "",
      "دیکھیے کیسے گزرتی ہے شب ِ تنہائی",
      "سوزِ دل آج بھڑکتا ہے شرارے جیسا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "کسی کو روک لیں ہم ، ایسے کم نگاہ نہیں",
      "مسافرانِ محبت ہیں سنگِ راہ نہیں",
      "",
      "ستم تو یہ ہے کہ دنیا تمہارے زیرِ ستم",
      "تمہارے ظلم کا پھر بھی کوئی گواہ نہیں",
      "",
      "کھلا ہے کون سا رستہ سپاہِ جبر سے آج",
      "بچا ہے کون سا قریہ جو رزم گاہ نہیں؟",
      "",
      "متاع ِ ہستی کہاں رکھیے اب بجز مقتل",
      "کسی طرف بھی کوئی گوشہٴ پناہ نہیں",
      "",
      "حلیف بیچ گئے مجھ کو اپنی جاں کے عوض",
      "مرے بچاوٴ کی اب تو کوئی بھی راہ نہیں",
      "",
      "کھلے ہیں چند شگوفے مثالِ دستِ دعا",
      "یہ دشتِ بے ثمر اتنا بھی بے گیاہ نہیں",
      "",
      "غبارِ کشتہٴ مظلوم عرش چُھولے گا",
      "نصیبِ فرش نہ ہوگا ، یہ گردِ راہ نہیں",
      "",
      "اگر ظہیؔر ہو شانے پر اپنے دستِ حبیب",
      "عدو سے ہاتھ ملانا کوئی گناہ نہیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "مٹی سے پیار کر تو نکھر آئے گی زمین",
      "دامن میں بھر کے اپنے ثمر آئے گی زمین",
      "",
      "نیچے اتر خلاؤں سے لوگوں کے دکھ سمیٹ",
      "شمس و قمرسے بڑھ کے نظر آئے گی زمین",
      "",
      "کشتی کے آسرے کو ڈبو کر تو دیکھ تُو",
      "پانی کے درمیان اُبھر آئے گی زمین",
      "",
      "بٹ جائیں گی محبتیں لوگوں کے ساتھ ساتھ",
      "روٹی کے مسئلے میں اگر آئے گی زمین",
      "",
      "طوفان بُن رہے ہیں جدھر بجلیوں کے جال",
      "کہتا ہے ناخدا کہ اُدھر آئے گی زمین",
      "",
      "رشک ِ قمر بنے گی یہ اک روز دیکھنا",
      "جب اپنی گردشوں سے گذر آئے گی زمین",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ہر گام اُس طرف سے اشارہ سفر کا تھا",
      "منزل سے دلفریب نظارہ سفر کا تھا",
      "",
      "جب تک امید ِ منزل ِ جاناں تھی ہمقدم",
      "دل کو ہر اک فریب گوارا سفر کا تھا",
      "",
      "رہبر نہیں نصیب میں شاید مرے لئے",
      "جو ٹوٹ کر گرا ہے ، ستارہ سفر کا تھا",
      "",
      "رُکنے پہ کر رہا تھا وہ اصرار تو بہت",
      "مجبوریوں میں اُس کی اشارہ سفر کا تھا",
      "",
      "آتی تھی اُس کے پاؤں سے زنجیر کی صدا",
      "سامان گرچہ کاندھوں پہ سارا سفر کا تھا",
      "",
      "نکلا تلاش ِ ذات کا ساحل بھی نامراد",
      "دریا کے اُس طرف بھی کنارہ سفر کا تھا",
      "",
      "رستہ کٹا تو ساتھی یہ کہہ کر الگ ہوئے",
      "منزل بخیر! ساتھ ہمارا سفر کا تھا",
      "",
      "لوٹا تو پھر ملی مجھے تحفے میں اک کتاب",
      "دیکھا تو ایک تازہ شمارہ سفر کا تھا",
      "",
      "بستی میں ہم ٹھہر کے تو بے آسرا ہوئے",
      "خانہ بدوش تھے تو سہارا سفر کا تھا",
      "",
      "راہیں الگ ہوئیں تو یہ مجھ پر کھُلا ظہیؔر",
      "وہ ہمسفر نہیں تھا ، خسارہ سفر کا تھا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "نظریں چُرائیے ، نہ ندامت اٹھائیے",
      "جتنے بچے ہیں سنگ ِ ملامت ، اٹھائیے",
      "",
      "مصلوب کیجئے ہمیں ناکردہ جرم پر",
      "معصوم پھر بنا کے سلامت اٹھائیے",
      "",
      "یہ ٹیڑھے ترچھے وار ہیں توہین ِ عاشقی",
      "تیغ ِ ستم کو برسر ِ قامت اٹھائیے",
      "",
      "اِس تہمتِ جفا سے بھی آگے ہیں مرحلے",
      "اتنی سی بات پر نہ قیامت اٹھائیے",
      "",
      "تکلیف دیجئے نہ کسی غمگسار کو",
      "احسانِ چارہ گر بھی ذرا مت اٹھائیے",
      "",
      "مرتا ہے شہر مہر و محبت کے قحط سے",
      "خاصان ِ خلق دست ِ کرامت اٹھائیے",
      "",
      "نادم کھڑے ہیں سارے گنہگار منتظر",
      "بڑھ کر ظہیؔر بار ِ امامت اٹھائیے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ورثۂ درد ہے تنہائی چھپالی جائے",
      "اپنے حصے کی یہ جاگیر سنبھالی جائے",
      "",
      "کون دیکھے گا تبسم کی نمائش سے پرے",
      "ٹوٹی دیوار پہ تصویر لگالی جائے",
      "",
      "چہرے پڑھنا بھی اُسے آ ہی گیا ہو شاید",
      "غم زدہ چہرے پہ مسکان سجالی جائے",
      "",
      "اختلافات نہ بن جائیں تماشہ اے دوست",
      "بیچ میں اب کوئی دیوار اٹھالی جائے",
      "",
      "اپنی رفتار سے اب آوٴ گزاریں دن رات",
      "وقت کے ہاتھ سے زنجیر چھڑالی جائے",
      "",
      "آنکھ بھر آئے کسی کی ، نہ دُکھے دل کوئی",
      "ایسی تقریبِ ملاقات نکالی جائے",
      "",
      "نہ ہی ادراکِ انا جس کو ، نہ پاسِ اقدار",
      "اُس مسیحا سے بھلا کیسے دوا لی جائے",
      "",
      "کیا سنائیں تمہیں ہم شہر ِ یقیں کے حالات",
      "لوگ کہتے ہیں کہ امید اٹھالی جائے",
      "",
      "ورنہ شمشیر بچے گی نہ بچیں گے بازو",
      "وار کرنا ہے تو پھر وار نہ خالی جائے",
      "",
      "جان کیا چیز ہے بن آئے جب عزّت پہ ظہیؔر",
      "سر بچے یا گرے ، دستار بچالی جائے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اُن لبوں تک اگر گیا ہوگا",
      "شعر میرا نکھر گیا ہوگا",
      "",
      "ترکِ الفت نہیں تھی خو اُس کی",
      "میری حالت سے ڈر گیا ہوگا",
      "",
      "اعتبار اُس کے دل سے دنیا کا",
      "جانے کس بات پر گیا ہوگا؟",
      "",
      "زہر پینے سے کون مرتا ہے",
      "کوئی غم کام کر گیا ہوگا",
      "",
      "پاؤں اٹھتے نہیں دوانے کے",
      "کوئی زنجیر کر گیا ہوگا",
      "",
      "برگ جھڑتے ہیں آنسوؤں کی طرح",
      "موسمِ گل گزر گیا ہوگا",
      "",
      "کتنا نکلا ہے سخت جاں یہ ضمیر",
      "ہم تو سمجھے تھے مر گیا ہوگا",
      "",
      "ناؤ ڈوبے مری زمانہ ہوا",
      "اب تو دریا اُتر گیا ہوگا",
      "",
      "تذکرہ میرا اُس کی محفل میں",
      "سب کو خاموش کر گیا ہوگا",
      "",
      "بازی ہارا ہے کب عدو سے ظہیرؔ",
      "کچھ سمجھ کر ہی ہَر گیا ہوگا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اپنے سر تیرے تغافل کا بھی الزام لیا ہے",
      "خود فریبی کا ستم دل پہ کئی بار کیا ہے",
      "",
      "دل نے اس طرح مداوائے غمِ عشق کیا ہے",
      "اک نیا زہر ترے ہاتھ سے ہر روز پیا ہے",
      "",
      "غم ترا مجھ کو جلاتا نہیں کرتا ہے منوّر",
      "ہاتھ پر آگ نہیں یہ تو ہتھیلی پہ دیا ہے",
      "",
      "عشق سچّا ہو تو کرتا ہے ہر اک قید سے آزاد",
      "رشتہ جھوٹا ہے کہ جس نے تجھے زنجیر کیا ہے",
      "",
      "گفتگو تلخ تھی اے چارہ گرو! مان لیا یہ",
      "لب مرے زخم نہیں تھے کہ جنہیں تم نے سیا ہے",
      "",
      "زندگی تجھ کو شب و روز یوں سینے سے لگا کر",
      "کوئی جی کر تو دکھائے میں نے جس طور جیا ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "بجھتا دیا جو صبح کے آثار میں سے تھا",
      "جب بجھ گیا تو ورثۂ بیکار میں سے تھا",
      "",
      "آساں ہوئی ہیں منزلیں ، اچھا ہوا لٹا",
      "رختِ سفر کہ جان کے آزار میں سے تھا",
      "",
      "خنجر مرا تھا ہاتھ میں اُس کے ، سپر مری",
      "نکلا مگر وہ لشکرِ اغیار میں سے تھا",
      "",
      "زنداں لگا مجھے تو یہ دورانِ زندگی",
      "سارا نظارہ روزنِ دیوار میں سے تھا",
      "",
      "نوکِ قلم سے گر کے کہیں کھو گیا ظہیؔر",
      "اک حرف جو خزینۂ اسرار میں سے تھا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "کتنے چراغ جل اٹھے ، کتنے سراغ مل گئے",
      "آنکھیں جنوں کی کیا کھلیں ، اپنے تو ہونٹ سل گئے",
      "",
      "ایسے پلٹ گئی ہوا دل کی کتاب کے ورق",
      "یادوں کے کچھ گلاب جو کھوئے ہوئے تھے مل گئے",
      "",
      "اک چہرے کی شباہتیں نکھریں مری نظر کے ساتھ",
      "شاخ ِ نظر جھکی جدھر کچھ عکس تازہ کھل گئے",
      "",
      "اپنی تو خیر راہ میں تھیں کرچیاں ہی کرچیاں",
      "پھولوں پہ چل رہے تھے جو اُن کے بھی پاؤں چھل گئے",
      "",
      "دیکھا نہیں کہ مصلحت کے ہیں تقاضے کس طرف",
      "دل سے بلایا جس نے جب ہم تو بہ جان و دل گئے",
      "",
      "اُن کی نظر سے کیا گرے اک زلزلہ سا اٹھ گیا",
      "پندار کے پہاڑ بھی اپنی جگہ سے ہل گئے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ضربِ تیشہ سے یوں اعجاز کی صورت جاگے",
      "سینۂ سنگ سے اک موم کی مورت جاگے",
      "",
      "ٹوٹ جائے مرے مولا یہ جمودِ شب ِ تار",
      "کوکبِ بخت چمک جائے مہورت جاگے",
      "",
      "کاش پڑ جائے مرے غم پہ ہُما کا سایا",
      "شعلۂ درد سے عنقا کسی صورت جاگے",
      "",
      "خواہش ِ حرف ِ ستائش کو تھپک دو ورنہ",
      "بن کے اکثر یہ نمائش کی ضرورت جاگے",
      "",
      "بے غرض ہو جو تعلّق تو کبھی دل میں ظہیؔر",
      "نفرتیں شور مچائیں نہ کدُورت جاگے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "سنگِ ستم سے کوئی بھی شیشہ نہیں بچا",
      "محفوظ وہ رہا جو دریچہ نہیں بچا",
      "",
      "بازیگرانِ شہرِ سیاست ہوئے خموش",
      "اب دیکھنے کو کوئی تماشہ نہیں بچا",
      "",
      "کیسی چڑھی ہے دھوپ سرِ شہر ِ بد لحاظ",
      "برگد ہرے بھرے ہوئے سایا نہیں بچا",
      "",
      "پھیلاؤ کی ہوس بھرے دریا کو پی گئی",
      "پانی چڑھا تو کوئی کنارہ نہیں بچا",
      "",
      "بجھنے لگے چراغ مرے جسم و جان میں",
      "دل میں لہو بقدرِ تمنا نہیں بچا",
      "",
      "اک نقشِ لالہ رنگ تو رستے کو مل گیا",
      "بیشک ہمارے پاؤں میں جوتا نہیں بچا",
      "",
      "لگتا ہے یوں یا واقعی قحط الرجال ہے",
      "لوگوں کے درمیان حوالہ نہیں بچا",
      "",
      "اہلِ ہوس کی حاشیہ آرائی سے ظہیؔر",
      "تاریخ درکنار صحیفہ نہیں بچا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ایک منظر پسِ منظر بھی دکھایا جائے",
      "لوح ِ سادہ کو پلٹ کر بھی دکھایا جائے",
      "",
      "ناتواں ہاتھ میں مجبور سے پتھر کے خلاف",
      "ظلم کا آہنی لشکر بھی دکھایا جائے",
      "",
      "سرنگوں مجھ کو دکھاتے ہو بتقریبِ شکست",
      "پھر مری پشت میں خنجر بھی دکھایا جائے",
      "",
      "جس کے ساحل پہ ہوئے پیاس کے مارے باغی",
      "منصفوں کو وہ سمندر بھی دکھایا جائے",
      "",
      "وہ جو رکھے گئے مصروفِ تماشائے نشاط",
      "ان کو محرومی کا منظر بھی دکھایا جائے",
      "",
      "سوزن ِ دستِ رفوگر کی نمائش دیکھی",
      "اب اُس استین کا خنجر بھی دکھایا جائے",
      "",
      "پس ِ کردار جو چہرے تھے ڈرامے میں ظہیؔر",
      "اُن کو بہروپ ہٹا کر بھی دکھایا جائے",
      "",
      "(سانحۂ گیارہ ستمبر کے بعد میڈیا کے کردار پر)",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "آنکھوں میں اب یقین کی جنت نہیں رہی",
      "لہجے میں اعتماد کی شدت نہیں رہی",
      "",
      "آشوبِ دہر ایسا کہ دنیا تو برطرف",
      "خود پر بھی اعتبار کی ہمت نہیں رہی",
      "۔ق۔",
      "کس کس گلی نہ لے گئی آشفتگی ہمیں",
      "کس کس نگر میں درد کی شہرت نہیں رہی",
      "",
      "ویران اب بھی رہتا ہے عالم خیال کا",
      "تنہائیوں میں پہلی سی وحشت نہیں رہی",
      "",
      "ہر شام اب بھی اٹھتی ہے سینے میں ہُوک سی",
      "بیکار گھومنے کی وہ عادت نہیں رہی",
      "",
      "ہر شام اب بھی جمتی ہیں لوگوں کی بیٹھکیں",
      "یارانِ خوش خیال کی صحبت نہیں رہی",
      "",
      "آنے لگے ہیں راس ہمیں ہجر کے عذاب",
      "نظروں میں اب وصال کی جنت نہیں رہی",
      "",
      "اب ہوگئے ہیں خود کسی آنگن کا سایہ ہم",
      "سائے میں بیٹھنے کی وہ فرصت نہیں رہی",
      "",
      "رونق گلی کی لے گیا آسیبِ روزگار",
      "وہ مطمئن مزاج سی خلقت نہیں رہی",
      "",
      "ڈرتے تھے کس طرح سے کریں گے وضاحتیں",
      "وہ مل کے رودیئے تو یہ دِقت نہیں رہی",
      "",
      "کس کس کا دل ٹٹول کے دیکھیں ظہیؔر اب",
      "خود کو تلاش کرنے کی مہلت نہیں رہی",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "بات جو دل میں نہیں لب سے ادا کیسے کروں",
      "میں خفا تو ہو گیا اُن سے ، گلہ کیسے کروں",
      "",
      "دل کے ٹوٹے آئنے میں عکس ہے اک خواب کا",
      "قیدِ رنگ و روپ سے اُس کو رہا کیسے کروں",
      "",
      "سوچتا ہوں اک ہجومِ صد بلا کے درمیاں",
      "عافیت کے خواب کو میں واقعہ کیسے کروں",
      "",
      "روز و شب کے گنبدِ بے دَر سے مشکل ہے فرار",
      "دَر اگر مل جائے بھی تو حوصلہ کیسے کروں",
      "",
      "راہ کوئی روح کے اندر کُھلے تو بات ہے",
      "میں کسی کے نقشِ پا کو رہنما کیسے کروں",
      "",
      "ہم نشیں میرے ابھی تک ہیں خیالِ فرد فرد",
      "ہم نظر میں کر بھی لوں تو ہمنوا کیسے کروں",
      "",
      "زندگی سے وہ گیا اور زندگی جاتی رہی",
      "مختصر سے حرفِ غم کو مرثیہ کیسے کروں",
      "",
      "ہر گھڑی دل پر مرے دستک نئی خواہش کی ہے",
      "اسقدر جب شور ہو ، تجھ کو صدا کیسے کروں",
      "",
      "شرم آتی ہے مجھے حاجت روا کے سامنے",
      "خواہشوں کی فکر کو حرفِ دعا کیسے کروں",
      "",
      "دور کچھ بھی تو نہیں وہ ، ہے مری مشکل یہی",
      "دو قدم کا فاصلہ ہے ابتدا کیسے کروں",
      "",
      "کس طرح اتنی محبت اب نبھاؤں میں ظہیؔر",
      "اتنا قرضِ دوستی آخر ادا کیسے کروں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "بس بہت ہوگئے نیلام ، چلو لوٹ چلو",
      "اتنے ارزاں نہ کرو دام ، چلو لوٹ چلو",
      "",
      "نہ مداوا ہے کہیں جن کا ، نہ امیدِ قرار",
      "ہر جگہ ہیں وہی آلام ، چلو لوٹ چلو",
      "",
      "معتبر ہوتی نہیں راہ میں گزری ہوئی رات",
      "اس سے پہلے کہ ڈھلے شام ، چلو لوٹ چلو",
      "",
      "ماہِ نخشب سے یہ چہرے ہیں نظر کا دھوکا",
      "چاند اصلی ہے سرِ بام ، چلو لوٹ چلو",
      "",
      "پتے اُڑتے ہیں ہواؤں میں پرندوں کی جگہ",
      "رُت بدلنے کا ہے پیغام ، چلو لوٹ چلو",
      "",
      "اس سے پہلے کہ زمانہ کوئی دیدے عنوان",
      "واقعہ ہے ابھی بے نام ، چلو لوٹ چلو",
      "",
      "اک ہوس کہتی ہے ’’کچھ دور ذرا اور ابھی‘‘",
      "اک صدا آتی ہے ہرگام ’’چلو لوٹ چلو‘‘",
      "",
      "منتظر کوئی نہیں مانا وہاں ، پھر بھی ظہیؔر",
      "کچھ ادھورے ہیں ابھی کام ، چلو لوٹ چلو",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "خواب آنکھوں میں کئے ایسے کسی نے روشن",
      "بحر ِ ظلمت میں رواں جیسے سفینے روشن",
      "",
      "چند لمحے جو ترے نام کے مل جاتے ہیں روز",
      "اُن کے دم سے ہیں مرے سال مہینے روشن",
      "",
      "کسی جلوے کی کرامت ہے یہ چشم ِ بینا",
      "کسی دہلیز کا احسان جبین ِ روشن",
      "",
      "میرے اشکوں میں عقیدت کے جہاں ہیں آباد",
      "آنکھ میں رہتے ہیں کچھ مکّے مدینے روشن",
      "",
      "ہاتھ محنت کے ملیں ، آنکھ محبت کی اگر",
      "تبھی کرتی ہے زمین اپنے خزینے روشن",
      "",
      "یوں تو دنیا نے جلائے کئی پانی پہ چراغ",
      "دیپ کاغذ پہ کئے ایک ہمی نے روشن",
      "",
      "شب کدہ رشکِ چراغاں ہے کہ جس میں ہر سُو",
      "ہوگئے تیری محبت کے قرینے روشن",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "سجا کے شبنمی آنسو گلاب چہرے پر",
      "کہانی لکھ گیا کوئی کتاب چہرے پر",
      "",
      "نظر سے اٹھتا ہے برباد جنتوں کا دھواں",
      "سلگ رہے ہیں ہزاروں عذاب چہرے پر",
      "",
      "نگاہیں ساتھ نہیں دیتیں شوخیِ لب کا",
      "جھلک رہی ہے حقیقت سراب چہرے پر",
      "",
      "کہانیاں پسِ پردہ ہزار ہوتی ہیں",
      "طمانیت کا اگر ہو نقاب چہرے پر",
      "",
      "مرے مزاج کا رد عمل نہیں شکنیں",
      "رقم ہے عمر ِ رواں کا حساب چہرے پر",
      "",
      "ہمیں تو آیا نہ لوگوں سے گفتگو کرنا",
      "سوال دل میں رہے اور جواب چہرے پر",
      "",
      "دلوں میں جھانکنا کردے نہ آپ کو بھی دکھی",
      "نگاہیں رکھیے بس اپنی جناب چہرے پر",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "(برگد جیسے لوگوں کے نام) ",
      "",
      "کوئی بھی رُت ہو چمن چھوڑ کر نہیں جاتے",
      "چلے بھی جائیں پرندے ، شجر نہیں جاتے",
      "",
      "ہوا اُتار بھی ڈالے اگر قبائے بدن",
      "بلند رکھتے ہیں بازو بکھر نہیں جاتے",
      "",
      "گئی رتوں کے سبھی رنگ پہنے رہتے ہیں",
      "شجر پہ رہتے ہیں موسم گزر نہیں جاتے",
      "",
      "خمیر بنتے ہیں مٹی کا ٹوٹ کر بھی شجر",
      "جنم دوبارہ سے لیتے ہیں ، مر نہیں جاتے",
      "",
      "جو برگ و بار سے عاری ہوں ، سائے سے خالی",
      "وہ کٹ کے جلتے ہیں سو بے ثمر نہیں جاتے",
      "",
      "شجر تو ان کے بھی ناموں کو زندہ رکھتے ہیں",
      "وہ بدنصیب جو گھر لوٹ کر نہیں جاتے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "الفاظ کے پردے میں اگر تُو نہیں نکلے",
      "پھر نوک ِ قلم سے کوئی جادو نہیں نکلے",
      "",
      "منصف تو بڑی بات اگر ڈھونڈ نے جاؤ",
      "اِس شہر ِ ستم گر میں ترازو نہیں نکلے",
      "",
      "روئے جو کبھی نیشۂ حالات پہ ہم لوگ",
      "اک زہر ٹپک آیا ہے آنسو نہیں نکلے",
      "",
      "دشمن مرے بیٹھیں جو حلیفوں کے مقابل",
      "اک فرق بھی دونوں میں سر ِ مُو نہیں نکلے",
      "",
      "بے آسرا بیٹھے ر ہے ہم بزم ِ وطن میں",
      "جب تک کہ رہا درد پہ قابو ، نہیں نکلے",
      "",
      "لڑنے کیلئے نکلے ہیں ہم جنگ بقا کی",
      "گھر چھوڑ کے اپنا کوئی بھکشو نہیں نکلے",
      "",
      "اک عمر ہوئی چھوڑے ہوئے دشت ِ غزالاں",
      "پیروں سے پہ خوئے رم ِ آہو نہیں نکلے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "مرے شہر ِ ذرّہ نواز کا وہی سرپھرا سا مزاج ہے",
      "کبھی زیبِ سر ہے غبارِ رہ ، کبھی زیرِ پا کوئی تاج ہے",
      "",
      "کہیں بے طلب سی نوازشیں ، کہیں بے حساب محاسبے",
      "کبھی محسنوں پہ ملامتیں ، کبھی غاصبوں کو خراج ہے",
      "",
      "وہی بے اصول مباحثے ، وہی بے جواز مناقشے",
      "وہی حال زار ہے ہر طرف ، جو روش تھی کل وہی آج ہے",
      "",
      "وہی اہل ِحکم کی سازشیں ، وہی نفرتوں کی سیا ستیں",
      "نہیں بدلا طرزِ منافقت ، وہی مصلحت کا رواج ہے",
      "",
      "کبھی چہرہ پوش ندامتیں ، کبھی سینہ زور بغاوتیں",
      "اک اترتے چڑھتے فشارِ دم کے اثر میں سارا سماج ہے",
      "",
      "کوئی درد ہو کوئی زخم ہو ، وہی میٹھے زہر کی گولیاں",
      "کوئی عارضہ ہو کہ سانحہ ، وہی عارضی سا علاج ہے",
      "",
      "سر ِشہر ِ یاراں گئے تھے ہم کہ چکا کر آئیں گے واجبات",
      "پہ بڑھا کے آگئے قرضِ جاں جو محبتوں کا بیاج ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اِس کے ہر ذرّے سے پیمان دوبارہ کرلو",
      "اپنی مٹی کو مقدر کا ستارہ کرلو",
      "",
      "برف سی جمنے لگی دل پہ نئے موسم کی",
      "ہجر کی آنچ کو بھڑکا کے شرارہ کرلو",
      "",
      "صحن بھر چاندنی کب راہ نوردوں کا نصیب!",
      "آنکھ میں عکسِ قمر بھر کے گزارہ کرلو",
      "",
      "تلخیاں ہیں نئے منظر میں ہماری اپنی",
      "خوش نظر بن کے یہ آئینہ گوارہ کرلو",
      "",
      "ہجرتوں میں تو مرے یار یہی ہوتا ہے",
      "خواب بیچو یا محبت میں خسارہ کرلو",
      "",
      "اب تو دشمن بھی تمہارا ہی سمجھتے ہیں ہمیں",
      "اعتبار اب تو محبت میں ہمارا کرلو",
      "",
      "اس کے سائے میں امانت ہے کئی نسلوں کی",
      "گرتی دیوار کو مضبوط خدارا کرلو",
      "",
      "پار کروا کے مجھے اُس نے کہا دریا پار",
      "ڈوبنے والا ہوں میں مجھ سے کنارہ کرلو",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اپنی تو ہجرتوں کے مقدر عجیب ہیں",
      "اپنے ہی شہر میں ہیں نہ غربت نصیب ہیں",
      "",
      "اب اعتبار کس کا کریں الجھنوں کے بیچ",
      "باتیں ہیں دوستانہ سی لہجے رقیب ہیں",
      "",
      "چارہ گروں کے طرزِ جراحت کا شکریہ!",
      "آزار اب مری رگِ جاں کے قریب ہیں",
      "",
      "مٹی سے تیری دور ہیں لیکن ہیں تجھ سے ہم",
      "ہم بھی تو اے وطن ترے شاعر ادیب ہیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "جس خاک سے بنے تھے ہم اُس خاک پر گرے",
      "شاخِ شجر سے ٹوٹ کے جیسے ثمر گرے",
      "",
      "سونپی ہیں راہِ شوق نے وہ وہ امانتیں",
      "کاندھوں سے رہ نورد کے زادِ سفر گرے",
      "",
      "آیا ہے کس کا نام یہ نوکِ قلم پر آج",
      "کاغذ پر آکے سینکڑوں شمس و قمر گرے",
      "",
      "خاشاک بن گئے ہیں ہواؤں کے ہاتھ میں",
      "اپنی جڑوں سے ٹوٹ کے جتنے شجر گرے",
      "",
      "گھر ٹوٹنے کا سانحہ عریاں سا کر گیا",
      "جامے گرے بدن سے کہ دیوار و در گرے",
      "",
      "پرچم نہیں ہے ، ورثۂ اسلاف ہے ظہیؔر",
      "پرچم گرا تو جانیے پُرکھوں کے سر گرے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "پھر لگا ہے دوستوں کا تازیانہ مختلف",
      "تیر دشمن کی طرف ہیں اور نشانہ مختلف",
      "",
      "بے نیازی برطرف ، اب لازمی ہے احتیاط",
      "وقت پہلا سا نہیں اب ، ہے زمانہ مختلف",
      "",
      "آشیانہ چھوڑنے کی اک سزا یہ بھی ملی",
      "روز لاحق ہے تلاشِ آب و دانہ مختلف",
      "",
      "اک شکم پرور زمیں رکھتی ہے پابستہ مجھے",
      "اور وفائیں مانگتی ہیں اک ٹھکانہ مختلف",
      "",
      "دوسرا رخ بھی وہی نکلا تری تصویر کا",
      "کاش ہوتا کچھ حقیقت سے فسانہ مختلف",
      "",
      "اپنے بچوں کو ظہیؔر انسانیت کا درس دو",
      "نفرتوں کے شہر میں رکھو گھرانہ مختلف",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "مرے  روز  و  شب  کی  کتاب  میں  کبھی  تازہ  برگ ِ  گلاب  تھا",
      "خطِ زرفشاں سے لکھا ہوا مری زندگی کا نصاب تھا",
      "",
      "وہ مثالِ ابر تھا آسرا کڑے موسموں کے دیار میں",
      "وہ تمازتوں کے سوال پر مری تشنگی کا جواب تھا",
      "",
      "جو بغاوتوں کے جواز میں مری سرکشی کا سبب رہا",
      "وہ امین تھا مرے خواب کا ، وہ مرا غرور  ِشباب تھا",
      "",
      "مرے کسب زارِ کمال میں مری جستجو کا ہدف بنا",
      "وہ محبتوں کی معاش میں مری اُجرتوں کا حساب تھا",
      "",
      "وہ رہا شریکِ سکوتِ شب مری حسرتوں میں بجھا ہوا",
      "کبھی لب کشا میں ہوا اگر تو وہ میری روحِ خطاب تھا",
      "",
      "وہ علامتوں کی بہار تھا مری شاعری کی زمین میں",
      "وہ فلک تھا سر پہ خیال کا ، وہ سخن کا لبِ لباب تھا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "منزل کو جانتا تھا ، اشارہ شناس تھا",
      "ٹھہرا نہ وہ کہیں جو نظارہ شناس تھا",
      "",
      "انجام لکھ گیا مرا آغازِ عشق سے",
      "اک شخص کس بلا کا ستارہ شناس تھا",
      "",
      "طوفاں کی سرکشی سے میں لڑتا تھا جن دنوں",
      "واقف ہوا سے تھا نہ کنارہ شناس تھا",
      "",
      "ہوتا نہ بے وفا تو گزرتی بہت ہی خوب",
      "میں خوگرِ زیاں ، وہ خسارہ شناس تھا",
      "",
      "آزارِ مصلحت میں کہیں کھو گیا اے دوست",
      "جو شخص مجھ میں تیرا اشارہ شناس تھا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "لوگوں نے ایک واقعہ گھر گھر بنا دیا",
      "اتنی ذرا سی بات کا دفتر بنا دیا",
      "",
      "پہرے قیامتوں کے لگا کر زبان پر",
      "دل کو ترے خیال نے محشر بنا دیا",
      "",
      "صادق تھے ہم بھی جذبۂ منزل میں اس قدر",
      "رستے کا ہر سراب سمندر بنا دیا",
      "",
      "لے لے کے نقشِ بندگی دہلیز سے تری",
      "ہم نے جبین ِ عشق کا زیور بنا دیا",
      "",
      "شہر ِ وصال دیکھنا چاہا پلٹ کے جب",
      "مجھ کو طلسم ِ ہجر نے پتھر بنا دیا",
      "",
      "بخشی کسی کو گہری خموشی مگر مجھے",
      "اک عشقِ  رائگاں نے سخنور بنادیا",
      "",
      "رکھتے تھے ہم بھی پہلو میں ہیرا سا دل کبھی",
      "آلام ِ روزگار نے کنکر بنا دیا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ہدیۂ اشک ملے ، درد کی سوغات ملے",
      "کاسۂ عشق ہے خالی کوئی خیرات ملے",
      "",
      "بھر دے کشکولِ سماعت کو ہمیشہ کیلئے",
      "لبِ لعلیں سے ترے ایسی کوئی بات ملے",
      "",
      "کھیل چلتا ہی رہے گرچہ لپٹ جائے بساط",
      "مات ہونی ہے تو پھر ایسی کوئی مات ملے",
      "",
      "خاک اُڑانے کو ملی وسعتِ آشوبِ جہاں",
      "غم اٹھانے کو ترے شہر میں دن رات ملے",
      "",
      "اور کیا چاہئے دہلیزِ محبت سے تری",
      "گلشنِ ہست ملا ، پھول سے لمحات ملے",
      "",
      "شکریہ کرتی رہے گی یہ نظر جھک جھک کر",
      "کبھی مجھ سے جو تری چشمِ عنایات ملے",
      "",
      "ہمکلام آپ ہوئے بھی تو غزل کی صورت",
      "ہمیں اظہار کے پردے میں حجابات ملے",
      "",
      "ہم سمجھتے تھے اُن آنکھوں میں ہر اُلجھن کا جواب",
      "پڑھنا آیا تو ہزاروں ہی سوالات ملے",
      "",
      "نہ شکایت ، نہ محبت ، نہ تغافل کی نظر",
      "بزمِ یاراں میں بھی روٹھے ہوئے جذبات ملے",
      "",
      "خوف کچھ اپنی جسارت کا تھا ، کچھ اُن کا ادب",
      "جب کبھی اُن سے ملے ہم بڑے محتاط ملے",
      "",
      "کام سے آتے ہیں ملنے تو ہزاروں ہی ظہیرؔ",
      "دل یہ کرتا ہے کوئی بہرِ ملاقات ملے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ملتی نہیں منزل تو مقدر کی عطا ہے",
      "یہ راستہ لیکن کسی رہبر کی عطا ہے",
      "",
      "کب میری صفائی کو بھلا مانے گی دنیا",
      "الزام ہی کچھ ایسے فسوں گر کی عطا ہے",
      "",
      "جچتے نہیں آنکھوں میں شبستان و گلستان",
      "یہ دربدری ایسے کسی در کی عطا ہے",
      "",
      "ساحل کے خزانے نہیں دامن میں ہمارے",
      "جو کچھ بھی ملا ، گہرے سمندر کی عطا ہے",
      "",
      "اُجرت میں ملی ہے مجھے اقلیمِ سخن یہ",
      "ہر شعر کسی زخمِ ستمگر کی عطا ہے",
      "",
      "محشر میں بنے گی مری بخشش کا سبب یہ",
      "نسبت جو مجھے ساقیِ کوثر کی عطا ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "لہروں پہ سفینہ جو مرا ڈول رہا ہے",
      "شاید مری ہمت کو بھنور تول رہا ہے",
      "",
      "شیریں ہے تری یاد مگر ہجر لہو میں",
      "شوریدہ ہواؤں کا نمک گھول رہا ہے",
      "",
      "پتوار بنا کر مجھے طوفانِ حوادث",
      "قامت مری پرچم کی طرح کھول رہا ہے",
      "",
      "ساحل کی صدا ہے کہ سمندر کا بلاوا",
      "گہرائی میں سیپی کی کوئی بول رہا ہے",
      "",
      "یہ وقت مجھے موتی بنائے گا کہ مٹی؟!",
      "اک آبِ رواں ہے کہ مجھے رول رہا ہے",
      "",
      "کھُلتے نہیں کردار کہ ہیرو یا ولن ہیں",
      "اپنی تو کہانی میں یہی جھول رہا ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "وہ بھی اب مجھ کو بہ اندازِ زمانہ مانگے",
      "برسرِ عام محبت کا تماشا مانگے",
      "",
      "جسے پندار مرے ظرفِ محبت نے دیا",
      "اب وہ پہچان محبت کے علاوہ مانگے",
      "",
      "میں تو اسرافِ محبت میں ہوا ہوں مقروض",
      "دوستی ہر گھڑی پہلے سے زیادہ مانگے",
      "",
      "راحتِ وصل بضد ہے کہ بھلادوں ہجراں",
      "چند لمحے مجھے دے کر وہ زمانہ مانگے",
      "",
      "مدّتیں گذریں کئے ترکِ سکونت لیکن",
      "آج بھی دنیا اُسی گھر کا حوالہ مانگے",
      "",
      "میں جہاں کھویا تھا شاید کہ وہیں مل جاؤں",
      "کوئی مجھ کو غم ِ دنیا سے دوبارہ مانگے",
      "",
      "بٹ چکی درد کی جاگیر مگر تیرا غم",
      "دل میں ہر روز نیا ایک علاقہ مانگے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "پھر کسی آئنہ چہرے سے شناسائی ہے",
      "عاشقی اپنے تماشے کی تمنائی ہے",
      "",
      "مہربانی بھی مجھے اب تو ستم لگتی ہے",
      "اک بغاوت سی رَگ و پے میں اُتر آئی ہے",
      "",
      "سنگِ برباد سے اٹھتا ہے عمارت کا خمیر",
      "خاکِ تخریب میں پوشیدہ توانائی ہے",
      "",
      "عصرِ حاضر کے مسائل ہوئے بالائے حدود",
      "اب نہ آفاقی رہا کچھ ، نہ علاقائی ہے",
      "",
      "مسئلے دھرتی کے ہمزادِ بنی آدم ہیں",
      "زندگی ساتھ میں اسبابِ سفر لائی ہے",
      "",
      "شاعری صورتِ اظہارِ غمِ ذات نہیں",
      "اپنی دنیا پہ مری تبصرہ آرائی ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "تمھاری گلیوں میں پھر رہے تھے اسیرِ ِ درد و خراب ِ ہجراں",
      "ملی اجازت تو آگئے پھر حضورِ عشق و جناب ِ ہجراں",
      "",
      "وہ ملنے جلنے کی ساری رسمیں دراصل فرقت کے سلسلے تھے",
      "گئے دنوں کی رفاقتوں میں چھپا ہوا تھا سراب ِ ہجراں",
      "",
      "مٹے نہیں ہیں حروفِ ظلمت ، ابھی گریزاں ہے صبح ِ برات",
      "ابھی پڑھیں گے کچھ اور بھی ہم دیارِ غم میں کتاب ِ ہجراں",
      "",
      "وفا شعاری کے مرحلوں سے پلٹ کے جب کامیاب آئے",
      "ہوا مقرر نئے سرے سے شکیب ِ دل پر نصاب ِ ہجراں",
      "",
      "یہ تیرے میرے لہو کی ساری کثافتوں کو نتھار دے گا",
      "ہماری راہوں کے درمیاں میں رواں دواں ہے جو آب ِ ہجراں",
      "",
      "وہ دن بھی تھے  جب مرا تعارف غزال چشموں کے زیب ِ لب تھا",
      "اور آج ان کی ہر انجمن سے ملا ہوا ہے خطاب ِ ہجراں",
      "",
      "ہمیں امید ِ جزا ہے اُن سے ، اسی لئے تو ظہیؔر ہم نے",
      "غزل کے شعروں میں لکھ دیا ہے شمارِ درد و حساب ِ ہجراں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ہاتھوں میں لئے سنگ کی سوغات چلی ہے",
      "اُترے گی مرے گھر ہی جو بارات چلی ہے",
      "",
      "ملتے ہیں گھڑی بھر کو دکھانے کیلئے زخم",
      "یاروں میں نئی طرزِ ملاقات چلی ہے",
      "",
      "لگتا ہے کہ افسانۂ رسوائی بنے گی",
      "وہ بات جو اغیار سے بے بات چلی ہے",
      "",
      "جو عشق نے چاہا ہے وہی کر کے دکھایا",
      "کب دل کے حضور اپنی کوئی بات چلی ہے",
      "",
      "پھر کوئے سیاست میں بعنوانِ شریعت",
      "اک رسمِ خریداریِ جذبات چلی ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "مجھ کو حصارِ حلقۂ احباب چھوڑ کر",
      "صحرا ملا ہے گلشن ِ شاداب چھوڑ کر",
      "",
      "ملتی نہیں کہیں بھی سوائے خیال کے",
      "اٹھے ہیں ایسی صحبتِ نایاب چھوڑ کر",
      "",
      "سب کچھ بہا کے لے گئی اک موجِ اشتعال",
      "دریا اتر گیا ہمیں غرقاب چھوڑ کر",
      "",
      "اوج ِ فلک سے گر گیا تحت الثریٰ میں عشق",
      "طوفِ حریمِ ناز کے آداب چھوڑ کر",
      "",
      "مسجد کی پاسبانی پر اب آگئی ہے بات",
      "اٹھنا پڑے گا منبر و محراب چھوڑ کر",
      "",
      "ہر آنکھ زیرِ خواب ہے یا زیرِ بارِ اشک",
      "دیکھوں کسے میں دیدۂ مہتاب چھوڑ کر",
      "",
      "نکلے رہو گے دوزخِ لیل و نہار میں",
      "کب تک ظہیؔر جنتِ بیتاب چھوڑ کر",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "رہبری کے زخموں کا چارہ گر نہیں ملتا",
      "واپسی کے رستے میں ہمسفر نہیں ملتا",
      "",
      "شہر ہے یا خواہش کی کرچیوں کا صحرا ہے",
      "بے خراش تن والا اک بشر نہیں ملتا",
      "",
      "ہر طرف ضرورت کی اک فصیلِ نادیدہ",
      "بے شگاف ایسی ہے جس میں دَر نہیں ملتا",
      "",
      "قہقہوں کے سائے میں بے بسی کا عالم ہے",
      "مرگِ آدمیت کو نوحہ گر نہیں ملتا",
      "",
      "انقلابِ دنیا نے زاویے بدل ڈالے",
      "تذکروں میں ماضی کے اب مفر نہیں ملتا",
      "",
      "جس کے در دریچے سب دل گلی میں کھلتے تھے",
      "عہدِ نو کے قصوں میں وہ نگر نہیں ملتا",
      "",
      "رات دن الجھتے ہیں بے نشان رستوں سے",
      "خواہشوں کے جنگل میں سُکھ نگر نہیں ملتا",
      "",
      "حرف معتبر ہوں تو کچھ روشنی سی دیتے ہیں",
      "کاغذوں کو اب ورنہ آبِ زر نہیں ملتا",
      "",
      "نم تو ہونا پڑتا ہے رنگ و روپ کی خاطر",
      "خاکِ ریزہ ریزہ کو کوزہ گر نہیں ملتا",
      "",
      "وقت روٹھ جاتا ہے انتظارِ پیہم سے",
      "گھر سے جانے والوں کو پھر سے گھر نہیں ملتا",
      "",
      "بام و در تو ملتے ہیں سب اسی جگہ قائم",
      "چاہتوں کے آنگن میں اک شجر نہیں ملتا",
      "",
      "گمشدہ سی گلیوں کے آشنا سے گوشوں میں",
      "آہٹوں سے کھل جائے ایسا در نہیں ملتا",
      "",
      "ساتھ لے گئے تھے تم عہدِ خوش نظر میرا",
      "تم تو مل گئے آخر ، وہ مگر نہیں ملتا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "آنکھوں سے فکرِ ذات کے منظر چلے گئے",
      "اشکوں کے بے کنار سمندر چلے گئے",
      "",
      "محور سے جب ہٹا گئی مرکز گریزیت",
      "ذرے سے آفتاب کے جوہر چلے گئے",
      "",
      "دھیمی ہوئی ہے عشقِ فسوں گر کی جب سے آنچ",
      "حسن ِ ستم طراز کے تیور چلے گئے",
      "",
      "دیکھی جو خوش عقیدگی اہل ِ زمین کی",
      "کچھ لوگ آسماں کے برابر چلے گئے",
      "",
      "بے خال و خد سے رہ گئے کردارِ بے نقوش",
      "رعنائیِ خیال کے پیکر چلے گئے",
      "",
      "شایانِ زیب و زینتِ گلشن نہیں کوئی",
      "ہم قامتِ چنار و صنوبر چلے گئے",
      "",
      "رندانِ خوش ادا رہے مقتل میں سر بکف",
      "جتنے تھے کج نوا سرِ منبر چلے گئے",
      "",
      "بیٹھے رہو اب اپنی انا کو سنبھال کر",
      "جن کا تھا انتظار وہ آکر چلے گئے",
      "",
      "باقی ہیں اس خرابۂ ہجرت میں ہم ظہیؔر",
      "واپس ہمارے ساتھ کے اکثر چلے گئے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "مجھے نسبت جو کسی در سے نہ دربار سے ہے",
      "یہ عنایت بھی ترے نام کی سرکار سے ہے",
      "",
      "بادبانوں کا تکلف نہیں کشتی میں مری",
      "آسرا مجھ کو ہوا سے نہیں پتوار سے ہے",
      "",
      "گونج رہ جائے گی میری جو صدا مر بھی گئی",
      "اتنی امید مجھے شہر کی دیوار سے ہے",
      "",
      "سرخیاں حسبِ خبر ہیں ، نہ خبر حسبِ حال",
      "پڑھنے والوں کو گلہ آج کے اخبار سے ہے",
      "",
      "عشق کی دین نہیں ، جبرِ ضرورت ہے یہ ہجر",
      "خلعتِ درد خریدی ہوئی بازار سے ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "خود فریبی کے نئے کچھ تو بہانے ڈھونڈیں",
      "اُس کی الفت کے علاوہ بھی ٹھکانے ڈھونڈیں",
      "",
      "گذری صدیوں کو گذارے چلے جائیں کب تک",
      "چھوڑ کر ماضی چلو اور زمانے ڈھونڈیں",
      "",
      "ہم کسی اور ہی اندازِ محبت کے ہیں لوگ",
      "تازہ رشتوں میں بھی اقرار پرانے ڈھونڈیں",
      "",
      "دل پہ مت لینا کہ لوگوں کی تو باتیں یوں ہیں",
      "جیسے اُڑتے ہوئے کچھ تیر نشانے ڈھونڈیں",
      "",
      "ڈار سے بچھڑے پرندوں کو نہیں معلوم اب",
      "رزق ڈھونڈیں یا بسیرے کے ٹھکانے ڈھونڈیں",
      "",
      "پھر کسی شام چلو یاد کے جنگل میں ظہیؔر",
      "ہم نے جو دفن کئے تھے وہ خزانے ڈھونڈیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "خیالِ خاطرِ احباب ہمسفر رکھنا",
      "سفر کہیں کا ہو آغاز پر نظر رکھنا",
      "",
      "شعاع ِ نور ِ محبت کو رکھنا قبلہ نما",
      "جہاں یہ دل کرے سجدہ وہیں پہ سر رکھنا",
      "",
      "تمام روپ محبت کے خوبصورت ہیں",
      "کوئی بھی رشتہ کسی سے ہو معتبر رکھنا",
      "",
      "چراغ بن نہیں سکتے تو بن کے تم فانوس",
      "کسی چراغ کو موسم سے بے خطر رکھنا",
      "",
      "قلم کو رکھنا ہمیشہ حصار ِ گیتی میں",
      "تخیل اپنا مگر آسمان پر رکھنا",
      "",
      "ظہیؔر اداس سی رہتی ہے یہ گلی اپنی",
      "کبھی کبھی سہی لیکن یہاں گزر رکھنا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "حبسِ جاں رونے سے کچھ اور گراں ہوتا ہے",
      "آگ بجھتی ہے تو انجام دھواں ہوتا ہے",
      "",
      "تابِ گفتار ہی باقی ہے نہ موضوعِ سخن",
      "اب ملاقات کا ماحول زباں ہوتا ہے",
      "",
      "کھینچ لائی ہے ضرورت مجھے کن راہوں میں",
      "ہر قدم پر مجھے دھوکے کا گماں ہوتا ہے",
      "",
      "غیر سے میری شکایت کا مجھے رنج نہیں",
      "گلہ شکوہ بھی محبت کا نشاں ہوتا ہے",
      "",
      "کارِ دنیا کا ہمالہ ہے مجھے ریت کا ڈھیر",
      "دل نہ چاہے تو یہی کوہِ گراں ہوتا ہے",
      "",
      "ربطِ محکم بھی ضروری ہے صد اخلاص کیساتھ",
      "معجزہ صرف دعاؤں سے کہاں ہوتا ہے",
      "",
      "جس عمارت میں توازن نہ دکھائی دے ظہیؔر",
      "اُس کی بنیاد میں اک سنگِ زیاں ہوتا ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ضبطِ غم توڑ گئی بھیگی ہوا بارش میں",
      "دل کہ مٹی کا گھروندا تھا گرا بارش میں",
      "",
      "شادیِ مرگ کو کافی تھا بس اک قطرۂ آب",
      "شہر ِتشنہ تو اجڑ سا ہی گیا بارش میں",
      "",
      "روشنی دل میں مرے ٹوٹ کے رونے سے ہوئی",
      "اک دیا مجھ میں عجب تھا کہ جلا بارش میں",
      "",
      "لاج رکھ لی مرے پندار کی اک بادل نے",
      "میرے آنسو نہ کوئی دیکھ سکا بارش میں",
      "",
      "کھیت پیاسے تھے اِدھر ، اور اُدھر کچے مکان",
      "میں نے دیکھا تو نظر آیا خدا بارش میں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ازراہِ دلبری ہمیں آنے دو اپنے پاس",
      "کچھ دیر کو سہی ہمیں آنے دو اپنے پاس",
      "",
      "رسموں کے زَر محل میں مقید ہو دیر سے",
      "در کھولو اب کوئی ہمیں آنے دو اپنے پاس",
      "",
      "احساس کے ڈگر سے اُتارو خیال میں",
      "یوں بھی کبھی کبھی ہمیں آنے دو اپنے پاس",
      "",
      "مل بیٹھ کر کریں گے علاجِ غمِ حیات",
      "اے جانِ زندگی ہمیں آنے دو اپنے پاس",
      "",
      "شاید تمہارے شہر سے گزریں نہ پھر کبھی",
      "پھیرا ہے آخری ہمیں آنے دو اپنے پاس",
      "",
      "مشعل بکف ہیں کب سے فصیلوں پہ منتظر",
      "لائے ہیں روشنی ہمیں آنے دو اپنے پاس",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "کس طور اُن سے آج ملاقات ہم کریں",
      "گریہ کریں کہ شکوۂ حالات ہم کریں",
      "",
      "کچھ دیر کو سہی پہ ملے درد سے نجات",
      "کچھ دیر کو تو دل کی مدارات ہم کریں",
      "",
      "مانا کہ اُن کی بزم میں ہے اذنِ گفتگو",
      "اتنا بھی اب نہیں کہ سوالات ہم کریں",
      "",
      "جب تک ہیں درمیان روایات اور اصول",
      "دشمن سے کیسے ختم تضادات ہم کریں",
      "",
      "وقتِ عمل ہے دوستو! اب کیسا انتظار",
      "آتے رہیں گے لوگ شروعات ہم کریں",
      "",
      "شکوے سبھی لبوں پہ زمانے کے ہیں ظہیؔر",
      "آؤ ذرا سا ذکرِ عنایات ہم کریں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ہجراں میں دربدر ہوئے ہم قربتوں کے بعد",
      "دے دی گئی زمین ہمیں جنّتوں کے بعد",
      "",
      "چھینے گا مجھ سے اور غمِ روزگار کیا!",
      "دامن میں کیا بچا ہے بھلا حسرتوں کے بعد",
      "",
      "ہو آئے اُس گلی میں تماشہ بنے ہوئے",
      "فرصت ملی تھی آج بڑی مدتوں کے بعد",
      "",
      "معمارِ ارضِ نو بھی وہی لوگ تھے جنہیں",
      "اک مشتِ خاک بھی نہ ملی ہجرتوں کے بعد",
      "",
      "تعمیرِ نو میں شہر کی اتنا رہے خیال",
      "ٹوٹی فصیل بھی ہے شکستہ چھتوں کے بعد",
      "",
      "سفّاک دن ہیں گھات میں بیٹھے ہوئے ظہیؔر",
      "اک حملۂ غنیم ہے اِن جگ رتوں کے بعد",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "تری زلف سمجھی اشارہ ہوا کا",
      "بہت اوج پر ہے ستارہ ہوا کا",
      "",
      "کماں کھنچ گئی ہے دھنک کی فضا میں",
      "شعاعوں نے رستہ نکھارا ہوا کا",
      "",
      "چراغوں سے ہے ربط فانوس جیسا",
      "تو پھولوں سے رشتہ ہمارا ہوا کا",
      "",
      "ملا یوں توازن ہمیں گردشوں سے",
      "پرندے کو جیسے سہارا ہوا کا",
      "",
      "خزاں زاد پتّوں پہ لکھ کر فسانے",
      "لو آیا ہے تازہ شمارہ ہوا کا",
      "",
      "وہ خاشاک صورت فضاؤں میں گم ہیں",
      "جو چُھونے چلے تھے کنارہ ہوا",
      "",
      "زمینوں میں وحشی بگولے کی صورت",
      "فلک چڑھ رہا ہے منارہ ہوا کا",
      "",
      "قبائیں سنبھالو اے دستار والو!",
      "کہ گلیوں میں ہے اب اجارہ ہوا کا",
      "",
      "پلٹ جاتے ہیں بادلوں کے سفینے",
      "مخالف ہے مٹی کے دھارا ہوا کا",
      "",
      "نہیں بس میں شعلوں کے اتنی تباہی",
      "ضرور اُن کو ہوگا سہارا ہوا کا",
      "",
      "دیئے بجھ گئے تو سوا ہو گیا حبس",
      "نہ لے نام کوئی دوبارہ ہوا کا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "دو دل جلے باہم جلے تو روشنی ہوئی",
      "کچھ وہ جلا ، کچھ ہم جلے تو روشنی ہوئی",
      "",
      "اتنا بڑھا کچھ حبسِ جاں بجھ سے گئے خیال",
      "کچھ دَر کھلے کچھ غم جلے تو روشنی ہوئی",
      "",
      "کل رات گھر کی تیرگی دل میں اُتر گئی",
      "دو دیدۂ پُرنم جلے تو روشنی ہوئی",
      "",
      "اُلجھے ہوئے احساس نے دھندلا دیا شعور",
      "جذبوں کے پیچ و خم جلے تو روشنی ہوئی",
      "",
      "رستے سبھی تھے بے نشاں اپنی تلاش کے",
      "انجم نما خود ہم جلے تو روشنی ہوئی",
      "",
      "اک عمر سے بے نور تھے زخموں کے سب چراغ",
      "کچھ روز بے مرہم جلے تو روشنی ہوئی",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اُجرتِ آبلہ پائی بھی نہ دے گا سورج",
      "ہمسفر بن کے اگر ساتھ چلے گا سورج",
      "",
      "دن نکلنے کا کرشمہ نہ سمجھنا آسان",
      "اَن گنت ٹوٹیں گے تارے تو بنے گا سورج",
      "",
      "سائباں جیسا بھی سر پر ہے غنیمت ہے بہت",
      "سر اٹھاؤ گے تو آنکھوں میں چُبھے گا سورج",
      "",
      "اپنی تابش پہ جنہیں ناز ہے اُن سے کہہ دو",
      "شام جب ہوگی تو اُن پر بھی ڈھلے گا سورج",
      "",
      "سائے کی چاہ میں یوں راہ بدلنے والو!",
      "تم جہاں جاؤ گے سر پر ہی رہے گا سورج",
      "",
      "روشنی میں ہے بڑا ظرف ، نہ پچھتاؤ ظہیؔر",
      "سینہ کھولو گے تو پھر آن بسے گا سورج",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "تمام رنگ وہی ہیں ترے بگڑ کر بھی",
      "اے میرے شہر تُو اجڑا نہیں اجڑ کر بھی",
      "",
      "ہیں آندھیاں ہی مقدر تو پھر دعا مانگو",
      "شجر زمین پر اپنی رہیں اُکھڑ کر بھی",
      "",
      "ہم ایسی خاک ہیں اس شہر زرگری میں جسے",
      "بدل نہ پائے گا پارس کوئی رگڑ کر بھی",
      "",
      "ملا ہے اب تو مسلسل ہی روئے جاتا ہے",
      "وہ ایک شخص جو ہنستا رہا بچھڑ کر بھی",
      "",
      "دیا گیا یہ تاثر کہ ہم بھی ہیں آزاد",
      "ہمیں اُڑایا گیا جال میں جکڑ کر بھی",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "تری نظر نے مرے قلب و جاں کے موسم میں",
      "یقیں کے رنگ بھرے ہیں گماں کے موسم میں",
      "",
      "زکوٰۃِ درد ہے واجب متاعِ الفت پر",
      "حسابِ غم کرو سود و زیاں کے موسم میں",
      "",
      "نہ اب تلاشِ بہاراں ، نہ ڈر خزاؤں کا",
      "ٹھہر گیا ہے چمن درمیاں کے موسم میں",
      "",
      "وہ انتظار کا موسم بہت غنیمت تھا",
      "بڑھی ہے تشنگی ابرِ رواں کے موسم میں",
      "",
      "حلیف سب تہی دامانِ جستجو نکلے",
      "اکیلے ہم چلے کارِ گراں کے موسم میں",
      "",
      "مرے وطن میں پنپتا نہیں گلِ امید",
      "کوئی تو بات ہے آخر یہاں کے موسم میں",
      "",
      "ہنر نصیب خدا رکھے دستِ ہجرت کو",
      "کہاں کے پھول کھلائے کہاں کے موسم میں",
      "",
      "سخن میں ڈھال ظہیرؔ اب خیال ِ پنہاں کو",
      "خموشی جرم ہے لفظ و بیاں کے موسم میں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "غم نیا تھا تو نیا عہدِ وفا رکھنا تھا",
      "حوصلہ غم سے بہرحال سوا رکھنا تھا",
      "",
      "کیسے اُس پر میں مقدر کی سیاہی رکھتا",
      "جس ہتھیلی پہ مجھے رنگِ حنا رکھنا تھا",
      "",
      "ایسا کیا ڈر تھا بھلا تیز ہوا سے لوگو!",
      "بجھ گئیں شمعیں تو آنکھوں کو کُھلا رکھنا تھا",
      "",
      "ہم نہ خوشبو تھے ، نہ آواز ، نہ بادل کوئی",
      "پھر ہواؤں سے تعلق بھلا کیا رکھنا تھا",
      "",
      "اس قدر بھی تو نہیں رکھتے زمیں کو بنجر",
      "دل کے ویرانے میں اک نخلِ انا رکھنا تھا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "نیم در نیم ہوا ، ریت میں سوکھا دریا",
      "آتے آتے مری بستی ہوا صحرا دریا",
      "",
      "اپنی مٹی میں گُہر اتنے کہاں سے آئے",
      "ایسے لگتا ہے یہاں سے کبھی گزرا دریا",
      "",
      "ایک دو روز کی بارش سے نہیں کچھ ہوگا",
      "پیاسی مٹی کی ضرورت تو ہے بہتا دریا",
      "",
      "برف زاروں میں شب و روز جلا کر اپنے",
      "قطرہ قطرہ میں نے پگھلا کے بنایا دریا",
      "",
      "باندھ لو بند شراکت کے رواداری کے",
      "روک لو روٹھ نہ جائے کہیں چلتا دریا",
      "",
      "یہ تو املاک ہے سبزے کی ، گلوں کی جاگیر",
      "لڑنا کیسا کہ نہ تیرا ہے نہ میرا دریا",
      "",
      "یہ تو بادل کی وراثت ہے ، زمیں کا صدقہ",
      "جتنا تقسیم ہو اُتنا ہے یہ اچھا دریا",
      "",
      "اے مرے آبِ وطن تجھ کو دعا پیاسوں کی",
      "تیری موجوں کی روانی رہے دریا دریا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ہوائے مہر و محبت سوادِ جاں سے چلے",
      "فصیلِ درد گرائے جہاں جہاں سے چلے",
      "",
      "ہوا ہے شہر میں دستورِ مصلحت کا نفاذ",
      "کوئی تو رسمِ جنوں بزمِ عاشقاں سے چلے",
      "",
      "وصال و ہجر کے موسم گزرچکے ہیں سبھی",
      "سو آج ہم بھی تری بزمِ امتحاں سے چلے",
      "",
      "وہ مرحلے تری جانب جو طے کئے تھے کبھی",
      "بُھلا کے ہم تری خاطر لو درمیاں سے چلے",
      "",
      "فرازِ دار ، نشیبِ چمن ، حصارِ جنوں",
      "یہ سلسلے تری جانب کہاں کہاں سے چلے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ڈرتا ہوں کسی دن نظروں کا دھوکا نہ کہیں ہو جاؤ تم",
      "تعبیر سمجھتا ہوں تم کو ، سپنا نہ کہیں ہو جاؤ تم",
      "",
      "ہر روز بدلتے ہو منزل ، ہر سمت میں چلتے ہو کچھ دیر",
      "خواہش کے سفر میں رستے کا حصہ نہ کہیں ہو جاؤ تم",
      "",
      "جو آگ چھپائے پھرتے ہو ، رکھ دے نہ سبھی کچھ پگھلا کر",
      "پتھر ہو بظاہر باہر سے ، لاوا نہ کہیں ہو جاؤ تم",
      "",
      "چھپ کر ہی سہی رویا تو کرو ، یہ ضبط بھی اتنا ٹھیک نہیں",
      "بے آب نہ رکھو دشتِ انا ، صحرا نہ کہیں ہو جاؤ تم",
      "",
      "قربت بھی اب اتنی ٹھیک نہیں ، ہر گام نہ میرے ساتھ رہو",
      "پرتَو نہ سمجھ بیٹھوں اپنا ، سایا نہ کہیں ہو جاؤ تم",
      "",
      "دل میں جو خلش ہے ماضی کی ، لفظوں میں اسے مت دہراؤ",
      "ایسا نہ ہو اے جانانِ غزل ، افسانہ کہیں ہو جاؤ تم",
      "",
      "ہر لفظ علامت ہے میرا ، ہر بات معمہ ہے میری",
      "اک راز بنا ہوں اس لئے میں ، افشا نہ کہیں ہو جاؤ تم",
      "",
      "آتی ہے نظر جو کاغذ پر ، ہے مختلف اس سے دنیا ظہیؔر",
      "ڈر ہے کہ کتابیں پڑھ پڑھ کر تنہا نہ کہیں ہو جاؤ تم",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "سوچا ہے یہ ہم نے تمہیں سوچا نہ کریں گے",
      "ہم تم کو تصور میں بھی رُسوا نہ کریں گے",
      "",
      "گر تم کو بچھڑنے پہ نہیں کوئی ندامت",
      "مل جاؤ تو ہم بھی کوئی شکوہ نہ کریں گے",
      "",
      "رستے میں اگرچہ ہیں ہواؤں کے نشیمن",
      "ہم مشعلِ خود داری کو نیچا نہ کریں گے",
      "",
      "منزل کی ہوس سے بھی سوا ذوقِ سفر ہے",
      "ہم کھو بھی گئے تو کوئی شکوہ نہ کریں گے",
      "",
      "وہ حرفِ سخن جو تری نسبت سے ملا ہے",
      "اس حرف کو بازار میں رسوا نہ کریں گے",
      "",
      "اپنی ہی بغاوت سے نبٹنا نہیں ممکن",
      "یہ دل نہیں چاہے گا تو وعدہ نہ کریں گے",
      "",
      "تڑپیں گے نہ بیکار کسی فکرِ عبث میں",
      "احساس کی دولت کو یوں کھویا نہ کریں گے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "قلب ہوجائے جو پتھر تو بشر پتھر کا",
      "پھر تو ہر آدمی آتا ہے نظر پتھر کا",
      "",
      "سنگ باری ہوئی اتنی کہ شرر ہوگیا خون",
      "کچھ تو ہونا ہی تھا آخر کو اثر پتھر کا",
      "",
      "عشقِ بینا کی عنایت ہے یہ ترتیبِ صفات",
      "آئنہ چہرہ ، بدن پھول ، جگر پتھر کا",
      "",
      "کارِ شیشہ گری نازک سا ہے بالائے سطح",
      "زیرِ شیشہ ہے وہی کام مگر پتھر کا",
      "",
      "یا تو رستے کی رکاوٹ یا کسی سر کا نصیب",
      "یعنی ٹھوکر سے سروں تک ہے سفر پتھر کا",
      "",
      "پہلے گھڑتا ہے صنم ، پھر وہی تیشے بھی سبھی",
      "آزرِ عصر کے ہاتھوں میں ہنر پتھر کا",
      "",
      "دشمنوں کو ہے کھلی دعوتِ شب خون ظہیؔر",
      "کانچ کی اپنی فصیلیں ہیں ، نگر پتھر کا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اک ارمغانِ محبت ، وفا کی خوشبو ہے",
      "کسی کے ہدیۂ گل میں حنا کی خوشبو ہے",
      "",
      "سکوتِ کنجِ تمنا میں کھل رہے ہیں گلاب",
      "مشامِ جاں میں کسی خوش نوا کی خوشبو ہے",
      "",
      "کسی کی یاد سے مہکے ہوئے ہیں شام و سحر",
      "فضا میں رنگ گھلے ہیں ، صبا کی خوشبو ہے",
      "",
      "گلالِ عارضِ خلوت شفق مثال ہوا",
      "حجابِ جامۂ شب میں حیا کی خوشبو ہے",
      "",
      "گدائے کوئے محبت ہوں کچھ عطا کیجے",
      "مری صداؤں میں صدق و صفا کی خوشبو ہے",
      "",
      "جبیں جو اٹھتی نہیں فرشِ راہ سے میری",
      "ضرور خاک میں اس نقشِ پا کی خوشبو ہے",
      "",
      "اسیر ہو کے بھی زنداں نظر نہیں آتا",
      "ابھی خیال میں تازہ ہوا کی خوشبو ہے",
      "",
      "اٹھے ہوئے ہیں کہیں کوئی ہاتھ میرے لئے",
      "ہوائے نیم شبی میں دعا کی خوشبو ہے",
      "",
      "لباسِ ہست کے نقش و نگار ہیں رنگیں",
      "ہر ایک رنگ میں لیکن فنا کی خوشبو ہے",
      "",
      "چراغِ صبر و رضا طاقِ دل میں ہے روشن",
      "سوادِ حجرۂ جاں میں غنا کی خوشبو ہے",
      "",
      "یہ کس غزالِ تصور نے رَم کیا ہے ظہیؔر",
      "فضائے دشتِ سخن میں بلا کی خوشبو ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "بدلے جو ہم نے زاویے ، معلوم ہو گئے",
      "جھوٹے تھے جتنے آئنے معلوم ہو گئے",
      "",
      "کارِ نبردِ عشق میں نقصان یہ ہوا",
      "دونوں کو اپنے حوصلے معلوم ہو گئے",
      "",
      "بے خود پڑے قدم جو ترے نقشِ پا سے دور",
      "ہوش اور جنوں کے فاصلے معلوم ہو گئے",
      "",
      "اک خوشبوئے وطن ہے کہ ہم سے نہ جاسکی",
      "جس شہر میں بھی ہم رہے معلوم ہو گئے",
      "",
      "قائم مرا سوال ہے اپنی جگہ مگر",
      "اہلِ نظر کے زاویے معلوم ہو گئے",
      "",
      "معدوم کر سکی نہ ہوا روشنی کی بات",
      "جو بھی چراغ گل ہوئے معلوم ہوگئے",
      "",
      "کردار بولتا تھا مرا مجھ سے پیشتر",
      "دشمن کو میرے فیصلے معلوم ہو گئے",
      "",
      "اک بے حجاب جلوۂ صد ناز کے طفیل",
      "قلب و نظر کے رابطے معلوم ہو گئے",
      "",
      "دو دن شکم کی آگ میں نقاد کیا جلا",
      "شعر و سخن کے فلسفے معلوم ہو گئے",
      "",
      "اک احتیاج کیا پڑی سر پر مرے ظہیؔر",
      "سب دوستوں کے مسئلے معلوم ہو گئے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اک عجب شور سا دن رات بپا ہے مجھ میں",
      "ہاں کوئی بات تو ہے ، کچھ تو ہوا ہے مجھ میں",
      "",
      "پھر کہیں کوئی دریچہ سا کھلا ہے مجھ میں",
      "ایسے لگتا ہے کوئی جھانک رہا ہے مجھ میں",
      "",
      "اک بکھرتے ہوئے پیکر کا پشیماں سایا",
      "سر جھکائے ہوئے خاموش کھڑا ہے مجھ میں",
      "",
      "مت سمجھیے مجھے لفظوں سے بنی اک تصویر",
      "غور سے دیکھیے اک شخص چھپا ہے مجھ میں",
      "",
      "ہاں نہیں مجھ میں کوئی خوبی زمانے والی",
      "اک مگر خوئے محبت ہے ، وفا ہے مجھ میں",
      "",
      "آئیے آئیے غم ہائے محبت لے کر!",
      "روح تک فرشِ پذیرائی بچھا ہے مجھ میں",
      "",
      "رات بھر تارے جلیں گے مری پلکوں پہ ظہیؔر",
      "ایک مہتاب سرِ شام بجھا ہے مجھ میں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "اک دراڑ ایسی کوئی ڈال گیا ہے مجھ میں",
      "کچھ نہ کچھ ہر گھڑی اب ٹوٹ رہا ہے مجھے میں",
      "",
      "دے رہا ہوں میں اندھیرے کو اجالے کا فریب",
      "صورتِ شمع ہر اک زخم جلا ہے مجھ میں",
      "",
      "قہقہے کھوکھلے ہیں میرے ، ہنسی بے آواز",
      "یار کہتے ہیں کہیں کوئی خلا ہے مجھ میں",
      "",
      "راستہ ڈھونڈ رہتی ہے رہائی کے لیے",
      "ایک بھٹکی ہوئی بے چین صدا ہے مجھ میں",
      "",
      "ایک پُرشور سمندر جو ہوا کرتا تھا",
      "کسی صحرا کی طرح سوکھ رہا ہے مجھ میں",
      "",
      "دن بدن میں تو مہکتا ہی گیا تیرے بعد",
      "جب کوئی درد ملا پھول کھلا ہے مجھ میں",
      "",
      "متفق ہونا کسی حال سے میرا ہے محال",
      "ایسی روٹھی ہوئی بیزار فضا ہے مجھ میں",
      "",
      "کتنی اجڑی ہوئی تہذیبیں کھنڈر ہیں دیکھو",
      "کتنے بھولے ہوئے شہروں کا پتہ ہے مجھ میں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "نوائے شوق نہیں عرضِ نارسا ہے مری",
      "یہ شورِ نغمۂ زنجیر التجا ہے مری",
      "",
      "کس آستانِ تمنا پہ سر جھکا بیٹھا",
      "غریقِ آبِ ندامت خوئے وفا ہے مری",
      "",
      "برہنہ کر گئی مجھ کو ہوائے نام و نمود",
      "رہینِ خواہشِ دستار اب قبا ہے مری",
      "",
      "میں لڑ رہا ہوں زمیں سے مقدمہ گھر کا",
      "میں دربدر ہوں کہ پیشی جگہ جگہ ہے مری",
      "",
      "کیا تھا میں نے ہواؤں سے اتفاق کا جرم",
      "بجھے چراغوں کی نوحہ گری سزا ہے مری",
      "",
      "بھٹک رہی ہے کسی ہم نوا کی خواہش میں",
      "ہجومِ صوت میں تنہا کہیں صدا ہے مری",
      "",
      "یہ اک جزیرہ سمندر کی شورشوں سے الگ",
      "جسے رہائی سمجھتے ہو تم ، سزا ہے مری",
      "",
      "وہ ایک نام جو شامل ہے دل کی دھڑکن میں",
      "وہی سکوت ہے میرا ، وہی صدا ہے مری",
      "",
      "خیالِ یار پہ جب تک ہے دسترس دل کی",
      "بہار میری ہے ، گلشن مرا ، صبا ہے مری",
      "",
      "محبتوں میں کئی لوگ اجڑ بھی جاتے ہیں",
      "خدا کرے تو سلامت رہے ، دعا ہے مری",
      "",
      "تمہی بدل گئے سود و زیاں کے پیمانے",
      "وہی ظہیر ؔ ہوں میں تو وہی وفا ہے مری",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "سنا ہے پھر سے محبت کے امتحاں ہوں گے",
      "جو داغ مٹ گئے دل کے وہ پھر عیاں ہوں گے",
      "",
      "لہو رلائے گا آنکھوں سے ذوقِ بینائی",
      " بھری بہارکے منظر دھواں دھواں ہوں گے",
      "",
      "ہمارا عہدِ محبت ہے ماورائے حدود",
      "تمہارے غم چلے آئیں گے ہم جہاں ہوں گے",
      "",
      "لہو سفید ہے لیکن لہو کے رشتے بجا",
      "ہمی اٹھائیں گے جو بوجھ بھی گراں ہوں گے",
      "",
      "ابھی ہے ساتھ میسر ، ملا کرو یارو",
      "بچھڑ گئے تو نجانے کہاں کہاں ہوں گے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "روشن چراغِ مہر و محبت جو گھر میں ہے",
      "اک روشنی عجیب سی دیوار و در میں ہے",
      "",
      "ظلمت سے لڑ رہے ہیں وہ پیہم دوانہ وار",
      "بیدار جن کی آگہی خوابِ سحر میں ہے",
      "",
      "جس کی مجھے تلاش ہے ملتا نہیں کہیں",
      "میری طرح وہ شخص بھی شاید سفر میں ہے",
      "",
      "کیسے یقینِ عکسِ سرِ آئنہ کروں",
      "منظر درونِ ذات کا میری نظر میں ہے",
      "",
      "گل ہو رہی ہیں شمعیں مثالِ شہیدِ شب",
      "رنگِ شبِ فراق ابھی تک سحر میں ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "قسمت کا ستم اِس سے بڑا ہو نہیں سکتا",
      "میں اُس کا ہوا ہوں جو مرا ہو نہیں سکتا",
      "",
      "یہ کیسا ستم ہے کہ وہی سجتا ہے اُن پر",
      "اک حرفِ محبت جو ادا ہو نہیں سکتا",
      "",
      "ہو جائیں جو حالات ہی ناراض تو قسمت!",
      "ویسے تو مجھے اُن سے گلہ ہو نہیں سکتا",
      "",
      "مجبوریِ غم دیکھیے ، دل ہار کے اُن سے",
      "وعدہ وہ کیا ہے جو وفا ہو نہیں سکتا",
      "",
      "چپ چاپ سلگتا ہے مرے سینے میں دن رات",
      "اک حرفِ تمنا جو دعا ہو نہیں سکتا",
      "",
      "الفت ہی نشانی ہے دھڑکتے ہوئے دل کی",
      "پتھر کسی پتھر پہ فدا ہو نہیں سکتا",
      "",
      "کیوں آپ مجھے دیتے ہیں مینائے تغافل",
      "یہ زہر ہے اور زہر دوا ہو نہیں سکتا",
      "",
      "منزل ہے کہ معلوم نہیں مجھ کو سفر کی",
      "رستہ ہے کہ قدموں سے جدا ہو نہیں سکتا",
      "",
      "جب تک نہ ڈھلے سر سے سلگتا ہوا سورج",
      "سایہ کبھی پیکر سے بڑا ہو نہیں سکتا",
      "",
      "سجتا نہیں دعوائے وفا اُس کے لبوں پر",
      "جو شخص محبت میں فنا ہو نہیں سکتا",
      "",
      "جس سمت بھی کرتا رہے پرواز تخیل",
      "زندانِ حقیقت سے رہا ہو نہیں سکتا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "دنیا یہ سمجھتی ہے کہ ہم سنگِ گراں ہیں",
      "سچ یہ ہے کہ دریا کی روانی میں رواں ہیں",
      "",
      "کس راہ پہ لے کر چلے آئے ہمیں رہبر",
      "منزل کی علامت ہے نہ رستے کے نشاں ہیں",
      "",
      "ہم حال میں گم ہیں کہ ہیں ماضی میں گرفتار",
      "کوئی تو بتائے ہمیں ہم لوگ کہاں ہیں",
      "",
      "آئینہ دکھائیں تو انہیں کیسے دکھائیں",
      "وہ لوگ جو خود اپنی ہی نظروں سے نہاں ہیں",
      "",
      "آزادیِ اظہار کے عنواں ہوئے آزار",
      "آنکھوں پہ ستم ہیں تو سماعت پہ گراں ہیں",
      "",
      "جگنو کے تعاقب میں نکلتے تھے جو بچے",
      "اب جانے وہ کس دشتِ تحیّر میں رواں ہیں",
      "",
      "حرکت ہے ، حرارت ہے ، صدائیں بھی زمیں پر",
      "آثار تو سارے ہیں پر انسان کہاں ہیں",
      "",
      "شاعر تو نہیں ہم ہیں عزادارِ محبت",
      "مرتی ہوئی تہذیب کے ہم مرثیہ خواں ہیں",
      "",
      "پابندِ تکلف نہیں آدابِ حضوری",
      "حاضر ہیں ترے نام پہ جیسے ہیں جہاں ہیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "ہاتھوں میں اک چراغ لبوں پر دعا لیے",
      "بیٹھا ہوں رہ گزر پہ کوئی آسرا لیے",
      "",
      "خوشبو گلاب زار کی آئی ہوا لیے",
      "موسم بدل رہا ہے ذرا دل سنبھالیے",
      "",
      "جب بھی زمینِ درد پر آئی کبھی بہار",
      "کچھ پھول یادگار کے میں نے اٹھا لیے",
      "",
      "کچھ لوگ تھے ہمارے بھی غم خوار و جانثار",
      "آلامِ روزگار نے اپنے بنالیے",
      "",
      "دل ہی نہ چاہے غم کا مداوا تو کیا کریں",
      "حیراں کھڑے ہیں کتنے مسیحا دوا لیے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "غزلیں",
    "title": "",
    "desc": [
      "مشعلِ دل جلا کے لائے ہیں",
      "ہم سندیسے ضیا کے لائے ہیں",
      "",
      "جن سے اُمید تھی چراغوں کی",
      "وہ تھپیڑے ہوا کے لائے ہیں",
      "",
      "ماں سے ملنے گئے تھے گھر بیٹے",
      "پھول ڈھیروں دعا کے لائے ہیں",
      "",
      "ایک دن یہ بھی چھین لے گا وقت",
      "ہم جو لمحے چُرا کے لائے ہیں",
      "",
      "چھوڑ کر جا چکا تھا میں خود کو",
      "لوگ سمجھا بجھا کے لائے ہیں",
      "",
      "بزمِ دنیا سے اور کیا ملتا",
      "اپنے دل کو اٹھا کے لائے ہیں",
      "",
      "کرکے ناراض ہر خوشی کو ہم",
      "تیرے غم کو منا کے لائے ہیں",
      "",
      "کارگاہِ خیال و خواب سے ہم",
      "ایک دنیا بنا کے لائے ہیں",
      "",
      "اک شکستہ پرانے کاغذ پر",
      "نقشِ تازہ سجا کے لائے ہیں",
      "",
      "آگہی مرگئی تھی فاقوں سے",
      "اُس کی میّت اٹھا کے لائے ہیں",
      "",
      "سیم و زر کی فریب گاہوں سے",
      "سنگِ عبرت اٹھاکے لائے ہیں",
      "",
      "دن کو تسخیر کرنے نکلے تھے",
      "شامِ غربت کما کے لائے ہیں",
      "",
      "اتنی سفاک تھی انا کی جنگ",
      "خود کو خود سے بچا کے لائے ہیں",
      "",
      "اور کیا تھا ظہیؔر اپنے پاس",
      "چند ٹکڑے انا کے لائے ہیں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "دُعا",
    "title": "دعا",
    "desc": [
      "مٹی سنوار کر مری دیپک میں ڈھال دے",
      "مجھ کو جلا کے پھر مری دنیا اُجال دے",
      "",
      "مجھ کو اُٹھا کے رکھ کسی طوفاں کی آنکھ میں",
      "ہر موج ِ مضطرب مرے سر سے اچھال دے",
      "",
      "ٹکرادے حوصلہ مرا آلام ِ زیست سے",
      "مرنے کی آرزو کو بھی دل سے نکال دے",
      "",
      "پامال راستوں سے ہٹا کر مرے قدم",
      "نایافت منزلوں کے اشارے پہ ڈال دے",
      "",
      "اک مستعار آگہی اُلجھا گئی ہے ذہن",
      "دے مجھ کو سوچ میری اور اپنا خیال دے",
      "",
      "خاموشیوں کے دہر میں لائے جو ارتعاش",
      "مجبور مصلحت کو وہ حرفِ مجال دے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "دُعا",
    "title": "دعا ئے استغنا",
    "desc": [
      "مری نظر میں تری آرزو نظر آئے",
      "مجھے وہ آنکھ عطا کر کہ تو نظر آئے",
      "",
      "کلام اپنا سمودے وجود میں ایسا",
      "کہ میری چپ میں تری گفتگو نظر آئے",
      "",
      "میں جب بھی آئنہ دیکھوں غرورِ ہستی کا",
      "تو ایک عکسِ عدم روبرو نظر آئے",
      "",
      "ہٹادے آنکھ سے میری یہ خواہشات کے رنگ",
      "جو چیز جیسی ہے بس ہوبہو نظر آئے",
      "",
      "ہجوم  ِشہر تماشہ میں گم نہ ہو رستہ",
      "نشان ِ راہ ترا کوبکو نظر آئے",
      "",
      "رواں دواں رہے جب تک مرا سفینۂ جاں",
      "منارِ نور ہدیٰ چار سو نظر آئے",
      "",
      "خلوصِ فکر عطا کر اور ایسا حسنِ عمل",
      "کہ فکرِ دنیا تری جستجو نظر آئے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "نظمیں",
    "title": "آئینہ گر کے دکھ",
    "desc": [
      "پتھرہی رہو ، شیشہ نہ بنو",
      "شیشوں کی ابھی رُت آئی نہیں",
      "اِس شہرمیں خالی چہروں پر",
      "آنکھیں تو اُبھر آئی ہیں مگر",
      "آنکھوں میں ابھی بینائی نہیں",
      "خاموش رہو ، آواز نہ دو",
      "کانوں میں سماعت سوتی ہے",
      "سوچوں کو ابھی الفاظ نہ دو",
      "احساس کو زحمت ہوتی ہے",
      "اظہارِ حقیقت کے لہجے",
      "سننے کا ابھی دستور نہیں",
      "الفاظ و معانی کے رشتے",
      "ذہنوں کو ابھی منظور نہیں",
      "یہ شہر کسی کا شہر ہے کب",
      "یہ لوگ نہیں ہیں سائے ہیں",
      "ا ِن سایوں میں کوئی مہر ہے کب",
      "یہ پیاس بڑھانے آئے ہیں",
      "اشکوں سے کہو جم جائیں وہیں",
      "جس چشمۂ غم سے پھوٹے ہیں",
      "آہوں سے کہو تھم جائیں وہیں",
      "یہ جذبے شاید جھوٹے ہیں",
      "مت ہاتھ بڑھاؤ چاہت کا",
      "انجان بنو ، انجان رہو",
      "یہ رسم گراں ہے لوگوں پر",
      "مشکل نہ بنو ، آسان رہو",
      "جو بھول چکے ہو مدت سے",
      "اُس درد کو پھر آغاز نہ دو",
      "جانے دو انہیں ، آواز نہ دو",
      "آواز نہ دو ، آواز نہ دو",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "نظمیں",
    "title": "اپنے بیٹے کے لیے",
    "desc": [
      "شاد و آباد رہو ، وقت سدا خوش رکھے",
      "تم جہاں جاؤ تمہیں میری دعا خوش رکھے",
      "",
      "فکرِ فردا سے بجھے جاتے تھے دل سینوں میں",
      "حوصلہ تم نے دیا ، تم کو خدا خوش رکھے",
      "",
      "پائیدانوں پہ ترقی کے ملے عزت و نام",
      "بامِ شہرت پہ محبت کی ہوا خوش رکھے",
      "",
      "آگہی رستہ اُجالے ، تمہیں دیکھے دنیا",
      "سازگاری ملے ، منزل کی فضا خوش رکھے",
      "",
      "تم نے ماں باپ کو خوش اپنی سعادت سے کیا",
      "مالکِ روزِ جزا تم کو سوا خوش رکھے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "نظمیں",
    "title": "ترکِ وطن",
    "desc": [
      "مرہموں کی صورت میں زہر بھی ملے ہم کو",
      "نشتروں کے دھوکے میں وار بھی ہوئے اکثر",
      "منزلوں کی لالچ میں راستے گنوا ڈالے",
      "رہبروں کی چاہت میں خوار بھی ہوئے اکثر",
      "",
      "ہر فریب  ِتازہ کومسکرا کے دیکھا تھا",
      "دل کو عہدِ رفتہ کےطور ابھی نہیں بھولے",
      "چشم ِ خوش گما ں گرچہ تیرگی میں الجھی تھی",
      "خواب دیکھنا لیکن ہم کبھی نہیں بھولے",
      "",
      "چُور ہوگئے بازو اک نبرد ِ پیہم سے",
      "دامن ِ رواداری ہاتھ سے نہیں چھوڑا",
      "اک بھرم رہا جب تک اِس سفید پوشی کا",
      "دردکی امانت سے ہم نے منہ نہیں موڑا",
      "",
      "سنگِ رہ گوارا تھے ، ہر سراب تھا منظور",
      "رہزنوں سے تنگ آکر راستے بدل ڈالے",
      "یوں نہیں کہ کھو بیٹھے ہم یقین ِ منزل کو",
      "بس وہاں رسائی کے واسطے بدل ڈالے",
      "",
      "دشتِ ترکِ الفت سے ہجر نے پکارا تھا",
      "ہم تمام زنجیریں توڑ کر چلے آئے",
      "کاروبارِ نقدِ جاں ، داستانِ حسن ِ و عشق",
      "سب کو درمیاں میں ہم چھوڑ کر چلے آئے",
      "",
      "کسبِ نان ِ سادہ میں دن کو کرلیا مصروف",
      "شام ہم نے کر ڈالی وقفِ یادِ دلداراں",
      "دل کو رکھ دیا ہم نے رہنِ آشنا دشمن",
      "دھڑکنیں کسے کرتے نذر بعدِ دلداراں",
      "",
      "اک تضادِ جسم و جاں ہے دیارِ ہجرت میں",
      "کوبکو ہیں سرگرداں ، موسموں کو گنتے ہیں",
      "ہر نئے مسیحا سے باندھ کر امیدیں ہم",
      "",
      "تہمتیں سہی ہم پر ہاں گریزپاِئی کی",
      "سست گام ہیں مانا ، پر سفر تو جاری ہے",
      "ہاں نہیں رہے شامل کارواں میں ہم ، لیکن",
      "مرکزِ یقیں اب بھی آرزو ہماری ہے",
      "",
      "دامنِ وفا گرچہ دھجیاں ہوا کب کا",
      "جسم سے یہ پیراہن نوچ بھی نہیں سکتے",
      "ہم جہاں نوردوں میں لاکھ عیب ہیں لیکن",
      "گھر سے بے وفائی کا سوچ بھی نہیں سکتے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "نظمیں",
    "title": "حرفِ گم",
    "desc": [
      "کہیں نہیں ہے کہیں نہیں ہے ، وہ حرفِ باطل کہیں نہیں ہے",
      "سرِ ورق پر  سجا کے جس کو ، پڑھائے جاتے ہیں فی زمانہ",
      "دروسِ نفرت بنامِ مذہب ، کتاب میں تو کہیں نہیں ہے!",
      "مفسّرانِ نفاق پرور شمارِ سبحہ کے زیر و بم پر",
      "سکھا رہے ہیں جو شرحِ کاذب کہ نغمگیں ہے",
      "نصاب میں تو کہیں نہیں ہے!",
      "کلاہِ شہرت سروں پہ رکھے ، قبائے حرص و ہوا سنبھالے",
      "درونِ مکتب سیاستوں کی غلام گردش میں پلنے والے",
      "عقیدتوں کے عجیب چہرے ، تفرّقوں کے نقاب ڈالے",
      "مظاہروں میں سجے ہوئے ہیں",
      "بزعمِ تقویٰ ہزاروں بازو مخاصمت کے نصاب تھامے",
      "مثالِ خنجر اٹھے ہوئے ہیں ، مجادلے پر تُلے ہوئے ہیں",
      "فقیہِ نکتہ سرا کے فتوے ، خطیبِ شعلہ نوا کے لہجے",
      "منافقت سے بھرے ہوئے ہیں ، منافرت میں رنگے ہوئے ہیں",
      "اخوتوں کو عداوتوں سے بدل کے خلقِ خدا کو باہم",
      "بنامِ  مسلک لڑا رہے ہیں",
      "فضائے شہرِ کرم شعاراں غبارِ نفرت سے بھر گئی ہے",
      "صریرِ کلکِ خبر نگاراں صدائے وحشت سے ڈر گئی ہے",
      "ہزاروں معصوم سرخمیدہ ، بدن دریدہ ، لہو بہ دیدہ",
      "گناہ ِلب بستگی کی اونچی صلیبِ غم پر کھنچے ہوئے ہیں",
      "فصیلِ وحدت پہ جلنے والے چراغ سارے بجھے ہوئے ہیں",
      "حواریانِ دمِ مسیحا",
      "دیارِ خفتہ کے آستانوں میں حرفِ قُم کو تلاشتے ہیں",
      "وہ حرفِ معجز جو سو گیا ہے ، جو شرحِ کاذب میں کھو گیا ہے",
      "وہ حرفِ گم تو یہیں کہیں ہے ، وہ دھڑکنوں کے بہت قریں ہے",
      "بیاضِ دل پر لکھا ہوا ہے ، سبھی کے اندر چھپا ہوا ہے",
      "خدا کے بندو! یہ دل ٹٹولو ، یہ سینے اپنے ذرا تو کھولو!",
      "منافرت کے صنم گرا کر ، عقیدتوں کی فصیل ڈھا کر",
      "زباں سے بولو ، فضا میں گھولو وہ حرفِ وحدت جو بالیقیں ہے",
      "وہ اسمِ اعظم جو دل نشیں ہے ، وہ جس کی حرمت  میں جاگزیں ہے",
      "ہر ایک جذبہ ، ہر ایک رشتہ ، کہ جس کے دم سے محبتیں ہیں",
      "محبتیں جو اداس گم صم",
      "تمہارے چہروں کو تک رہی ہیں ، نجانے کب سے سسک رہی ہیں",
      "خد ا کے  بندو!  خموش لوگو !  محبتوں  کو  زبان  دے  د و !",
      "محبتوں کی زباں حسیں  ہے !",
      "جمالِ رب کی قسم ہے لوگو!",
      "محبتوں میں زیاں نہیں ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "نظمیں",
    "title": "ڈیژا وُو",
    "desc": [
      "جھیل کی سرد ہوا ہے یہ مرے چاروں طرف",
      "یا کسی بھولی ہوئی یاد کا جھونکا ہے کوئی",
      "مجھے چُھوتی ہوئی گذری ہے تو محسوس ہوا",
      "جیسے اک یاد کے یخ بستہ دریچے پہ کہیں",
      "عکسِ امروز نے موہوم سی دستک دی ہے",
      "اسقدر ماند ہے اس موجۂ احساس کی رو",
      "سرمئی دھند میں لپٹا ہوا دن ہو جیسے",
      "یادِ ماضی کا یہ بھولا ہوا لمحہ بھی کبھی",
      "وقت کی رو میں گلابوں کی طرح تازہ تھا",
      "اپنے ماحول کے سب رنگوں کی ساری حدت",
      "اپنے دامن میں لئے پوری طرح زندہ تھا",
      "جیسے ہوتا ہے مگر ویسے ہی رفتہ رفتہ",
      "فکرِ فردا کے زمستانوں کی ژالہ باری",
      "تہ بہ تہ دل کی زمیں پرہوئی ایسے شب و روز",
      "منجمد ہو گئے سوئی ہوئی یادوں کے نقوش",
      "آج اس جھیل مشی گن کے کنارے سے اِ دھر",
      "ہلکی برسات میں بھیگے ہوئے گیلے پتے",
      "اپنی رعنائی کی خوشبو سے مہک کر خود ہی",
      "تال پر بوندوں کی بجنے لگے دھیرے دھیرے",
      "دُور اک موجۂ بےتاب نے اٹھ کر جیسے",
      "ساتھ اُڑتے ہوئے سِیگل کا چمکتا سا بدن",
      "ذرا دھیرے سے چُھوا اور یونہی چھوڑ دیا",
      "جانے کیا وعدۂ و پیماں ہوئے اُس لمحے میں",
      "پاس اک شرمگیں چہرے پہ دھنک پھیل گئی",
      "گل ستاں جیسے سمٹ جائے کسی غنچے میں",
      "رقص کرتی ہوئی کچھ شوخ سی بیباک ہوا",
      "اک کھلی زلف سے اُلجھی تو یہ سوچا میں نے",
      "جھیل کی سرد ہوا ہے یہ مرے چاروں طرف",
      "یا کسی بھولی ہوئی یاد کا جھونکا ہے کوئی",
      "یہ سمے مجھ پہ کہیں پہلے بھی ہو گذرا ہے",
      "یا کہیں میرے تصور کا یہ دھوکا ہے کوئی",
      "",
      "ڈور کاؤنٹی  ۔ وسكانسن ۔ ۲۰۰۲",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "نظمیں",
    "title": "رخصتی",
    "desc": [
      "راحتِ جاں ناز پرور سب مسرّت تم سے ہے",
      "افتخار و شادمانی کی یہ دولت تم سے ہے",
      "خانۂ آباد کی یہ شان و شوکت تم سے ہے",
      "رونقِ بزمِ عروسی کی ضمانت تم سے ہے",
      "",
      "محفلِ شادی کی رونق دائمی ہو شاد باد",
      "رنگِ عشرت سے مزیّن آرسی ہو شاد باد",
      "آنے والی زندگی کی ہرگھڑی ہو شاد باد",
      "اک نئے جیون کی خاطر رخصتی ہو شاد باد",
      "",
      "دیر تک تازہ گلابوں کی مہک باقی رہے",
      "پھول چہرے پر تبسم کی دھنک باقی رہے",
      "عمر بھر تابندہ سہرے کی چمک باقی رہے",
      "اِن سہاگن چوڑیوں کی ہر کھنک باقی رہے",
      "",
      "ہو مبارک تم کو اپنی زندگانی کا سفر",
      "اک نئے بندھن میں دل کی شادمانی کا سفر",
      "اک نئی دنیا میں دشتِ جاودانی کا سفر",
      "رحمتِ حق سے ہو ثابت کامرانی کا سفر",
      "زندگی کے راستے میں آگہی ہو ہر قدم",
      "آرزوئیں کامراں ہوں بس خوشی ہو ہر قدم",
      "جس طرف جاؤ سفر میں روشنی ہو ہر قدم",
      "رشک سے منزل تمہی کو دیکھتی ہو ہر قدم",
      "",
      "چاند تاروں سے سجی اِک کہکشاں تم کو ملے",
      "تم جہاں جاؤ مقدّر مہرباں تم کو ملے",
      "ہمسفر کا ساتھ اپنے جاوداں تم کو ملے",
      "بجلیوں سے دُور ہو وہ آشیاں تم کو ملے",
      "",
      "آج بچپن کی سکھی سنگت سے ناتا توڑ کر",
      "اپنے پیاروں کی رفاقت سے توجہ موڑ کر",
      "اک نئی نسبت سے اپنی ہر تمنا جوڑ کر",
      "اپنے بابل کے بھرے گھر کو اکیلا چھوڑ کر",
      "",
      "کہہ رہی ہو الوداع اشکوں بھری آنکھوں کے سنگ",
      "لگ کے سینے رو رہی ہو بھایئوں بہنوں کے سنگ",
      "لو تمہیں رخصت کیا اب اَن کہے لفظوں کے سنگ",
      "جاؤ تم مہماں سرا سے اپنے گھر خوشیوں کے سنگ",
      "",
      "میٹھی یادوں کی مہکتی سی ہوائیں اپنے ساتھ",
      "بھَولے بچپن کی سنہری سی فضائیں اپنے ساتھ",
      "اپنے دامن میں بھرے گھر کی وفائیں اپنے ساتھ",
      "نورِ دل ماں باپ کی لے جا دعائیں اپنے ساتھ",
      "",
      "لو مبارک ہو تمہیں وقتِ سفر اب الوداع",
      "باندھ کر اشکوں کے سب لعل و گہر اب الوداع",
      "جاؤ بابل کے نگر سے اپنے گھر اب الوداع",
      "اے مری دختر مری نورِ نظر اب الوداع",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "نظمیں",
    "title": "ریت گھڑی",
    "desc": [
      "(لمبی اداسی تان کے چپ سوگیا ہے وقت)",
      "",
      "ٹھہری ہے ایک نقطے پہ گزرانِ روز و شب",
      "خود اپنی گردشوں میں کہیں کھو گیا ہے وقت",
      "گرتا ہے ریزہ ریزہ سا لمحوں کا ریگزار",
      "شیشے کے ایک ظرف میں گم ہو گیا ہے وقت",
      "اُلٹے گا ریگزار یہ دورانیے کے بعد",
      "پھر سے پلٹ کر آئے گا اب جو گیا ہے وقت",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "نظمیں",
    "title": "عشق",
    "desc": [
      "پیکرِ خاک میں تاثیرِ شرر دیتا ہے",
      "آتشِ درد میں جلنے کا ثمر دیتا ہے",
      "",
      "اک ذرا گردشِ ایّام میں کرتا ہے اسیر",
      "دسترس میں نئے پھر شام و سحر دیتا ہے",
      "",
      "پہلے رکھتا ہے یہ آنکھوں میں شب ِ تیرہ وتار",
      "دستِ امکان میں پھر شمس و قمر دیتا ہے",
      "",
      "دل پہ کرتا ہے یہ تصویر جمالِ ہستی",
      "پھر مٹاکر اُسے اک رنگِ دگر دیتا ہے",
      "",
      "جذب ِ صادق ہو تو کرتا ہے مقدر منزل",
      "کارِ بے نام کو عنوانِ ظفر دیتا ہے",
      "",
      "دور جائیں تو بلاتا ہے یہ اپنی جانب",
      "لوٹ کر آئیں تو پھر اذنِ سفر دیتا ہے",
      "",
      "",
      "اُس میں قید ِ درودیوار نہیں رکھتا عشق",
      "اپنے آشفتہ مزاجوں کو جو گھر دیتا ہے",
      "",
      "یہ کرشمہ ہے عجب عشق ِ تضاد آور کا",
      "پھول سے جسم کو پتھر کا جگر دیتا ہے",
      "",
      "لمس پارس تو نہیں بنتا ،مگر یہ سچ ہے",
      "ڈھونڈنے والوں کو مٹی میں گہر دیتا ہے",
      "",
      "تابِ گویائی چرا لیتا ہے ان ہونٹوں کی",
      "عشقِ پرکار جب آنکھوں کو نظر دیتا ہے",
      "",
      "قلبِ فنکار کو دیتا ہے یہ روحِ احساس",
      "پھر اسے جراءتِ اظہار ِ ہنر دیتا ہے",
      "",
      "آؤ چلتے ہیں ذرا بزم ِ سخن میں اسکی",
      "لوگ کہتے ہیں وہ لفظوں کو اثر دیتا ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "نظمیں",
    "title": "قطبی رات",
    "desc": [
      "دل کہ اک جزیرہ ہے",
      "گہرے سرد پانی میں",
      "منجمد سفینہ ہے",
      "درد کی روانی میں",
      "برف سارا عالم ہے",
      "سرمئی سے موسم میں",
      "منجمد سے روز و شب",
      "کُہر کے نقابوں سے",
      "چہرہ تکتے رہتے ہیں",
      "اجنبی زبانوں میں",
      "اَن کہی سی کہتے ہیں",
      "اک طرف شمال کی",
      "ہفت رنگ روشنی",
      "آرزو کے پردے پر",
      "رنگ رنگ خوابوں کا",
      "جال بُنتی رہتی ہے",
      "آس لکھتی رہتی ہے",
      "دل میں جھانک کر میرے",
      "چپکے چپکے کہتی ہے",
      "رات پھر بھی رات ہے",
      "رات کی شکا یت تو",
      "ناروا سی بات ہے",
      "گرچہ ناروائی میں",
      "ناروے کی رات ہے",
      "وقت ہی تو ہے آخر",
      "وقت بیت جاتا ہے",
      "درد جتنا ظالم ہو",
      "صبر جیت جاتا ہے",
      "بے لحاظ ہے موسم",
      "بے زوال تو نہیں",
      "دوریوں کے ماہ و سال",
      "نوری سال تو نہیں",
      "گردشِ زماں نہیں",
      "گردشِ زمین ہے",
      "صبح کے نکلنے کا",
      "تم کو تو یقین ہے",
      "کچھ ہی روز باقی ہیں",
      "برف کے پگھلنے میں",
      "تیرگی کے پردے سے",
      "نور کے نکلنے میں",
      "رات کا تماشا اب",
      "کچھ ہی دیر ہونا ہے",
      "اس کے بعد ہر طرف",
      "روشنی کا سونا ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "نظمیں",
    "title": "گوشوارہ",
    "desc": [
      "کیا حال سنائیں دنیا کا ، کیا بات بتائیں لوگوں کی",
      "دنیا کے ہزاروں موسم ہیں ، لاکھوں ہی ادائیں لوگوں کی",
      "کچھ لوگ کہانی ہوتے ہیں ، دنیا کو سنانے کے قابل",
      "کچھ لوگ نشانی ہوتے ہیں ، بس دل میں چھپانے کے قابل",
      "کچھ لوگ گزرتے لمحے ہیں ، اک بار گئے تو آتے نہیں",
      "ہم لاکھ بلانا بھی چاہیں ، پرچھائیں بھی اُن کی پاتے نہیں",
      "کچھ لوگ خیالوں کے اندر جذبوں کی روانی ہوتے ہیں",
      "کچھ لوگ کٹھن لمحوں کی طرح پلکوں پہ گرانی ہوتے ہیں",
      "کچھ لوگ سمندر گہرے ہیں ، کچھ لوگ کنارہ ہوتے ہیں",
      "کچھ ڈوبنے والی جانوں کو تنکے کا سہارا ہوتے ہیں",
      "کچھ لوگ چٹانوں کا سینہ ، کچھ ریت گھروندا چھوٹا سا",
      "کچھ لوگ مثالِ ابر ِرواں ، کچھ اونچے درختوں کا سایا",
      "کچھ لوگ چراغوں کی صورت راہوں میں اجالا کرتے ہیں",
      "کچھ لوگ اندھیرے کی کالک چہروں پہ اُچھالا کرتے ہیں",
      "کچھ لوگ سفر میں ملتے ہیں ، دوگام چلے اور رستے الگ",
      "کچھ لوگ نبھاتے ہیں ایسا ، ہوتے ہی نہیں دھڑکن سے الگ",
      "کیا حال سنائیں اپنا تمہیں ، کیا بات بتائیں جیون کی؟",
      "اک آنکھ ہماری ہنستی ہے ، اک آنکھ میں رُت ہے ساون کی",
      "ہم کس کی کہانی کا حصہ ، ہم کس کی دعا میں شامل ہیں؟",
      "ہے کون جو رستہ تکتا ہے ہم کس کی وفا کا حاصل ہیں؟",
      "کس کس کا پکڑ کر دامن ہم اپنی ہی نشانی کو پوچھیں؟",
      "ہم کھوئے گئے کن راہوں میں ، اس بات کو صاحب جانے دیں",
      "کچھ درد سنبھالے سینے میں ، کچھ خواب لٹائے ہیں ہم نے",
      "اک عمر گنوائی ہے اپنی ، کچھ لوگ کمائے ہیں ہم نے",
      "دل خرچ کیا ہے لوگوں پر ، جاں کھوئی ہے ، غم پا یا ہے",
      "اپنا تو یہی ہے سود و زیاں ، اپنا تو یہی سرمایا ہے",
      "اپنا تو یہی سرمایا ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "نظمیں",
    "title": "مرہموں کی آس میں",
    "desc": [
      "زخم ہائے جاں لئے مرہموں کی آس میں",
      "کب سے چل رہا ہوں میں دہرِ ناسپاس میں",
      "چلتے چلتے خاک تن ہوگیا ہوں خاک میں",
      "تار ایک بھی نہیں اب قبا کے چاک میں",
      "دل نشان ہوگیا ایک یاد کا فقط",
      "رہ گئی ہے آنکھ میں ایک دید کی سکت",
      "زہر جو ہوا میں تھا آگیا ہے سانس میں",
      "ذہن میں گرہ جو تھی وہم کے لباس میں",
      "پھانس بن کے درد کی شاہ رگ میں گڑ گئی",
      "کرب اِس قدر سوا ، یاد ماند پڑ گئی",
      "ٹیسیں روز اٹھتی ہیں درد کے پگھلنے تک",
      "درد جانے کتنے ہیں حالِ دل سنبھلنے تک",
      "اور کتنا روؤں اب ، اشک خوں تو ہو گئے",
      "رنگ وحشتوں کے سب ، ہاں جنوں تو ہوگئے",
      "دشتِ ہجر کی ہوا داؤ سارے چل چکی",
      "اور کتنا چلنا ہے ، رات کتنی ڈھل چکی",
      "تارے کتنے ٹوٹیں گے تیرگی کے چھٹنے تک",
      "ناشکیب و نا رسا بخت کے پلٹنے تک",
      "مہر کے نکلنے میں قہر کتنے رہتے ہیں",
      "کاسۂ جدائی میں زہر کتنے رہتے ہیں",
      "درد کتنے باقی ہیں لا علاج ہونے میں",
      "اشک کتنے باقی ہیں تجھ سے مل کے رونے میں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "نظمیں",
    "title": "وطنِ عزیز میں حکومت کی تبدیلی پر",
    "desc": [
      "ایک چہرہ بدل گیا ہوگا",
      "ایک پرچم اتر گیا ہوگا",
      "ایک دنیا سَنور چلی ہوگی",
      "ایک عالَم بکھر گیا ہوگا",
      "نشرگاہوں سے پھر فضاؤں میں",
      "وعدۂ خوب تر گیا ہو گا",
      "پھر خوشامد کا حرفِ بے توقیر",
      "سرخیوں میں اُبھر گیا ہوگا",
      "کچھ سیاسی بیان بازوں کا",
      "آج قبلہ سدھر گیا ہوگا",
      "رُخ بدلتے وفا فروشوں سے",
      "شہر بازار بھر گیا ہوگا",
      "سر ِ منبر خراج دینے کو",
      "واعظِ نامور گیا ہوگا",
      "مہر ِ تائید لے کے بیعت میں",
      "مفتیِ معتبر گیا ہوگا",
      "اک کلاہِ ہزار منصب و جاہ",
      "کج اداؤں کے گھر گیا ہوگا",
      "ایک الزام ِ سرکشی پھر سے",
      "اہلِ  غیرت  کے سر گیا ہوگا",
      "حاکم ِ شہر کا طلب نامہ",
      "ہر مخالف کے گھر گیا ہوگا",
      "زرِ تاوان لینے ہرکارہ",
      "کوبکو دربدر گیا ہوگا",
      "سرپھروں کو دروغۂ زنداں",
      "پا بہ زنجیر کر گیا ہوگا",
      "جرم اپنے بھی صاحبِ میزان",
      "بے گناہوں پہ دھر گیا ہوگا",
      "ایک دنیا سنور چلی ہوگی",
      "ایک عالم بکھر گیا ہوگا",
      "ایک چہرہ بدل گیا ہوگا",
      " ایک پرچم اتر گیا ہوگا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "نظمیں",
    "title": "وہیں تو عشق رہتا ہے",
    "desc": [
      "جہاں ہونے نہ ہونے کی حدیں آپس میں ملتی ہیں",
      "جہاں غم گیت گاتے ہیں ، جہاں ہر درد ہنستا ہے",
      "وہیں ہے گھر محبت کا ، وہیں تو عشق رہتا ہے",
      "جہاں حدِ نظر تک نیلگوں گہرے سمندر کے",
      "سنہری ساحلوں پر دھوپ کوئی نام لکھتی ہے",
      "ہوا کی موج بکھرے بادلوں سے رنگ لے لے کر",
      "شفق کی زرد تختی پر گلابی شام لکھتی ہے",
      "جہاں اقرار وپیماں کے گھنے شیشم تلے سورج",
      "نئے اک دن کی خاطر تیرگی کے وار سہتا ہے",
      "جہاں اک آس کی خوشبو میں لپٹا یاس کا سایہ",
      "کسی کی نظم لکھتا ہے ، کسی کے شعر کہتا ہے",
      "",
      "اداسی جب کبھی دل پر کمندیں ڈال دیتی ہے",
      "تھکن جب دھڑکنوں میں نا امیدی گھول دیتی ہے",
      "تو اُس لمحے دبے پاؤں کسی احساس کا پیکر",
      "قریب آکر بجھی آنکھوں پہ رکھ کر ہاتھ پیچھے سے",
      "دبی سرگوشیوں کے نرمگیں لہجے میں کہتا ہے",
      "یہ غم میری امانت ہے ، تم اِس سے ہار مت جانا",
      "تمہیں میری قسم دیکھو کبھی اُس پار مت جانا",
      "جہاں ہونے نہ ہونے کی حدیں آپس میں ملتی ہیں",
      "جہاں کوئی نہیں بستا ، جہاں کوئی نہیں رہتا",
      "",
      "پلٹ کر دیکھئے اُس پل تو کوئی بھی نہیں ہوتا",
      "بس اک موہوم سی آہٹ اور اک مانوس سی خوشبو",
      "فضا میں جیسے بکھری ہو ، ہوا جیسے مہکتی ہو",
      "تبسم کی چنبیلی اور ترنم کے گلابوں سے",
      "ڈھکے ٹیلوں کے دامن میں ، ذرا سی دور خوابوں سے",
      "منقش جھلملاتی یاد کی پگھلی ہوئی چاندی",
      "کا اک آئینہ بہتا ہے",
      "وہیں تو گھر ہمارا ہے ، وہیں تو عشق رہتا ہے",
      "وہیں تو عشق رہتا ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "قطعات",
    "title": "",
    "desc": [
      "اِس دور کے گھور اندھیرے میں اک یاد سہارا دیتی ہے",
      "جب بھی میں بھٹکنے لگتا ہوں منزل کا اشارہ دیتی ہے",
      "طوفاں کے تھپیڑے سہتا ہوں اور سوچتا ہوں کب آئیگی",
      "وہ موجِ اماں جو آوارہ کشتی کو کنارا دیتی ہے",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "قطعات",
    "title": "",
    "desc": [
      "رشتہ کچھ ایسا بندھ گیا کارِ حیات سے",
      "ہم جس طرف گئے وہیں مصروفیت گئی",
      "مانا کہ آگیا ہمیں جینے کا فن مگر",
      "اس چہرۂ حیات سے معصومیت گئی",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "قطعات",
    "title": "",
    "desc": [
      "جل بجھے ہم تو ہوا ایک زمانہ واقف",
      "واقعہ اپنے بکھرنے کا سبھی نے دیکھا",
      "لوگ پتھر تھے یا پھر ہم تھے شہاب ثاقب",
      "ٹوٹ کر گرنے سے پہلے نہ کسی نے دیکھا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "قطعات",
    "title": "",
    "desc": [
      "اپنی سچائی کی پاداش میں جلتے ہوئے لوگ",
      "روشنی دیتے ہوئے نور میں ڈھلتے ہوئے لوگ",
      "رات کی راہ گزر پر نظر آتے ہیں مجھے",
      "چیر کر سینۂ ظلمت کو نکلتے ہوئے لوگ",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "قطعات",
    "title": "",
    "desc": [
      "حوصلہ قافلے والوں کا بڑھاتے رہنا",
      "منزلیں دور ہیں قدموں کو ہلاتے رہنا",
      "میں حدی خواں ہوں مرا کام صدائیں کرنا",
      "میری آواز میں آواز ملاتے رہنا",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "قطعات",
    "title": "",
    "desc": [
      "سہما ہوا ہے کمرے میں برسوں کا انتظار",
      "جالے ہیں فرقتوں کے کواڑوں کے بیچ میں",
      "اک شخص ٹوٹ کر ہوا کچھ اور پُر بہار",
      "اُگتے ہوں جیسے پھول دراڑوں کے بیچ میں",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "قطعات",
    "title": "",
    "desc": [
      "ہر لمحہ زہرِ نو کوئی پی کر دکھائے تو",
      "مر مر کے شہرِ ہجر میں جی کر دکھائے تو",
      "اپنے ہی ہاتھوں اپنا کلیجہ کیا ہے چاک",
      "چارہ گری کرے ، کوئی سی کر دکھائے تو",
      ""
    ],
    "author": "ظہیؔر احمد"
  },
  {
    "cat": "نعت شریف",
    "title": "",
    "desc": [
      "وہ ایک شخص دو عالم کی سروری والا",
      "شعور دے گیا شاہوں کو سادگی والا",
      "",
      "ہزاروں چاند ستارے وہ کرگیا روشن",
      "وہ اک چراغ تھا سورج کی روشنی والا",
      "",
      "وہ مُہر ِختمِ نبوت ، وہ حرفِ آخرِ حق",
      "وہ اک رسول رسولوں میں آخری والا",
      "",
      "قریبِ عرش خدا سے وہ محوِ راز و نیاز!",
      "زمیں پہ نقشِ اطاعت وہ بندگی والا",
      "",
      "نگار خانۂ سیرت کا شاہکارِ ہے وہ!",
      "وہ نقشِ خاص خدا کی مصوری والا",
      "",
      "کھڑا ہے راہِ خدا میں وہ خلق سے آگے",
      "علَم اٹھائے ہوئے شانِ رہبری والا",
      "",
      "ہر ایک چشمۂ عرفاں اُسی سے نکلا ہے",
      "وہی ہے منبعِ اعجاز آگہی والا",
      "",
      "شعار اُس کا ہے معراجِ خُلقِ نوعِ بشر",
      "سلوک اُس کا ہے تکریمِ آدمی والا",
      "",
      "شعاعِ نورِ ہدایت ہے اُس کی ہر تعلیم",
      "دلوں سے داغ مٹاتی ہے تیرگی والا",
      "",
      "وہ بدنصیب جو منکر ہیں اُس کی سنّت کے",
      "مزاج رکھتے ہیں خواہش کی پیروی والا",
      "",
      "کٹاؤ گردنِ پندار اُس کے لفظوں پر",
      "پیامِ احمدِ مرسل ہے زندگی والا",
      "",
      "مرا امام ہے لوگو وہ انبیاء کا امام",
      "زمانے بھر میں نہیں جس کی ہمسری والا",
      "",
      "عدن بنا گیا مسجد کو اپنے سجدوں سے",
      "مکینِ خاص مدینے کی اک گلی والا",
      "",
      "بڑے ادب سے اُس اُمّی لقب کے قدموں میں",
      "قلم بھی رکھتا ہے قرطاس عاجزی والا",
      "",
      "سخن تو حسبِ مراتب نہیں ظہیؔر کے پاس",
      "درودِ سادہ ہے لیکن یہ شاعری والا",
      "",
      "الہٰی جب بھی فرشتے پڑھیں صلوٰۃ و سلام",
      "مرا سلام بھی پہنچے یہ بے بسی والا",
      "",
      "بنادے میرا ٹھکانا بھی اِس کی مٹی میں",
      "نبی کے شہر میں آیا ہے بے گھری والا",
      ""
    ],
    "author": "ظہیؔر احمد"
  }
]

