[
  {
    "cat": "متفرق اشعار",
    "title": "",
    "desc": [
      "اک بات کہہ رہے ہیں شاعر سبھی غزل کے",
      "اک شعر ہورہا ہے مصرعے بدل بدل کے",
      "٭٭٭",
      "مجھ کو شریکِ غم بنا ، اپنا شریکِ حال رکھ",
      "اتنا بھی خود غرض نہ بن ، کچھ تو مرا خیال رکھ",
      "٭٭٭",
      "توفیقِ دعا دے تو اثر ساتھ میں دینا",
      "دربازیِ بخشش کی خبر ساتھ میں دینا",
      "٭٭٭",
      "ہر تہمتِ غرور و تکبر سے پاک ہیں",
      "ہم اہلِ انکسار کے قدموں کی خاک ہیں",
      "٭٭٭",
      "اس بے کل دل کی دھڑکن سے چاہت کا اک تار بندھا ہے",
      "تار بھی کیسا انہونا جو ساگر کے اُس پار بندھا ہے",
      "٭٭٭",
      "اک شخص جو گزرا ہوا قصہ ہے زندگی کا",
      "اب کیا کہیں کہ آج بھی حصہ ہے زندگی کا",
      "٭٭٭",
      "کاش ایسا ہو کوئی بات ضروری رہ جائے",
      "آج پھر اُن سے ملاقات ادھوری رہ جائے",
      "٭٭٭",
      "بولوں تو ساری دنیا اُسے جان جائے گی",
      "اور چپ رہوں تو پھر مری پہچان جائے گی",
      "٭٭٭",
      "مال و متاع ِ درد میں سمجھو نہ کم ہمیں",
      "میراث میں ملے ہیں یہ نسلوں کے غم ہمیں",
      "٭٭٭",
      "ہم سے بڑھ کر تو کو ئی خاک میں کھویا بھی نہ تھا",
      "پھر بھی وہ کاٹ رہے ہیں کہ جو بویا بھی نہ تھا",
      "٭٭٭",
      "رستے طویل ہو گئے یا گھٹ گیا ہے دن",
      "اب تک سفر نہیں کٹا اور کٹ گیا ہے دن",
      "٭٭٭",
      "میں کہیں ، یاد کہیں ، خواب کہیں ہے میرا",
      "جو نظر آتا ہے میرا ، وہ نہیں ہے میرا",
      "٭٭٭",
      "نظر میں روشنی رکھنا کسی حوالے کی",
      "چراغِ راہ ضمانت نہیں اجالے کی",
      "٭٭٭",
      "کبھی آنکھوں سے کوئی خواب بچھڑ جاتا ہے",
      "صبح کی آس میں مہتاب بچھڑ جاتا ہے",
      "٭٭٭",
      "اب کوئی در ، نہ کوئی راہ گزر دیکھوں گا",
      "ویسے ممکن تو نہیں پھر بھی میں کر دیکھوں گا",
      "٭٭٭",
      "شب سرائے میں پہنچ کر مجھے رخصت دے گا",
      "پھر وہی کام سویرے جو مسافت دے گا",
      "٭٭٭",
      "ہر سفر اب مجھے ہجرت کا سفر لگتا ہے",
      "گھر کو جاتے ہوئے رستے سے بھی ڈر لگتا ہے",
      "٭٭٭",
      "گزر رہی ہے تری یاد کی حضوری میں",
      "نشاطِ قرب میسر ہے اتنی دوری میں",
      "٭٭٭",
      "دل جہاں کھویا ، وہیں پندارِ غم بھی کھو دیا",
      "برسوں بعد اُس سے ملا تو مل کے میں بھی رو دیا",
      "٭٭٭",
      "تلاشِ ذات کی منزل تو اک ٹھکانہ ہے",
      "سفر کے بعد مجھے لوٹ کر بھی آنا ہے",
      "٭٭٭",
      "اپنی دنیا میں تھا دیوانہ وہیں بہتر تھا",
      "تہمتِ ہوش سے پتھر ہی کہیں بہتر تھا",
      "٭٭٭",
      "میں کل کے نام پر اپنا ہر آج دیتا رہا",
      "تمام عمر یہ کیسا خراج دیتا رہا",
      "٭٭٭",
      "خدا کرے مرا دن یوں تمام ہوجائے",
      "تری گلی میں ٹھکانہ ہو شام ہوجائے",
      "٭٭٭",
      "فرصتِ غم جو ملی بھی مجھے کچھ دن کے لئے",
      "مجھ سے بدلے غمِ ایام نے گن گن کے لئے",
      "٭٭٭",
      "ایثار و احترام سے آباد چاہئے",
      "گھر کو بلندیاں نہیں بنیاد چاہئے",
      "٭٭٭",
      "یہ کس گمان پر اتنا غرور کرتے ہو",
      "جو دل میں آئے تمہارے ضرور کرتے ہو",
      "٭٭٭",
      "قاتل تمام سچے ، بسمل تمام جھوٹے",
      "دیت جو مانگتے ہیں سائل تمام جھوٹے",
      "٭٭٭",
      "مجھی سے شکوۂ ترک تعلقات کرے",
      "کسی بہانے تو آئے وہ کوئی بات کرے",
      "٭٭٭",
      "کھو جائے دن کسی کا تو درمان کیا کرے",
      "آ جائے سر پہ شام تو انسان کیا کرے",
      "٭٭٭",
      "زندگی شہد ہے یا زہر ہے پی کر دیکھو",
      "پہلے رگ رگ میں اُتارو اسے جی کر دیکھو",
      "٭٭٭",
      "زندگی نشتروں سے بھر پائی",
      "دوستو بس کرو مسیحائی",
      "٭٭٭",
      "دوائیں ہار گئیں ، تھک گئے مسیحا بھی",
      "مرض ہے دل میں کوئی درد کے علاوہ بھی",
      "٭٭٭",
      "بیچ رستے ہی سے اے کاش پلٹ جاتے ہم",
      "راہ میں یوں نہ بکھرتے جو سمٹ جاتے ہم",
      "٭٭٭",
      "کیا قیامت ہے کہ خود اپنا ہی گھر بھول گئے",
      " ہم وہ راہی ہیں جو آغازِ سفر بھول گئے",
      "٭٭٭",
      "دیئے جلاؤ جہاں تیرگی نظر آئے",
      "نجانے کون سے گوشے سے کب سحر آئے",
      "٭٭٭",
      "شکوہ کسی کا سارے زمانے سے کر لیا",
      "کس کا گلہ تھا کس کے بہانے سے کرلیا",
      "٭٭٭",
      "دیکھا ہے حقیقت کو تیرے ہی حوالے سے",
      "ہر شے نظر آتی ہے اندر کے اجالے سے",
      "٭٭٭",
      "ہاتھ سونے چاندی سے کھینچ لیں تو ڈستا ہے",
      "اک سنہرے پھن والا ناگ ہم میں بستا ہے",
      "٭٭٭",
      "اب تو یہ فیصلہ ہوجائے کدھر جانا ہے",
      "ابھی رستوں میں بھٹکنا ہے کہ گھر جانا ہے",
      "٭٭٭",
      "غمِ دوراں سے رہا ہو کے کدھر جانا ہے",
      "اسی زنداں میں ہمیں جینا ہے مرجانا ہے",
      "٭٭٭",
      "تمہاری زلف کے سائے میں چاند رات کریں",
      "ہماری عید یہی ہے کہ تم سے بات کریں",
      "٭٭٭",
      "تمہارے شوخ لبوں سے چرا کے شرماہٹ",
      "گلاب و لالۂ و سنبل کے رنگ مات کریں"
    ]
  }
]
